$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '9.4.0',
          'Headers' => {
                         'buffer.h' => 1,
                         'file_wrappers.h' => 1,
                         'garray.h' => 1,
                         'ghash.h' => 1,
                         'glibconfig.h' => 1,
                         'glist.h' => 1,
                         'gslist.h' => 1,
                         'gtypes.h' => 1,
                         'inet_ipv4.h' => 1,
                         'inet_ipv6.h' => 1,
                         'lz4frame.h' => 1,
                         'merge.h' => 1,
                         'nstime.h' => 1,
                         'pcap-encap.h' => 1,
                         'pcapng_module.h' => 1,
                         'stat.h' => 1,
                         'stddef.h' => 1,
                         'struct_timespec.h' => 1,
                         'time_t.h' => 1,
                         'types.h' => 1,
                         'wtap-int.h' => 1,
                         'wtap.h' => 1,
                         'wtap_opttypes.h' => 1,
                         'zconf.h' => 1,
                         'zlib.h' => 1,
                         'zstd.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libwiretap.so.13.0.0',
          'LibraryVersion' => '13.0.0',
          'NameSpaces' => {},

                                                     'wtap_name_to_encap' => 1,
                                                     'wtap_name_to_file_type_subtype' => 1,
                                                     'wtap_open_offline' => 1,
                                                     'wtap_opttypes_cleanup' => 1,
                                                     'wtap_opttypes_initialize' => 1,
                                                     'wtap_packet_verdict_free' => 1,
                                                     'wtap_pcap_encap_to_wtap_encap' => 1,
                                                     'wtap_pcap_file_type_subtype' => 1,
                                                     'wtap_pcap_nsec_file_type_subtype' => 1,
                                                     'wtap_pcapng_file_type_subtype' => 1,
                                                     'wtap_plugins_supported' => 1,
                                                     'wtap_read' => 1,
                                                     'wtap_read_bytes' => 1,
                                                     'wtap_read_bytes_or_eof' => 1,
                                                     'wtap_read_packet_bytes' => 1,
                                                     'wtap_read_so_far' => 1,
                                                     'wtap_rec_cleanup' => 1,
                                                     'wtap_rec_init' => 1,
                                                     'wtap_rec_reset' => 1,
                                                     'wtap_register_encap_type' => 1,
                                                     'wtap_register_file_type_extension' => 1,
                                                     'wtap_register_file_type_subtype' => 1,
                                                     'wtap_register_open_info' => 1,
                                                     'wtap_register_plugin' => 1,
                                                     'wtap_seek_read' => 1,
                                                     'wtap_sequential_close' => 1,
                                                     'wtap_set_bytes_dumped' => 1,
                                                     'wtap_set_cb_new_ipv4' => 1,
                                                     'wtap_set_cb_new_ipv6' => 1,
                                                     'wtap_set_cb_new_secrets' => 1,
                                                     'wtap_snapshot_length' => 1,
                                                     'wtap_strerror' => 1,
                                                     'wtap_tsprec_string' => 1,
                                                     'wtap_uses_lua_filehandler' => 1,
                                                     'wtap_write_shb_comment' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10006' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1564',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '90'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '8',
                                                            'type' => '9993'
                                                          },
                                                   '2' => {
                                                            'name' => 'open_routine',
                                                            'offset' => '16',
                                                            'type' => '9909'
                                                          },
                                                   '3' => {
                                                            'name' => 'extensions',
                                                            'offset' => '24',
                                                            'type' => '90'
                                                          },
                                                   '4' => {
                                                            'name' => 'extensions_set',
                                                            'offset' => '32',
                                                            'type' => '2199'
                                                          },
                                                   '5' => {
                                                            'name' => 'wslua_data',
                                                            'offset' => '40',
                                                            'type' => '177'
                                                          }
                                                 },
                                       'Name' => 'struct open_info',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '101' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '10118' => {
                                       'BaseType' => '10006',
                                       'Name' => 'struct open_info*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10158' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1590',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPTION_NOT_SUPPORTED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ONE_OPTION_SUPPORTED',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MULTIPLE_OPTIONS_SUPPORTED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum option_support_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10171' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1595',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'opt',
                                                            'offset' => '0',
                                                            'type' => '470'
                                                          },
                                                   '1' => {
                                                            'name' => 'support',
                                                            'offset' => '4',
                                                            'type' => '10158'
                                                          }
                                                 },
                                       'Name' => 'struct supported_option_type',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10214' => {
                                       'BaseType' => '10171',
                                       'Name' => 'struct supported_option_type const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '10253' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1614',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'BLOCK_NOT_SUPPORTED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ONE_BLOCK_SUPPORTED',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MULTIPLE_BLOCKS_SUPPORTED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum block_support_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10266' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1619',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '3948'
                                                          },
                                                   '1' => {
                                                            'name' => 'support',
                                                            'offset' => '4',
                                                            'type' => '10253'
                                                          },
                                                   '2' => {
                                                            'name' => 'num_supported_options',
                                                            'offset' => '8',
                                                            'type' => '52'
                                                          },
                                                   '3' => {
                                                            'name' => 'supported_options',
                                                            'offset' => '16',
                                                            'type' => '10342'
                                                          }
                                                 },
                                       'Name' => 'struct supported_block_type',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '10337' => {
                                       'BaseType' => '10266',
                                       'Name' => 'struct supported_block_type const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '10342' => {
                                       'BaseType' => '10214',
                                       'Name' => 'struct supported_option_type const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10348' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1629',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'description',
                                                            'offset' => '0',
                                                            'type' => '90'
                                                          },
                                                   '1' => {
                                                            'name' => 'name',
                                                            'offset' => '8',
                                                            'type' => '90'
                                                          },
                                                   '2' => {
                                                            'name' => 'default_file_extension',
                                                            'offset' => '16',
                                                            'type' => '90'
                                                          },
                                                   '3' => {
                                                            'name' => 'additional_file_extensions',
                                                            'offset' => '24',
                                                            'type' => '90'
                                                          },
                                                   '4' => {
                                                            'name' => 'writing_must_seek',
                                                            'offset' => '32',
                                                            'type' => '446'
                                                          },
                                                   '5' => {
                                                            'name' => 'num_supported_blocks',
                                                            'offset' => '40',
                                                            'type' => '52'
                                                          },
                                                   '6' => {
                                                            'name' => 'supported_blocks',
                                                            'offset' => '48',
                                                            'type' => '10508'
                                                          },
                                                   '7' => {
                                                            'name' => 'can_write_encap',
                                                            'offset' => '56',
                                                            'type' => '10529'
                                                          },
                                                   '8' => {
                                                            'name' => 'dump_open',
                                                            'offset' => '64',
                                                            'type' => '10566'
                                                          },
                                                   '9' => {
                                                            'name' => 'wslua_info',
                                                            'offset' => '72',
                                                            'type' => '10572'
                                                          }
                                                 },
                                       'Name' => 'struct file_type_subtype_info',
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '10503' => {
                                       'BaseType' => '10348',
                                       'Name' => 'struct file_type_subtype_info const',
                                       'Size' => '80',
                                       'Type' => 'Const'
                                     },
                          '10508' => {
                                       'BaseType' => '10337',
                                       'Name' => 'struct supported_block_type const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10529' => {
                                       'Name' => 'int(*)(int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10560' => {
                                       'BaseType' => '9483',
                                       'Name' => 'wtap_dumper*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10566' => {
                                       'Name' => 'int(*)(wtap_dumper*, int*, gchar**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10560'
                                                           },
                                                    '1' => {
                                                             'type' => '9953'
                                                           },
                                                    '2' => {
                                                             'type' => '2199'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10572' => {
                                       'BaseType' => '9849',
                                       'Name' => 'wtap_wslua_file_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10578' => {
                                       'BaseType' => '10591',
                                       'Header' => 'wtap.h',
                                       'Line' => '1727',
                                       'Name' => 'wtap_new_ipv4_callback_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10591' => {
                                       'Name' => 'void(*)(guint const, gchar const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '482'
                                                           },
                                                    '1' => {
                                                             'type' => '549'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10613' => {
                                       'BaseType' => '10626',
                                       'Header' => 'wtap.h',
                                       'Line' => '1731',
                                       'Name' => 'wtap_new_ipv6_callback_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10626' => {
                                       'Name' => 'void(*)(void const*, gchar const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '513'
                                                           },
                                                    '1' => {
                                                             'type' => '549'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10648' => {
                                       'BaseType' => '10661',
                                       'Header' => 'wtap.h',
                                       'Line' => '1739',
                                       'Name' => 'wtap_new_secrets_callback_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10661' => {
                                       'Name' => 'void(*)(guint32, void const*, guint)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '257'
                                                           },
                                                    '1' => {
                                                             'type' => '513'
                                                           },
                                                    '2' => {
                                                             'type' => '470'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1066498' => {
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '49',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'type',
                                                              'offset' => '0',
                                                              'type' => '257'
                                                            },
                                                     '1' => {
                                                              'name' => 'internal',
                                                              'offset' => '4',
                                                              'type' => '446'
                                                            },
                                                     '2' => {
                                                              'name' => 'block',
                                                              'offset' => '8',
                                                              'type' => '3838'
                                                            },
                                                     '3' => {
                                                              'name' => 'rec',
                                                              'offset' => '16',
                                                              'type' => '10860'
                                                            },
                                                     '4' => {
                                                              'name' => 'frame_buffer',
                                                              'offset' => '24',
                                                              'type' => '10866'
                                                            }
                                                   },
                                         'Name' => 'struct wtapng_block_s',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '1066577' => {
                                         'BaseType' => '1066498',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '55',
                                         'Name' => 'wtapng_block_t',
                                         'Size' => '32',
                                         'Type' => 'Typedef'
                                       },
                          '1066589' => {
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '62',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'byte_swapped',
                                                              'offset' => '0',
                                                              'type' => '446'
                                                            },
                                                     '1' => {
                                                              'name' => 'version_major',
                                                              'offset' => '4',
                                                              'type' => '228'
                                                            },
                                                     '2' => {
                                                              'name' => 'version_minor',
                                                              'offset' => '6',
                                                              'type' => '228'
                                                            },
                                                     '3' => {
                                                              'name' => 'interfaces',
                                                              'offset' => '8',
                                                              'type' => '3130'
                                                            },
                                                     '4' => {
                                                              'name' => 'shb_off',
                                                              'offset' => '16',
                                                              'type' => '269'
                                                            },
                                                     '5' => {
                                                              'name' => 'bblog_version',
                                                              'offset' => '24',
                                                              'type' => '257'
                                                            },
                                                     '6' => {
                                                              'name' => 'bblog_offset_tv_sec',
                                                              'offset' => '32',
                                                              'type' => '281'
                                                            },
                                                     '7' => {
                                                              'name' => 'bblog_offset_tv_usec',
                                                              'offset' => '40',
                                                              'type' => '281'
                                                            }
                                                   },
                                         'Name' => 'struct section_info_t',
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '1066707' => {
                                         'BaseType' => '1066589',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '71',
                                         'Name' => 'section_info_t',
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '1066719' => {
                                         'BaseType' => '1066707',
                                         'Name' => 'section_info_t const',
                                         'Size' => '48',
                                         'Type' => 'Const'
                                       },
                          '1066724' => {
                                         'BaseType' => '1066736',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '76',
                                         'Name' => 'block_reader',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1066736' => {
                                         'Name' => 'gboolean(*)(FILE_T, guint32, gboolean, wtapng_block_t*, int*, gchar**)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '9756'
                                                             },
                                                      '1' => {
                                                               'type' => '257'
                                                             },
                                                      '2' => {
                                                               'type' => '446'
                                                             },
                                                      '3' => {
                                                               'type' => '1066782'
                                                             },
                                                      '4' => {
                                                               'type' => '9953'
                                                             },
                                                      '5' => {
                                                               'type' => '2199'
                                                             }
                                                    },
                                         'Return' => '446',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1066782' => {
                                         'BaseType' => '1066577',
                                         'Name' => 'wtapng_block_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1066788' => {
                                         'BaseType' => '1066800',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '80',
                                         'Name' => 'block_writer',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1066800' => {
                                         'Name' => 'gboolean(*)(wtap_dumper*, wtap_rec const*, guint8 const*, int*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '10560'
                                                             },
                                                      '1' => {
                                                               'type' => '11072'
                                                             },
                                                      '2' => {
                                                               'type' => '11078'
                                                             },
                                                      '3' => {
                                                               'type' => '9953'
                                                             }
                                                    },
                                         'Return' => '446',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1066836' => {
                                         'BaseType' => '1066848',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '93',
                                         'Name' => 'option_parser',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1066848' => {
                                         'Name' => 'gboolean(*)(wtap_block_t, gboolean, guint, guint8 const*, int*, gchar**)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3838'
                                                             },
                                                      '1' => {
                                                               'type' => '446'
                                                             },
                                                      '2' => {
                                                               'type' => '470'
                                                             },
                                                      '3' => {
                                                               'type' => '11078'
                                                             },
                                                      '4' => {
                                                               'type' => '9953'
                                                             },
                                                      '5' => {
                                                               'type' => '2199'
                                                             }
                                                    },
                                         'Return' => '446',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1066894' => {
                                         'BaseType' => '1066906',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '98',
                                         'Name' => 'option_sizer',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1066906' => {
                                         'Name' => 'guint32(*)(guint, wtap_optval_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '470'
                                                             },
                                                      '1' => {
                                                               'type' => '313182'
                                                             }
                                                    },
                                         'Return' => '257',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1066932' => {
                                         'BaseType' => '1066944',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '99',
                                         'Name' => 'option_writer',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1066944' => {
                                         'Name' => 'gboolean(*)(wtap_dumper*, guint, wtap_optval_t*, int*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '10560'
                                                             },
                                                      '1' => {
                                                               'type' => '470'
                                                             },
                                                      '2' => {
                                                               'type' => '313182'
                                                             },
                                                      '3' => {
                                                               'type' => '9953'
                                                             }
                                                    },
                                         'Return' => '446',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1067013' => {
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '130',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'OPT_SECTION_BYTE_ORDER',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'OPT_BIG_ENDIAN',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'OPT_LITTLE_ENDIAN',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum pcapng_opt_byte_order_e',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '10728' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1802',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'WTAP_UNCOMPRESSED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'WTAP_GZIP_COMPRESSED',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'WTAP_ZSTD_COMPRESSED',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'WTAP_LZ4_COMPRESSED',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum wtap_compression_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '108' => {
                                     'BaseType' => '101',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '10802' => {
                                       'BaseType' => '10814',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '28',
                                       'Name' => 'subtype_read_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10814' => {
                                       'Name' => 'gboolean(*)(struct wtap*, wtap_rec*, Buffer*, int*, char**, gint64*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7097'
                                                           },
                                                    '1' => {
                                                             'type' => '10860'
                                                           },
                                                    '2' => {
                                                             'type' => '10866'
                                                           },
                                                    '3' => {
                                                             'type' => '9953'
                                                           },
                                                    '4' => {
                                                             'type' => '9959'
                                                           },
                                                    '5' => {
                                                             'type' => '10872'
                                                           }
                                                  },
                                       'Return' => '446',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1084239' => {
                                         'BaseType' => '312945',
                                         'Name' => 'packet_verdict_opt_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10860' => {
                                       'BaseType' => '9390',
                                       'Name' => 'wtap_rec*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10866' => {
                                       'BaseType' => '3778',
                                       'Name' => 'Buffer*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10872' => {
                                       'BaseType' => '269',
                                       'Name' => 'gint64*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10878' => {
                                       'BaseType' => '10890',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '30',
                                       'Name' => 'subtype_seek_read_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1088534' => {
                                         'BaseType' => '1066707',
                                         'Name' => 'section_info_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10890' => {
                                       'Name' => 'gboolean(*)(struct wtap*, gint64, wtap_rec*, Buffer*, int*, char**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7097'
                                                           },
                                                    '1' => {
                                                             'type' => '269'
                                                           },
                                                    '2' => {
                                                             'type' => '10860'
                                                           },
                                                    '3' => {
                                                             'type' => '10866'
                                                           },
                                                    '4' => {
                                                             'type' => '9953'
                                                           },
                                                    '5' => {
                                                             'type' => '9959'
                                                           }
                                                  },
                                       'Return' => '446',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10947' => {
                                       'Name' => 'void(*)(struct wtap*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7097'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10953' => {
                                       'BaseType' => '177',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '84',
                                       'Name' => 'WFILE_T',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1095670' => {
                                         'BaseType' => '1066719',
                                         'Name' => 'section_info_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10965' => {
                                       'BaseType' => '10977',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '86',
                                       'Name' => 'subtype_add_idb_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10977' => {
                                       'Name' => 'gboolean(*)(struct wtap_dumper*, wtap_block_t, int*, gchar**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11013'
                                                           },
                                                    '1' => {
                                                             'type' => '3838'
                                                           },
                                                    '2' => {
                                                             'type' => '9953'
                                                           },
                                                    '3' => {
                                                             'type' => '2199'
                                                           }
                                                  },
                                       'Return' => '446',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11013' => {
                                       'BaseType' => '9496',
                                       'Name' => 'struct wtap_dumper*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11019' => {
                                       'BaseType' => '11031',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '89',
                                       'Name' => 'subtype_write_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11031' => {
                                       'Name' => 'gboolean(*)(struct wtap_dumper*, wtap_rec const*, guint8 const*, int*, gchar**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11013'
                                                           },
                                                    '1' => {
                                                             'type' => '11072'
                                                           },
                                                    '2' => {
                                                             'type' => '11078'
                                                           },
                                                    '3' => {
                                                             'type' => '9953'
                                                           },
                                                    '4' => {
                                                             'type' => '2199'
                                                           }
                                                  },
                                       'Return' => '446',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11072' => {
                                       'BaseType' => '9403',
                                       'Name' => 'wtap_rec const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11078' => {
                                       'BaseType' => '223',
                                       'Name' => 'guint8 const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11084' => {
                                       'BaseType' => '11096',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '92',
                                       'Name' => 'subtype_finish_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11096' => {
                                       'Name' => 'gboolean(*)(struct wtap_dumper*, int*, gchar**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '11013'
                                                           },
                                                    '1' => {
                                                             'type' => '9953'
                                                           },
                                                    '2' => {
                                                             'type' => '2199'
                                                           }
                                                  },
                                       'Return' => '446',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11127' => {
                                       'BaseType' => '9451',
                                       'Name' => 'addrinfo_lists_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1113006' => {
                                         'Name' => 'gboolean(*)(wtapng_block_t*, section_info_t const*, guint16, guint16, guint8 const*, int*, gchar**)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1066782'
                                                             },
                                                      '1' => {
                                                               'type' => '1095670'
                                                             },
                                                      '2' => {
                                                               'type' => '228'
                                                             },
                                                      '3' => {
                                                               'type' => '228'
                                                             },
                                                      '4' => {
                                                               'type' => '11078'
                                                             },
                                                      '5' => {
                                                               'type' => '9953'
                                                             },
                                                      '6' => {
                                                               'type' => '2199'
                                                             }
                                                    },
                                         'Return' => '446',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '113' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1138890' => {
                                         'BaseType' => '446',
                                         'Name' => 'gboolean const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '1142710' => {
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '211',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'interface_data',
                                                              'offset' => '0',
                                                              'type' => '3130'
                                                            }
                                                   },
                                         'Name' => 'struct wtapng_iface_descriptions_s',
                                         'Size' => '8',
                                         'Type' => 'Struct'
                                       },
                          '1142737' => {
                                         'BaseType' => '1142710',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '213',
                                         'Name' => 'wtapng_iface_descriptions_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1148357' => {
                                         'Header' => 'wtap.h',
                                         'Line' => '1432',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'encap',
                                                              'offset' => '0',
                                                              'type' => '78'
                                                            },
                                                     '1' => {
                                                              'name' => 'snaplen',
                                                              'offset' => '4',
                                                              'type' => '78'
                                                            },
                                                     '2' => {
                                                              'name' => 'tsprec',
                                                              'offset' => '8',
                                                              'type' => '78'
                                                            },
                                                     '3' => {
                                                              'name' => 'shb_hdrs',
                                                              'offset' => '16',
                                                              'type' => '3130'
                                                            },
                                                     '4' => {
                                                              'name' => 'idb_inf',
                                                              'offset' => '24',
                                                              'type' => '1148498'
                                                            },
                                                     '5' => {
                                                              'name' => 'nrb_hdrs',
                                                              'offset' => '32',
                                                              'type' => '3130'
                                                            },
                                                     '6' => {
                                                              'name' => 'dsbs_initial',
                                                              'offset' => '40',
                                                              'type' => '3130'
                                                            },
                                                     '7' => {
                                                              'name' => 'dsbs_growing',
                                                              'offset' => '48',
                                                              'type' => '9464'
                                                            },
                                                     '8' => {
                                                              'name' => 'dont_copy_idbs',
                                                              'offset' => '56',
                                                              'type' => '446'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_dump_params',
                                         'Size' => '64',
                                         'Type' => 'Struct'
                                       },
                          '1148498' => {
                                         'BaseType' => '1142737',
                                         'Name' => 'wtapng_iface_descriptions_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1148510' => {
                                         'BaseType' => '1148357',
                                         'Header' => 'wtap.h',
                                         'Line' => '1444',
                                         'Name' => 'wtap_dump_params',
                                         'Size' => '64',
                                         'Type' => 'Typedef'
                                       },
                          '1148523' => {
                                         'BaseType' => '1148510',
                                         'Name' => 'wtap_dump_params const',
                                         'Size' => '64',
                                         'Type' => 'Const'
                                       },
                          '1148541' => {
                                         'BaseType' => '9470',
                                         'Name' => 'wtap const',
                                         'Size' => '168',
                                         'Type' => 'Const'
                                       },
                          '1148925' => {
                                         'Header' => 'wtap.h',
                                         'Line' => '1489',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'name',
                                                              'offset' => '0',
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'name' => 'is_capture_file',
                                                              'offset' => '8',
                                                              'type' => '446'
                                                            },
                                                     '2' => {
                                                              'name' => 'extensions',
                                                              'offset' => '16',
                                                              'type' => '90'
                                                            }
                                                   },
                                         'Name' => 'struct file_extension_info',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1148982' => {
                                         'BaseType' => '1148925',
                                         'Name' => 'struct file_extension_info const',
                                         'Size' => '24',
                                         'Type' => 'Const'
                                       },
                          '1149893' => {
                                         'Header' => 'wtap.h',
                                         'Line' => '2165',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'FT_SORT_BY_NAME',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'FT_SORT_BY_DESCRIPTION',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum ft_sort_order',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1150502' => {
                                         'BaseType' => '1148982',
                                         'Name' => 'struct file_extension_info const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1150685' => {
                                         'BaseType' => '10503',
                                         'Name' => 'struct file_type_subtype_info const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1153907' => {
                                         'BaseType' => '1148523',
                                         'Name' => 'wtap_dump_params const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1164615' => {
                                         'BaseType' => '1148541',
                                         'Name' => 'wtap const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1167267' => {
                                         'BaseType' => '39416',
                                         'Name' => 'struct stat*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1179432' => {
                                         'BaseType' => '1179444',
                                         'Header' => 'zstd.h',
                                         'Line' => '218',
                                         'Name' => 'ZSTD_DCtx',
                                         'Type' => 'Typedef'
                                       },
                          '1179444' => {
                                         'Name' => 'struct ZSTD_DCtx_s',
                                         'Type' => 'Struct'
                                       },
                          '1179589' => {
                                         'BaseType' => '1179602',
                                         'Header' => 'lz4frame.h',
                                         'Line' => '340',
                                         'Name' => 'LZ4F_dctx',
                                         'Type' => 'Typedef'
                                       },
                          '1179602' => {
                                         'Name' => 'struct LZ4F_dctx_s',
                                         'Type' => 'Struct'
                                       },
                          '1179607' => {
                                         'BaseType' => '1179589',
                                         'Name' => 'LZ4F_dctx*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1179755' => {
                                         'Line' => '136',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'UNKNOWN',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'UNCOMPRESSED',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'ZLIB',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GZIP_AFTER_HEADER',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'ZSTD',
                                                              'value' => '4'
                                                            },
                                                     '5' => {
                                                              'name' => 'LZ4',
                                                              'value' => '5'
                                                            }
                                                   },
                                         'Name' => 'enum compression_t',
                                         'Size' => '4',
                                         'Source' => 'file_wrappers.c',
                                         'Type' => 'Enum'
                                       },
                          '1179767' => {
                                         'Line' => '162',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'buf',
                                                              'offset' => '0',
                                                              'type' => '731'
                                                            },
                                                     '1' => {
                                                              'name' => 'next',
                                                              'offset' => '8',
                                                              'type' => '731'
                                                            },
                                                     '2' => {
                                                              'name' => 'avail',
                                                              'offset' => '16',
                                                              'type' => '470'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_reader_buf',
                                         'Size' => '24',
                                         'Source' => 'file_wrappers.c',
                                         'Type' => 'Struct'
                                       },
                          '1179820' => {
                                         'BaseType' => '1179432',
                                         'Name' => 'ZSTD_DCtx*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1196513' => {
                                         'BaseType' => '3838',
                                         'Name' => 'wtap_block_t const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '120' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1203339' => {
                                         'Header' => 'merge.h',
                                         'Line' => '25',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'RECORD_PRESENT',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'RECORD_NOT_PRESENT',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'AT_EOF',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GOT_ERROR',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum in_file_state_e',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1203351' => {
                                         'Header' => 'merge.h',
                                         'Line' => '30',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'filename',
                                                              'offset' => '0',
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'name' => 'wth',
                                                              'offset' => '8',
                                                              'type' => '13177'
                                                            },
                                                     '2' => {
                                                              'name' => 'rec',
                                                              'offset' => '16',
                                                              'type' => '9390'
                                                            },
                                                     '3' => {
                                                              'name' => 'frame_buffer',
                                                              'offset' => '272',
                                                              'type' => '3778'
                                                            },
                                                     '4' => {
                                                              'name' => 'state',
                                                              'offset' => '304',
                                                              'type' => '1203339'
                                                            },
                                                     '5' => {
                                                              'name' => 'packet_num',
                                                              'offset' => '308',
                                                              'type' => '257'
                                                            },
                                                     '6' => {
                                                              'name' => 'size',
                                                              'offset' => '312',
                                                              'type' => '269'
                                                            },
                                                     '7' => {
                                                              'name' => 'idb_index_map',
                                                              'offset' => '320',
                                                              'type' => '3130'
                                                            },
                                                     '8' => {
                                                              'name' => 'dsbs_seen',
                                                              'offset' => '328',
                                                              'type' => '470'
                                                            }
                                                   },
                                         'Name' => 'struct merge_in_file_s',
                                         'Size' => '336',
                                         'Type' => 'Struct'
                                       },
                          '1203495' => {
                                         'BaseType' => '1203351',
                                         'Header' => 'merge.h',
                                         'Line' => '40',
                                         'Name' => 'merge_in_file_t',
                                         'Size' => '336',
                                         'Type' => 'Typedef'
                                       },
                          '1203507' => {
                                         'BaseType' => '1203495',
                                         'Name' => 'merge_in_file_t const',
                                         'Size' => '336',
                                         'Type' => 'Const'
                                       },
                          '1203581' => {
                                         'Header' => 'merge.h',
                                         'Line' => '54',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MERGE_OK',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MERGE_USER_ABORTED',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MERGE_ERR_CANT_OPEN_INFILE',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MERGE_ERR_CANT_OPEN_OUTFILE',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'MERGE_ERR_CANT_READ_INFILE',
                                                              'value' => '4'
                                                            },
                                                     '5' => {
                                                              'name' => 'MERGE_ERR_BAD_PHDR_INTERFACE_ID',
                                                              'value' => '5'
                                                            },
                                                     '6' => {
                                                              'name' => 'MERGE_ERR_CANT_WRITE_OUTFILE',
                                                              'value' => '6'
                                                            },
                                                     '7' => {
                                                              'name' => 'MERGE_ERR_CANT_CLOSE_OUTFILE',
                                                              'value' => '7'
                                                            },
                                                     '8' => {
                                                              'name' => 'MERGE_ERR_INVALID_OPTION',
                                                              'value' => '8'
                                                            }
                                                   },
                                         'Name' => 'enum merge_result',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1203638' => {
                                         'Header' => 'merge.h',
                                         'Line' => '64',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MERGE_EVENT_INPUT_FILES_OPENED',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MERGE_EVENT_FRAME_TYPE_SELECTED',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MERGE_EVENT_READY_TO_MERGE',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MERGE_EVENT_RECORD_WAS_READ',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'MERGE_EVENT_DONE',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum merge_event',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1203689' => {
                                         'Header' => 'merge.h',
                                         'Line' => '73',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'IDB_MERGE_MODE_NONE',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'IDB_MERGE_MODE_ALL_SAME',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'IDB_MERGE_MODE_ANY_SAME',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'IDB_MERGE_MODE_MAX',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum idb_merge_mode',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1203701' => {
                                         'BaseType' => '1203689',
                                         'Name' => 'idb_merge_mode const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '1203777' => {
                                         'BaseType' => '1203507',
                                         'Name' => 'merge_in_file_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1203783' => {
                                         'Name' => 'gboolean(*)(merge_event, int, merge_in_file_t const*, guint const, void*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1203638'
                                                             },
                                                      '1' => {
                                                               'type' => '78'
                                                             },
                                                      '2' => {
                                                               'type' => '1203777'
                                                             },
                                                      '3' => {
                                                               'type' => '482'
                                                             },
                                                      '4' => {
                                                               'type' => '177'
                                                             }
                                                    },
                                         'Return' => '446',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1203789' => {
                                         'Header' => 'merge.h',
                                         'Line' => '113',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'callback_func',
                                                              'offset' => '0',
                                                              'type' => '1203783'
                                                            },
                                                     '1' => {
                                                              'name' => 'data',
                                                              'offset' => '8',
                                                              'type' => '177'
                                                            }
                                                   },
                                         'Name' => 'struct merge_progress_callback_t',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1204489' => {
                                         'BaseType' => '96',
                                         'Name' => 'char const*const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1204495' => {
                                         'BaseType' => '1203789',
                                         'Name' => 'merge_progress_callback_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1231057' => {
                                         'Header' => 'wtap.h',
                                         'Line' => '2256',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'register_wtap_module',
                                                              'offset' => '0',
                                                              'type' => '820'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_plugin',
                                         'Size' => '8',
                                         'Type' => 'Struct'
                                       },
                          '1231070' => {
                                         'BaseType' => '1231057',
                                         'Name' => 'wtap_plugin const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '1237045' => {
                                         'BaseType' => '1148510',
                                         'Name' => 'wtap_dump_params*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1241842' => {
                                         'BaseType' => '1231070',
                                         'Name' => 'wtap_plugin const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1249542' => {
                                         'BaseType' => '1249555',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '523',
                                         'Name' => 'wtap_block_create_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1249555' => {
                                         'Name' => 'void(*)(wtap_block_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3838'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1249572' => {
                                         'BaseType' => '1249555',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '524',
                                         'Name' => 'wtap_mand_free_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1249585' => {
                                         'BaseType' => '1249598',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '525',
                                         'Name' => 'wtap_mand_copy_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1249598' => {
                                         'Name' => 'void(*)(wtap_block_t, wtap_block_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3838'
                                                             },
                                                      '1' => {
                                                               'type' => '3838'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1255834' => {
                                         'Line' => '43',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'block_type',
                                                              'offset' => '0',
                                                              'type' => '3948'
                                                            },
                                                     '1' => {
                                                              'name' => 'name',
                                                              'offset' => '8',
                                                              'type' => '90'
                                                            },
                                                     '2' => {
                                                              'name' => 'description',
                                                              'offset' => '16',
                                                              'type' => '90'
                                                            },
                                                     '3' => {
                                                              'name' => 'create',
                                                              'offset' => '24',
                                                              'type' => '1249542'
                                                            },
                                                     '4' => {
                                                              'name' => 'free_mand',
                                                              'offset' => '32',
                                                              'type' => '1249572'
                                                            },
                                                     '5' => {
                                                              'name' => 'copy_mand',
                                                              'offset' => '40',
                                                              'type' => '1249585'
                                                            },
                                                     '6' => {
                                                              'name' => 'options',
                                                              'offset' => '48',
                                                              'type' => '67766'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_blocktype_t',
                                         'Size' => '56',
                                         'Source' => 'wtap_opttypes.c',
                                         'Type' => 'Struct'
                                       },
                          '1255925' => {
                                         'BaseType' => '1255834',
                                         'Name' => 'wtap_blocktype_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1264640' => {
                                         'BaseType' => '311150',
                                         'Name' => 'GBytes**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1268332' => {
                                         'BaseType' => '311937',
                                         'Name' => 'ws_in6_addr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '13177' => {
                                       'BaseType' => '9470',
                                       'Name' => 'wtap*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1319' => {
                                      'BaseType' => '1331',
                                      'Header' => 'glist.h',
                                      'Line' => '37',
                                      'Name' => 'GList',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '1331' => {
                                      'Header' => 'glist.h',
                                      'Line' => '39',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '501'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '1384'
                                                         },
                                                  '2' => {
                                                           'name' => 'prev',
                                                           'offset' => '16',
                                                           'type' => '1384'
                                                         }
                                                },
                                      'Name' => 'struct _GList',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '134' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1384' => {
                                      'BaseType' => '1319',
                                      'Name' => 'GList*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '141' => {
                                     'BaseType' => '134',
                                     'Header' => 'types.h',
                                     'Line' => '152',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1411' => {
                                      'BaseType' => '1423',
                                      'Header' => 'gslist.h',
                                      'Line' => '37',
                                      'Name' => 'GSList',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '1423' => {
                                      'Header' => 'gslist.h',
                                      'Line' => '39',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '501'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '1463'
                                                         }
                                                },
                                      'Name' => 'struct _GSList',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1463' => {
                                      'BaseType' => '1411',
                                      'Name' => 'GSList*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '149553' => {
                                        'BaseType' => '281',
                                        'Name' => 'guint64*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '165' => {
                                     'BaseType' => '134',
                                     'Header' => 'types.h',
                                     'Line' => '160',
                                     'Name' => '__time_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '177' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '179' => {
                                     'BaseType' => '101',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '185128' => {
                                        'BaseType' => '257',
                                        'Name' => 'guint32*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '199' => {
                                     'BaseType' => '120',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '40',
                                     'Name' => 'gint8',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '211' => {
                                     'BaseType' => '113',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '41',
                                     'Name' => 'guint8',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '2199' => {
                                      'BaseType' => '725',
                                      'Name' => 'gchar**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '223' => {
                                     'BaseType' => '211',
                                     'Name' => 'guint8 const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '228' => {
                                     'BaseType' => '71',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '44',
                                     'Name' => 'guint16',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '245' => {
                                     'BaseType' => '78',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '51',
                                     'Name' => 'gint32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '257' => {
                                     'BaseType' => '45',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '52',
                                     'Name' => 'guint32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '269' => {
                                     'BaseType' => '134',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '61',
                                     'Name' => 'gint64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '281' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '62',
                                     'Name' => 'guint64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '28633' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '145',
                                       'Name' => '__dev_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28645' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '146',
                                       'Name' => '__uid_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '28657' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '147',
                                       'Name' => '__gid_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '28669' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '148',
                                       'Name' => '__ino_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28681' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '150',
                                       'Name' => '__mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '28693' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '151',
                                       'Name' => '__nlink_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28743' => {
                                       'BaseType' => '134',
                                       'Header' => 'types.h',
                                       'Line' => '174',
                                       'Name' => '__blksize_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28755' => {
                                       'BaseType' => '134',
                                       'Header' => 'types.h',
                                       'Line' => '179',
                                       'Name' => '__blkcnt_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28767' => {
                                       'BaseType' => '134',
                                       'Header' => 'types.h',
                                       'Line' => '196',
                                       'Name' => '__syscall_slong_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28952' => {
                                       'Header' => 'struct_timespec.h',
                                       'Line' => '10',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tv_sec',
                                                            'offset' => '0',
                                                            'type' => '165'
                                                          },
                                                   '1' => {
                                                            'name' => 'tv_nsec',
                                                            'offset' => '8',
                                                            'type' => '28767'
                                                          }
                                                 },
                                       'Name' => 'struct timespec',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '293' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '78',
                                     'Name' => 'gsize',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '305' => {
                                     'BaseType' => '165',
                                     'Header' => 'time_t.h',
                                     'Line' => '7',
                                     'Name' => 'time_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '308430' => {
                                        'BaseType' => '308442',
                                        'Header' => 'garray.h',
                                        'Line' => '36',
                                        'Name' => 'GBytes',
                                        'Type' => 'Typedef'
                                      },
                          '308442' => {
                                        'Name' => 'struct _GBytes',
                                        'Type' => 'Struct'
                                      },
                          '308504' => {
                                        'BaseType' => '308516',
                                        'Header' => 'garray.h',
                                        'Line' => '38',
                                        'Name' => 'GByteArray',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '308516' => {
                                        'Header' => 'garray.h',
                                        'Line' => '47',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'data',
                                                             'offset' => '0',
                                                             'type' => '731'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '470'
                                                           }
                                                  },
                                        'Name' => 'struct _GByteArray',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '311150' => {
                                        'BaseType' => '308430',
                                        'Name' => 'GBytes*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '311168' => {
                                        'BaseType' => '308504',
                                        'Name' => 'GByteArray*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '311882' => {
                                        'BaseType' => '257',
                                        'Header' => 'inet_ipv4.h',
                                        'Line' => '15',
                                        'Name' => 'ws_in4_addr',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '311894' => {
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '20',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bytes',
                                                             'offset' => '0',
                                                             'type' => '69434'
                                                           }
                                                  },
                                        'Name' => 'struct e_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '311937' => {
                                        'BaseType' => '311894',
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '22',
                                        'Name' => 'ws_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '312251' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '286',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT8',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT32',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT64',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'WTAP_OPTTYPE_STRING',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'WTAP_OPTTYPE_BYTES',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'WTAP_OPTTYPE_IPv4',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'WTAP_OPTTYPE_IPv6',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'WTAP_OPTTYPE_CUSTOM',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => 'WTAP_OPTTYPE_IF_FILTER',
                                                             'value' => '8'
                                                           },
                                                    '9' => {
                                                             'name' => 'WTAP_OPTTYPE_PACKET_VERDICT',
                                                             'value' => '9'
                                                           }
                                                  },
                                        'Name' => 'enum wtap_opttype_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '312322' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '296',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'WTAP_OPTTYPE_SUCCESS',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'WTAP_OPTTYPE_NO_SUCH_OPTION',
                                                             'value' => '18446744073709551615 (-1)'
                                                           },
                                                    '2' => {
                                                             'name' => 'WTAP_OPTTYPE_NOT_FOUND',
                                                             'value' => '18446744073709551614 (-2)'
                                                           },
                                                    '3' => {
                                                             'name' => 'WTAP_OPTTYPE_TYPE_MISMATCH',
                                                             'value' => '18446744073709551613 (-3)'
                                                           },
                                                    '4' => {
                                                             'name' => 'WTAP_OPTTYPE_NUMBER_MISMATCH',
                                                             'value' => '18446744073709551612 (-4)'
                                                           },
                                                    '5' => {
                                                             'name' => 'WTAP_OPTTYPE_ALREADY_EXISTS',
                                                             'value' => '18446744073709551611 (-5)'
                                                           },
                                                    '6' => {
                                                             'name' => 'WTAP_OPTTYPE_BAD_BLOCK',
                                                             'value' => '18446744073709551610 (-6)'
                                                           }
                                                  },
                                        'Name' => 'enum wtap_opttype_return_val',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '312335' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '309',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'custom_data_len',
                                                             'offset' => '0',
                                                             'type' => '293'
                                                           },
                                                    '1' => {
                                                             'name' => 'custom_data',
                                                             'offset' => '8',
                                                             'type' => '725'
                                                           }
                                                  },
                                        'Name' => 'struct generic_custom_opt_data',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '312378' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '313',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '257'
                                                           },
                                                    '1' => {
                                                             'name' => 'custom_data_len',
                                                             'offset' => '8',
                                                             'type' => '293'
                                                           },
                                                    '2' => {
                                                             'name' => 'custom_data',
                                                             'offset' => '16',
                                                             'type' => '725'
                                                           },
                                                    '3' => {
                                                             'name' => 'use_little_endian',
                                                             'offset' => '24',
                                                             'type' => '446'
                                                           }
                                                  },
                                        'Name' => 'struct nflx_custom_opt_data',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '312449' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '308',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'generic_data',
                                                             'offset' => '0',
                                                             'type' => '312335'
                                                           },
                                                    '1' => {
                                                             'name' => 'nflx_data',
                                                             'offset' => '0',
                                                             'type' => '312378'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-308',
                                        'Size' => '32',
                                        'Type' => 'Union'
                                      },
                          '312486' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '306',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pen',
                                                             'offset' => '0',
                                                             'type' => '257'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '312449'
                                                           }
                                                  },
                                        'Name' => 'struct custom_opt_s',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '312529' => {
                                        'BaseType' => '312486',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '320',
                                        'Name' => 'custom_opt_t',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '312542' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '335',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'code',
                                                             'offset' => '0',
                                                             'type' => '228'
                                                           },
                                                    '1' => {
                                                             'name' => 'jt',
                                                             'offset' => '2',
                                                             'type' => '211'
                                                           },
                                                    '2' => {
                                                             'name' => 'jf',
                                                             'offset' => '3',
                                                             'type' => '211'
                                                           },
                                                    '3' => {
                                                             'name' => 'k',
                                                             'offset' => '4',
                                                             'type' => '257'
                                                           }
                                                  },
                                        'Name' => 'struct wtap_bpf_insn_s',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '312609' => {
                                        'BaseType' => '312542',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '340',
                                        'Name' => 'wtap_bpf_insn_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '312650' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '348',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'if_filter_pcap',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'if_filter_bpf',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum if_filter_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '312663' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '354',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bpf_prog_len',
                                                             'offset' => '0',
                                                             'type' => '470'
                                                           },
                                                    '1' => {
                                                             'name' => 'bpf_prog',
                                                             'offset' => '8',
                                                             'type' => '312706'
                                                           }
                                                  },
                                        'Name' => 'struct wtap_bpf_insns',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '312706' => {
                                        'BaseType' => '312609',
                                        'Name' => 'wtap_bpf_insn_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '312712' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '352',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'filter_str',
                                                             'offset' => '0',
                                                             'type' => '725'
                                                           },
                                                    '1' => {
                                                             'name' => 'bpf_prog',
                                                             'offset' => '0',
                                                             'type' => '312663'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-352',
                                        'Size' => '16',
                                        'Type' => 'Union'
                                      },
                          '312749' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '350',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '312650'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '312712'
                                                           }
                                                  },
                                        'Name' => 'struct if_filter_opt_s',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '312792' => {
                                        'BaseType' => '312749',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '359',
                                        'Name' => 'if_filter_opt_t',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '312839' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '370',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'packet_verdict_hardware',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'packet_verdict_linux_ebpf_tc',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'packet_verdict_linux_ebpf_xdp',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum packet_verdict_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '312852' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '374',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'verdict_bytes',
                                                             'offset' => '0',
                                                             'type' => '311168'
                                                           },
                                                    '1' => {
                                                             'name' => 'verdict_linux_ebpf_tc',
                                                             'offset' => '0',
                                                             'type' => '281'
                                                           },
                                                    '2' => {
                                                             'name' => 'verdict_linux_ebpf_xdp',
                                                             'offset' => '0',
                                                             'type' => '281'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-374',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '312902' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '372',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '312839'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '312852'
                                                           }
                                                  },
                                        'Name' => 'struct packet_verdict_opt_s',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '312945' => {
                                        'BaseType' => '312902',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '379',
                                        'Name' => 'packet_verdict_opt_t',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '3130' => {
                                      'BaseType' => '616',
                                      'Name' => 'GArray*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '313099' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '395',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'uint8val',
                                                             'offset' => '0',
                                                             'type' => '211'
                                                           },
                                                    '1' => {
                                                             'name' => 'uint32val',
                                                             'offset' => '0',
                                                             'type' => '257'
                                                           },
                                                    '2' => {
                                                             'name' => 'uint64val',
                                                             'offset' => '0',
                                                             'type' => '281'
                                                           },
                                                    '3' => {
                                                             'name' => 'ipv4val',
                                                             'offset' => '0',
                                                             'type' => '311882'
                                                           },
                                                    '4' => {
                                                             'name' => 'ipv6val',
                                                             'offset' => '0',
                                                             'type' => '311937'
                                                           },
                                                    '5' => {
                                                             'name' => 'stringval',
                                                             'offset' => '0',
                                                             'type' => '179'
                                                           },
                                                    '6' => {
                                                             'name' => 'byteval',
                                                             'offset' => '0',
                                                             'type' => '311150'
                                                           },
                                                    '7' => {
                                                             'name' => 'custom_opt',
                                                             'offset' => '0',
                                                             'type' => '312529'
                                                           },
                                                    '8' => {
                                                             'name' => 'if_filterval',
                                                             'offset' => '0',
                                                             'type' => '312792'
                                                           },
                                                    '9' => {
                                                             'name' => 'packet_verdictval',
                                                             'offset' => '0',
                                                             'type' => '312945'
                                                           }
                                                  },
                                        'Name' => 'union wtap_optval_t',
                                        'Size' => '40',
                                        'Type' => 'Union'
                                      },
                          '313128' => {
                                        'BaseType' => '313141',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '1090',
                                        'Name' => 'wtap_block_foreach_func',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '313141' => {
                                        'Name' => 'gboolean(*)(wtap_block_t, guint, wtap_opttype_e, wtap_optval_t*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '3838'
                                                            },
                                                     '1' => {
                                                              'type' => '470'
                                                            },
                                                     '2' => {
                                                              'type' => '312251'
                                                            },
                                                     '3' => {
                                                              'type' => '313182'
                                                            },
                                                     '4' => {
                                                              'type' => '177'
                                                            }
                                                   },
                                        'Return' => '446',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '313182' => {
                                        'BaseType' => '313099',
                                        'Name' => 'wtap_optval_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '3136' => {
                                      'BaseType' => '673',
                                      'Name' => 'GPtrArray*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '340819' => {
                                        'BaseType' => '312792',
                                        'Name' => 'if_filter_opt_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '3712' => {
                                      'Header' => 'buffer.h',
                                      'Line' => '21',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '731'
                                                         },
                                                  '1' => {
                                                           'name' => 'allocated',
                                                           'offset' => '8',
                                                           'type' => '293'
                                                         },
                                                  '2' => {
                                                           'name' => 'start',
                                                           'offset' => '16',
                                                           'type' => '293'
                                                         },
                                                  '3' => {
                                                           'name' => 'first_free',
                                                           'offset' => '24',
                                                           'type' => '293'
                                                         }
                                                },
                                      'Name' => 'struct Buffer',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '3778' => {
                                      'BaseType' => '3712',
                                      'Header' => 'buffer.h',
                                      'Line' => '26',
                                      'Name' => 'Buffer',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '3826' => {
                                      'Header' => 'nstime.h',
                                      'Line' => '31',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'secs',
                                                           'offset' => '0',
                                                           'type' => '305'
                                                         },
                                                  '1' => {
                                                           'name' => 'nsecs',
                                                           'offset' => '8',
                                                           'type' => '78'
                                                         }
                                                },
                                      'Name' => 'struct nstime_t',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3838' => {
                                      'BaseType' => '3850',
                                      'Header' => 'wtap_opttypes.h',
                                      'Line' => '142',
                                      'Name' => 'wtap_block_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3850' => {
                                      'BaseType' => '3856',
                                      'Name' => 'struct wtap_block*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3856' => {
                                      'Line' => '82',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'info',
                                                           'offset' => '0',
                                                           'type' => '1255925'
                                                         },
                                                  '1' => {
                                                           'name' => 'mandatory_data',
                                                           'offset' => '8',
                                                           'type' => '177'
                                                         },
                                                  '2' => {
                                                           'name' => 'options',
                                                           'offset' => '16',
                                                           'type' => '3130'
                                                         },
                                                  '3' => {
                                                           'name' => 'ref_count',
                                                           'offset' => '24',
                                                           'type' => '434'
                                                         }
                                                },
                                      'Name' => 'struct wtap_block',
                                      'Size' => '32',
                                      'Source' => 'wtap_opttypes.c',
                                      'Type' => 'Struct'
                                    },
                          '39416' => {
                                       'Header' => 'stat.h',
                                       'Line' => '46',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'st_dev',
                                                            'offset' => '0',
                                                            'type' => '28633'
                                                          },
                                                   '1' => {
                                                            'name' => 'st_ino',
                                                            'offset' => '8',
                                                            'type' => '28669'
                                                          },
                                                   '10' => {
                                                             'name' => 'st_blocks',
                                                             'offset' => '64',
                                                             'type' => '28755'
                                                           },
                                                   '11' => {
                                                             'name' => 'st_atim',
                                                             'offset' => '72',
                                                             'type' => '28952'
                                                           },
                                                   '12' => {
                                                             'name' => 'st_mtim',
                                                             'offset' => '88',
                                                             'type' => '28952'
                                                           },
                                                   '13' => {
                                                             'name' => 'st_ctim',
                                                             'offset' => '104',
                                                             'type' => '28952'
                                                           },
                                                   '14' => {
                                                             'name' => '__glibc_reserved',
                                                             'offset' => '120',
                                                             'type' => '39625'
                                                           },
                                                   '2' => {
                                                            'name' => 'st_nlink',
                                                            'offset' => '16',
                                                            'type' => '28693'
                                                          },
                                                   '3' => {
                                                            'name' => 'st_mode',
                                                            'offset' => '24',
                                                            'type' => '28681'
                                                          },
                                                   '4' => {
                                                            'name' => 'st_uid',
                                                            'offset' => '28',
                                                            'type' => '28645'
                                                          },
                                                   '5' => {
                                                            'name' => 'st_gid',
                                                            'offset' => '32',
                                                            'type' => '28657'
                                                          },
                                                   '6' => {
                                                            'name' => '__pad0',
                                                            'offset' => '36',
                                                            'type' => '78'
                                                          },
                                                   '7' => {
                                                            'name' => 'st_rdev',
                                                            'offset' => '40',
                                                            'type' => '28633'
                                                          },
                                                   '8' => {
                                                            'name' => 'st_size',
                                                            'offset' => '48',
                                                            'type' => '141'
                                                          },
                                                   '9' => {
                                                            'name' => 'st_blksize',
                                                            'offset' => '56',
                                                            'type' => '28743'
                                                          }
                                                 },
                                       'Name' => 'struct stat',
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '3948' => {
                                      'Header' => 'wtap_opttypes.h',
                                      'Line' => '191',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WTAP_BLOCK_SECTION',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WTAP_BLOCK_IF_ID_AND_INFO',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'WTAP_BLOCK_CUSTOM',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'MAX_WTAP_BLOCK_TYPE_VALUE',
                                                            'value' => '11'
                                                          },
                                                  '2' => {
                                                           'name' => 'WTAP_BLOCK_NAME_RESOLUTION',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'WTAP_BLOCK_IF_STATISTICS',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'WTAP_BLOCK_DECRYPTION_SECRETS',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'WTAP_BLOCK_PACKET',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'WTAP_BLOCK_FT_SPECIFIC_REPORT',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'WTAP_BLOCK_FT_SPECIFIC_EVENT',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'WTAP_BLOCK_SYSDIG_EVENT',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'WTAP_BLOCK_SYSTEMD_JOURNAL_EXPORT',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum wtap_block_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '3960' => {
                                      'BaseType' => '101',
                                      'Name' => 'char[64]',
                                      'Size' => '64',
                                      'Type' => 'Array'
                                    },
                          '39625' => {
                                       'BaseType' => '28767',
                                       'Name' => '__syscall_slong_t[3]',
                                       'Size' => '24',
                                       'Type' => 'Array'
                                     },
                          '3976' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '360',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fcs_len',
                                                           'offset' => '0',
                                                           'type' => '434'
                                                         }
                                                },
                                      'Name' => 'struct eth_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '4005' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '367',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'flags',
                                                           'offset' => '0',
                                                           'type' => '211'
                                                         }
                                                },
                                      'Name' => 'struct dte_dce_phdr',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '4034' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '374',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'uton',
                                                           'offset' => '0',
                                                           'type' => '446'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '4',
                                                           'type' => '211'
                                                         }
                                                },
                                      'Name' => 'struct isdn_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '405' => {
                                     'BaseType' => '101',
                                     'Header' => 'gtypes.h',
                                     'Line' => '46',
                                     'Name' => 'gchar',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '4077' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '457',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'flags',
                                                           'offset' => '0',
                                                           'type' => '257'
                                                         },
                                                  '1' => {
                                                           'name' => 'aal',
                                                           'offset' => '4',
                                                           'type' => '211'
                                                         },
                                                  '10' => {
                                                            'name' => 'aal5t_len',
                                                            'offset' => '20',
                                                            'type' => '228'
                                                          },
                                                  '11' => {
                                                            'name' => 'aal5t_chksum',
                                                            'offset' => '24',
                                                            'type' => '257'
                                                          },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '5',
                                                           'type' => '211'
                                                         },
                                                  '3' => {
                                                           'name' => 'subtype',
                                                           'offset' => '6',
                                                           'type' => '211'
                                                         },
                                                  '4' => {
                                                           'name' => 'vpi',
                                                           'offset' => '8',
                                                           'type' => '228'
                                                         },
                                                  '5' => {
                                                           'name' => 'vci',
                                                           'offset' => '10',
                                                           'type' => '228'
                                                         },
                                                  '6' => {
                                                           'name' => 'aal2_cid',
                                                           'offset' => '12',
                                                           'type' => '211'
                                                         },
                                                  '7' => {
                                                           'name' => 'channel',
                                                           'offset' => '14',
                                                           'type' => '228'
                                                         },
                                                  '8' => {
                                                           'name' => 'cells',
                                                           'offset' => '16',
                                                           'type' => '228'
                                                         },
                                                  '9' => {
                                                           'name' => 'aal5t_u2u',
                                                           'offset' => '18',
                                                           'type' => '228'
                                                         }
                                                },
                                      'Name' => 'struct atm_phdr',
                                      'Size' => '28',
                                      'Type' => 'Struct'
                                    },
                          '417' => {
                                     'BaseType' => '405',
                                     'Name' => 'gchar const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '4260' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '484',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '228'
                                                         },
                                                  '1' => {
                                                           'name' => 'user',
                                                           'offset' => '2',
                                                           'type' => '3960'
                                                         },
                                                  '2' => {
                                                           'name' => 'sess',
                                                           'offset' => '68',
                                                           'type' => '257'
                                                         },
                                                  '3' => {
                                                           'name' => 'call_num',
                                                           'offset' => '72',
                                                           'type' => '3960'
                                                         },
                                                  '4' => {
                                                           'name' => 'chunk',
                                                           'offset' => '136',
                                                           'type' => '257'
                                                         },
                                                  '5' => {
                                                           'name' => 'task',
                                                           'offset' => '140',
                                                           'type' => '257'
                                                         }
                                                },
                                      'Name' => 'struct ascend_phdr',
                                      'Size' => '144',
                                      'Type' => 'Struct'
                                    },
                          '434' => {
                                     'BaseType' => '78',
                                     'Header' => 'gtypes.h',
                                     'Line' => '49',
                                     'Name' => 'gint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '4359' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '494',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '446'
                                                         }
                                                },
                                      'Name' => 'struct p2p_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '4388' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '547',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_set',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_pattern',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_index',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '3' => {
                                                           'name' => 'hop_set',
                                                           'offset' => '1',
                                                           'type' => '211'
                                                         },
                                                  '4' => {
                                                           'name' => 'hop_pattern',
                                                           'offset' => '2',
                                                           'type' => '211'
                                                         },
                                                  '5' => {
                                                           'name' => 'hop_index',
                                                           'offset' => '3',
                                                           'type' => '211'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11_fhss',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '446' => {
                                     'BaseType' => '434',
                                     'Header' => 'gtypes.h',
                                     'Line' => '50',
                                     'Name' => 'gboolean',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '4496' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '560',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_preamble',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '1' => {
                                                           'name' => 'short_preamble',
                                                           'offset' => '4',
                                                           'type' => '446'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11b',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '45' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '4542' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '570',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_channel_type',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_turbo_type',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '2',
                                                           'name' => 'channel_type',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '2',
                                                           'name' => 'turbo_type',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11a',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '4625' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '606',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mode',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '1' => {
                                                           'name' => 'mode',
                                                           'offset' => '4',
                                                           'type' => '257'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11g',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4671' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '622',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bandwidth',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'greenfield',
                                                            'offset' => '8',
                                                            'type' => '470'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fec',
                                                            'offset' => '8',
                                                            'type' => '470'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '2',
                                                            'name' => 'stbc_streams',
                                                            'offset' => '8',
                                                            'type' => '470'
                                                          },
                                                  '13' => {
                                                            'name' => 'ness',
                                                            'offset' => '12',
                                                            'type' => '470'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_greenfield',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_fec',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_stbc_streams',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_ness',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '7' => {
                                                           'name' => 'mcs_index',
                                                           'offset' => '2',
                                                           'type' => '228'
                                                         },
                                                  '8' => {
                                                           'name' => 'bandwidth',
                                                           'offset' => '4',
                                                           'type' => '470'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'short_gi',
                                                           'offset' => '8',
                                                           'type' => '470'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11n',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '470' => {
                                     'BaseType' => '45',
                                     'Header' => 'gtypes.h',
                                     'Line' => '55',
                                     'Name' => 'guint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '482' => {
                                     'BaseType' => '470',
                                     'Name' => 'guint const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '4915' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '674',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_stbc',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_txop_ps_not_allowed',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'stbc',
                                                            'offset' => '0',
                                                            'type' => '470'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'txop_ps_not_allowed',
                                                            'offset' => '0',
                                                            'type' => '470'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'short_gi',
                                                            'offset' => '0',
                                                            'type' => '470'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'short_gi_nsym_disambig',
                                                            'offset' => '0',
                                                            'type' => '470'
                                                          },
                                                  '14' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ldpc_extra_ofdm_symbol',
                                                            'offset' => '0',
                                                            'type' => '470'
                                                          },
                                                  '15' => {
                                                            'bitfield' => '1',
                                                            'name' => 'beamformed',
                                                            'offset' => '0',
                                                            'type' => '470'
                                                          },
                                                  '16' => {
                                                            'name' => 'bandwidth',
                                                            'offset' => '2',
                                                            'type' => '211'
                                                          },
                                                  '17' => {
                                                            'name' => 'mcs',
                                                            'offset' => '3',
                                                            'type' => '5286'
                                                          },
                                                  '18' => {
                                                            'name' => 'nss',
                                                            'offset' => '7',
                                                            'type' => '5286'
                                                          },
                                                  '19' => {
                                                            'name' => 'fec',
                                                            'offset' => '11',
                                                            'type' => '211'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '20' => {
                                                            'name' => 'group_id',
                                                            'offset' => '12',
                                                            'type' => '211'
                                                          },
                                                  '21' => {
                                                            'name' => 'partial_aid',
                                                            'offset' => '14',
                                                            'type' => '228'
                                                          },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi_nsym_disambig',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_ldpc_extra_ofdm_symbol',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_beamformed',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bandwidth',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '7' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_fec',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_group_id',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_partial_aid',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ac',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '501' => {
                                     'BaseType' => '177',
                                     'Header' => 'gtypes.h',
                                     'Line' => '103',
                                     'Name' => 'gpointer',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '513' => {
                                     'BaseType' => '519',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '517081' => {
                                        'BaseType' => '446',
                                        'Name' => 'gboolean*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '519' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '52' => {
                                    'BaseType' => '64',
                                    'Header' => 'stddef.h',
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '5286' => {
                                      'BaseType' => '211',
                                      'Name' => 'guint8[4]',
                                      'Size' => '4',
                                      'Type' => 'Array'
                                    },
                          '5302' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '715',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '1' => {
                                                           'name' => 'mcs',
                                                           'offset' => '1',
                                                           'type' => '211'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ad',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '5348' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '725',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bwru',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_gi',
                                                           'offset' => '0',
                                                           'type' => '470'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '4',
                                                           'name' => 'nsts',
                                                           'offset' => '0',
                                                           'type' => '211'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '4',
                                                           'name' => 'mcs',
                                                           'offset' => '1',
                                                           'type' => '211'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '4',
                                                           'name' => 'bwru',
                                                           'offset' => '1',
                                                           'type' => '211'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '2',
                                                           'name' => 'gi',
                                                           'offset' => '2',
                                                           'type' => '211'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ax',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '5481' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '737',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'info_11_fhss',
                                                           'offset' => '0',
                                                           'type' => '4388'
                                                         },
                                                  '1' => {
                                                           'name' => 'info_11b',
                                                           'offset' => '0',
                                                           'type' => '4496'
                                                         },
                                                  '2' => {
                                                           'name' => 'info_11a',
                                                           'offset' => '0',
                                                           'type' => '4542'
                                                         },
                                                  '3' => {
                                                           'name' => 'info_11g',
                                                           'offset' => '0',
                                                           'type' => '4625'
                                                         },
                                                  '4' => {
                                                           'name' => 'info_11n',
                                                           'offset' => '0',
                                                           'type' => '4671'
                                                         },
                                                  '5' => {
                                                           'name' => 'info_11ac',
                                                           'offset' => '0',
                                                           'type' => '4915'
                                                         },
                                                  '6' => {
                                                           'name' => 'info_11ad',
                                                           'offset' => '0',
                                                           'type' => '5302'
                                                         },
                                                  '7' => {
                                                           'name' => 'info_11ax',
                                                           'offset' => '0',
                                                           'type' => '5348'
                                                         }
                                                },
                                      'Name' => 'union ieee_802_11_phy_info',
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '549' => {
                                     'BaseType' => '417',
                                     'Name' => 'gchar const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5600' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '748',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fcs_len',
                                                           'offset' => '0',
                                                           'type' => '434'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'decrypted',
                                                           'offset' => '4',
                                                           'type' => '470'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_percent',
                                                            'offset' => '28',
                                                            'type' => '470'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_signal_dbm',
                                                            'offset' => '28',
                                                            'type' => '470'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_dbm',
                                                            'offset' => '28',
                                                            'type' => '470'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_signal_db',
                                                            'offset' => '28',
                                                            'type' => '470'
                                                          },
                                                  '14' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_db',
                                                            'offset' => '28',
                                                            'type' => '470'
                                                          },
                                                  '15' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_tsf_timestamp',
                                                            'offset' => '28',
                                                            'type' => '470'
                                                          },
                                                  '16' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_aggregate_info',
                                                            'offset' => '28',
                                                            'type' => '470'
                                                          },
                                                  '17' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_zero_length_psdu_type',
                                                            'offset' => '28',
                                                            'type' => '470'
                                                          },
                                                  '18' => {
                                                            'name' => 'channel',
                                                            'offset' => '30',
                                                            'type' => '228'
                                                          },
                                                  '19' => {
                                                            'name' => 'frequency',
                                                            'offset' => '32',
                                                            'type' => '257'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'datapad',
                                                           'offset' => '4',
                                                           'type' => '470'
                                                         },
                                                  '20' => {
                                                            'name' => 'data_rate',
                                                            'offset' => '36',
                                                            'type' => '228'
                                                          },
                                                  '21' => {
                                                            'name' => 'signal_percent',
                                                            'offset' => '38',
                                                            'type' => '211'
                                                          },
                                                  '22' => {
                                                            'name' => 'noise_percent',
                                                            'offset' => '39',
                                                            'type' => '211'
                                                          },
                                                  '23' => {
                                                            'name' => 'signal_dbm',
                                                            'offset' => '40',
                                                            'type' => '199'
                                                          },
                                                  '24' => {
                                                            'name' => 'noise_dbm',
                                                            'offset' => '41',
                                                            'type' => '199'
                                                          },
                                                  '25' => {
                                                            'name' => 'signal_db',
                                                            'offset' => '42',
                                                            'type' => '211'
                                                          },
                                                  '26' => {
                                                            'name' => 'noise_db',
                                                            'offset' => '43',
                                                            'type' => '211'
                                                          },
                                                  '27' => {
                                                            'name' => 'tsf_timestamp',
                                                            'offset' => '48',
                                                            'type' => '281'
                                                          },
                                                  '28' => {
                                                            'name' => 'aggregate_flags',
                                                            'offset' => '56',
                                                            'type' => '257'
                                                          },
                                                  '29' => {
                                                            'name' => 'aggregate_id',
                                                            'offset' => '60',
                                                            'type' => '257'
                                                          },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'no_a_msdus',
                                                           'offset' => '4',
                                                           'type' => '470'
                                                         },
                                                  '30' => {
                                                            'name' => 'zero_length_psdu_type',
                                                            'offset' => '64',
                                                            'type' => '211'
                                                          },
                                                  '4' => {
                                                           'name' => 'phy',
                                                           'offset' => '8',
                                                           'type' => '470'
                                                         },
                                                  '5' => {
                                                           'name' => 'phy_info',
                                                           'offset' => '12',
                                                           'type' => '5481'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_channel',
                                                           'offset' => '28',
                                                           'type' => '470'
                                                         },
                                                  '7' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_frequency',
                                                           'offset' => '28',
                                                           'type' => '470'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_data_rate',
                                                           'offset' => '28',
                                                           'type' => '470'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_signal_percent',
                                                           'offset' => '28',
                                                           'type' => '470'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11_phdr',
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '6094' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '816',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'encap',
                                                           'offset' => '0',
                                                           'type' => '211'
                                                         },
                                                  '1' => {
                                                           'name' => 'direction',
                                                           'offset' => '1',
                                                           'type' => '211'
                                                         },
                                                  '2' => {
                                                           'name' => 'if_name',
                                                           'offset' => '2',
                                                           'type' => '6220'
                                                         },
                                                  '3' => {
                                                           'name' => 'pro',
                                                           'offset' => '130',
                                                           'type' => '228'
                                                         },
                                                  '4' => {
                                                           'name' => 'off',
                                                           'offset' => '132',
                                                           'type' => '228'
                                                         },
                                                  '5' => {
                                                           'name' => 'pri',
                                                           'offset' => '134',
                                                           'type' => '228'
                                                         },
                                                  '6' => {
                                                           'name' => 'rm',
                                                           'offset' => '136',
                                                           'type' => '228'
                                                         },
                                                  '7' => {
                                                           'name' => 'err',
                                                           'offset' => '138',
                                                           'type' => '228'
                                                         }
                                                },
                                      'Name' => 'struct cosine_phdr',
                                      'Size' => '140',
                                      'Type' => 'Struct'
                                    },
                          '616' => {
                                     'BaseType' => '633',
                                     'Header' => 'garray.h',
                                     'Line' => '37',
                                     'Name' => 'GArray',
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '6220' => {
                                      'BaseType' => '101',
                                      'Name' => 'char[128]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '6236' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '848',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pkttype',
                                                           'offset' => '0',
                                                           'type' => '228'
                                                         }
                                                },
                                      'Name' => 'struct irda_phdr',
                                      'Size' => '2',
                                      'Type' => 'Struct'
                                    },
                          '6265' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '854',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'subsys',
                                                           'offset' => '0',
                                                           'type' => '228'
                                                         },
                                                  '1' => {
                                                           'name' => 'devid',
                                                           'offset' => '4',
                                                           'type' => '257'
                                                         },
                                                  '2' => {
                                                           'name' => 'kind',
                                                           'offset' => '8',
                                                           'type' => '257'
                                                         },
                                                  '3' => {
                                                           'name' => 'pid',
                                                           'offset' => '12',
                                                           'type' => '245'
                                                         },
                                                  '4' => {
                                                           'name' => 'uid',
                                                           'offset' => '16',
                                                           'type' => '257'
                                                         }
                                                },
                                      'Name' => 'struct nettl_phdr',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '628' => {
                                     'BaseType' => '616',
                                     'Name' => 'GArray const',
                                     'Size' => '16',
                                     'Type' => 'Const'
                                   },
                          '633' => {
                                     'Header' => 'garray.h',
                                     'Line' => '41',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '725'
                                                        },
                                                 '1' => {
                                                          'name' => 'len',
                                                          'offset' => '8',
                                                          'type' => '470'
                                                        }
                                               },
                                     'Name' => 'struct _GArray',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '6350' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '868',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '211'
                                                         },
                                                  '1' => {
                                                           'name' => 'annex_a_used',
                                                           'offset' => '1',
                                                           'type' => '211'
                                                         },
                                                  '2' => {
                                                           'name' => 'link_number',
                                                           'offset' => '2',
                                                           'type' => '228'
                                                         }
                                                },
                                      'Name' => 'struct mtp2_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '64' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '6407' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '877',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'vp',
                                                           'offset' => '0',
                                                           'type' => '228'
                                                         },
                                                  '1' => {
                                                           'name' => 'vc',
                                                           'offset' => '2',
                                                           'type' => '228'
                                                         },
                                                  '2' => {
                                                           'name' => 'cid',
                                                           'offset' => '4',
                                                           'type' => '228'
                                                         }
                                                },
                                      'Name' => 'anon-struct-wtap.h-877',
                                      'Size' => '6',
                                      'Type' => 'Struct'
                                    },
                          '6495' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '884',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '6407'
                                                         },
                                                  '1' => {
                                                           'name' => 'ds0mask',
                                                           'offset' => '0',
                                                           'type' => '257'
                                                         }
                                                },
                                      'Name' => 'union k12_input_info_t',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '6508' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '886',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'input',
                                                           'offset' => '0',
                                                           'type' => '257'
                                                         },
                                                  '1' => {
                                                           'name' => 'input_name',
                                                           'offset' => '8',
                                                           'type' => '549'
                                                         },
                                                  '2' => {
                                                           'name' => 'stack_file',
                                                           'offset' => '16',
                                                           'type' => '549'
                                                         },
                                                  '3' => {
                                                           'name' => 'input_type',
                                                           'offset' => '24',
                                                           'type' => '257'
                                                         },
                                                  '4' => {
                                                           'name' => 'input_info',
                                                           'offset' => '28',
                                                           'type' => '6495'
                                                         },
                                                  '5' => {
                                                           'name' => 'extra_info',
                                                           'offset' => '40',
                                                           'type' => '731'
                                                         },
                                                  '6' => {
                                                           'name' => 'extra_length',
                                                           'offset' => '48',
                                                           'type' => '257'
                                                         },
                                                  '7' => {
                                                           'name' => 'stuff',
                                                           'offset' => '56',
                                                           'type' => '177'
                                                         }
                                                },
                                      'Name' => 'struct k12_phdr',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '6635' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '901',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pkttype',
                                                           'offset' => '0',
                                                           'type' => '228'
                                                         },
                                                  '1' => {
                                                           'name' => 'we_network',
                                                           'offset' => '2',
                                                           'type' => '211'
                                                         }
                                                },
                                      'Name' => 'struct lapd_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '6678' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '909',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'isdn',
                                                           'offset' => '0',
                                                           'type' => '4034'
                                                         },
                                                  '1' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '4077'
                                                         },
                                                  '2' => {
                                                           'name' => 'p2p',
                                                           'offset' => '0',
                                                           'type' => '4359'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-909',
                                      'Size' => '28',
                                      'Type' => 'Union'
                                    },
                          '66963' => {
                                       'BaseType' => '66975',
                                       'Header' => 'ghash.h',
                                       'Line' => '37',
                                       'Name' => 'GHashTable',
                                       'Type' => 'Typedef'
                                     },
                          '66975' => {
                                       'Name' => 'struct _GHashTable',
                                       'Type' => 'Struct'
                                     },
                          '6728' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '907',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'inner_pseudo_header',
                                                           'offset' => '0',
                                                           'type' => '6678'
                                                         },
                                                  '1' => {
                                                           'name' => 'seek_off',
                                                           'offset' => '32',
                                                           'type' => '269'
                                                         },
                                                  '2' => {
                                                           'name' => 'wth',
                                                           'offset' => '40',
                                                           'type' => '7097'
                                                         }
                                                },
                                      'Name' => 'struct catapult_dct2000_phdr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '673' => {
                                     'BaseType' => '685',
                                     'Header' => 'garray.h',
                                     'Line' => '39',
                                     'Name' => 'GPtrArray',
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '67766' => {
                                       'BaseType' => '66963',
                                       'Name' => 'GHashTable*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '6785' => {
                                      'Header' => 'wtap-int.h',
                                      'Line' => '36',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fh',
                                                           'offset' => '0',
                                                           'type' => '9756'
                                                         },
                                                  '1' => {
                                                           'name' => 'random_fh',
                                                           'offset' => '8',
                                                           'type' => '9756'
                                                         },
                                                  '10' => {
                                                            'name' => 'pathname',
                                                            'offset' => '72',
                                                            'type' => '179'
                                                          },
                                                  '11' => {
                                                            'name' => 'priv',
                                                            'offset' => '80',
                                                            'type' => '177'
                                                          },
                                                  '12' => {
                                                            'name' => 'wslua_data',
                                                            'offset' => '88',
                                                            'type' => '177'
                                                          },
                                                  '13' => {
                                                            'name' => 'subtype_read',
                                                            'offset' => '96',
                                                            'type' => '10802'
                                                          },
                                                  '14' => {
                                                            'name' => 'subtype_seek_read',
                                                            'offset' => '104',
                                                            'type' => '10878'
                                                          },
                                                  '15' => {
                                                            'name' => 'subtype_sequential_close',
                                                            'offset' => '112',
                                                            'type' => '10947'
                                                          },
                                                  '16' => {
                                                            'name' => 'subtype_close',
                                                            'offset' => '120',
                                                            'type' => '10947'
                                                          },
                                                  '17' => {
                                                            'name' => 'file_encap',
                                                            'offset' => '128',
                                                            'type' => '78'
                                                          },
                                                  '18' => {
                                                            'name' => 'file_tsprec',
                                                            'offset' => '132',
                                                            'type' => '78'
                                                          },
                                                  '19' => {
                                                            'name' => 'add_new_ipv4',
                                                            'offset' => '136',
                                                            'type' => '10578'
                                                          },
                                                  '2' => {
                                                           'name' => 'ispipe',
                                                           'offset' => '16',
                                                           'type' => '446'
                                                         },
                                                  '20' => {
                                                            'name' => 'add_new_ipv6',
                                                            'offset' => '144',
                                                            'type' => '10613'
                                                          },
                                                  '21' => {
                                                            'name' => 'add_new_secrets',
                                                            'offset' => '152',
                                                            'type' => '10648'
                                                          },
                                                  '22' => {
                                                            'name' => 'fast_seek',
                                                            'offset' => '160',
                                                            'type' => '3136'
                                                          },
                                                  '3' => {
                                                           'name' => 'file_type_subtype',
                                                           'offset' => '20',
                                                           'type' => '78'
                                                         },
                                                  '4' => {
                                                           'name' => 'snapshot_length',
                                                           'offset' => '24',
                                                           'type' => '470'
                                                         },
                                                  '5' => {
                                                           'name' => 'shb_hdrs',
                                                           'offset' => '32',
                                                           'type' => '3130'
                                                         },
                                                  '6' => {
                                                           'name' => 'interface_data',
                                                           'offset' => '40',
                                                           'type' => '3130'
                                                         },
                                                  '7' => {
                                                           'name' => 'next_interface_data',
                                                           'offset' => '48',
                                                           'type' => '470'
                                                         },
                                                  '8' => {
                                                           'name' => 'nrb_hdrs',
                                                           'offset' => '56',
                                                           'type' => '3130'
                                                         },
                                                  '9' => {
                                                           'name' => 'dsbs',
                                                           'offset' => '64',
                                                           'type' => '3130'
                                                         }
                                                },
                                      'Name' => 'struct wtap',
                                      'Size' => '168',
                                      'Type' => 'Struct'
                                    },
                          '685' => {
                                     'Header' => 'garray.h',
                                     'Line' => '53',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'pdata',
                                                          'offset' => '0',
                                                          'type' => '737'
                                                        },
                                                 '1' => {
                                                          'name' => 'len',
                                                          'offset' => '8',
                                                          'type' => '470'
                                                        }
                                               },
                                     'Name' => 'struct _GPtrArray',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '69434' => {
                                       'BaseType' => '211',
                                       'Name' => 'guint8[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '7097' => {
                                      'BaseType' => '6785',
                                      'Name' => 'struct wtap*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '71' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '7103' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '922',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ts',
                                                           'offset' => '0',
                                                           'type' => '281'
                                                         },
                                                  '1' => {
                                                           'name' => 'type',
                                                           'offset' => '8',
                                                           'type' => '211'
                                                         },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '9',
                                                           'type' => '211'
                                                         },
                                                  '3' => {
                                                           'name' => 'rlen',
                                                           'offset' => '10',
                                                           'type' => '228'
                                                         },
                                                  '4' => {
                                                           'name' => 'lctr',
                                                           'offset' => '12',
                                                           'type' => '228'
                                                         },
                                                  '5' => {
                                                           'name' => 'wlen',
                                                           'offset' => '14',
                                                           'type' => '228'
                                                         }
                                                },
                                      'Name' => 'struct erf_phdr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7201' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '931',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ehdr',
                                                           'offset' => '0',
                                                           'type' => '281'
                                                         }
                                                },
                                      'Name' => 'struct erf_ehdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '7230' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '942',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'offset',
                                                           'offset' => '0',
                                                           'type' => '211'
                                                         },
                                                  '1' => {
                                                           'name' => 'pad',
                                                           'offset' => '1',
                                                           'type' => '211'
                                                         }
                                                },
                                      'Name' => 'struct wtap_erf_eth_hdr',
                                      'Size' => '2',
                                      'Type' => 'Struct'
                                    },
                          '725' => {
                                     'BaseType' => '405',
                                     'Name' => 'gchar*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '7273' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '950',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'eth_hdr',
                                                           'offset' => '0',
                                                           'type' => '7230'
                                                         },
                                                  '1' => {
                                                           'name' => 'mc_hdr',
                                                           'offset' => '0',
                                                           'type' => '257'
                                                         },
                                                  '2' => {
                                                           'name' => 'aal2_hdr',
                                                           'offset' => '0',
                                                           'type' => '257'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-950',
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '731' => {
                                     'BaseType' => '211',
                                     'Name' => 'guint8*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '7323' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '947',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'phdr',
                                                           'offset' => '0',
                                                           'type' => '7103'
                                                         },
                                                  '1' => {
                                                           'name' => 'ehdr_list',
                                                           'offset' => '16',
                                                           'type' => '7380'
                                                         },
                                                  '2' => {
                                                           'name' => 'subhdr',
                                                           'offset' => '144',
                                                           'type' => '7273'
                                                         }
                                                },
                                      'Name' => 'struct erf_mc_phdr',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '737' => {
                                     'BaseType' => '501',
                                     'Name' => 'gpointer*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '7380' => {
                                      'BaseType' => '7201',
                                      'Name' => 'struct erf_ehdr[16]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '7396' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1013',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sita_flags',
                                                           'offset' => '0',
                                                           'type' => '211'
                                                         },
                                                  '1' => {
                                                           'name' => 'sita_signals',
                                                           'offset' => '1',
                                                           'type' => '211'
                                                         },
                                                  '2' => {
                                                           'name' => 'sita_errors1',
                                                           'offset' => '2',
                                                           'type' => '211'
                                                         },
                                                  '3' => {
                                                           'name' => 'sita_errors2',
                                                           'offset' => '3',
                                                           'type' => '211'
                                                         },
                                                  '4' => {
                                                           'name' => 'sita_proto',
                                                           'offset' => '4',
                                                           'type' => '211'
                                                         }
                                                },
                                      'Name' => 'struct sita_phdr',
                                      'Size' => '5',
                                      'Type' => 'Struct'
                                    },
                          '7481' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1022',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '446'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '4',
                                                           'type' => '257'
                                                         }
                                                },
                                      'Name' => 'struct bthci_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '7524' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1034',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'adapter_id',
                                                           'offset' => '0',
                                                           'type' => '228'
                                                         },
                                                  '1' => {
                                                           'name' => 'opcode',
                                                           'offset' => '2',
                                                           'type' => '228'
                                                         }
                                                },
                                      'Name' => 'struct btmon_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '7567' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1040',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'uton',
                                                           'offset' => '0',
                                                           'type' => '446'
                                                         }
                                                },
                                      'Name' => 'struct l1event_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '7596' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1045',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'is_event',
                                                           'offset' => '0',
                                                           'type' => '211'
                                                         },
                                                  '1' => {
                                                           'name' => 'bus',
                                                           'offset' => '1',
                                                           'type' => '211'
                                                         },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '4',
                                                           'type' => '257'
                                                         }
                                                },
                                      'Name' => 'struct i2c_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '7653' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1052',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'uplink',
                                                           'offset' => '0',
                                                           'type' => '446'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '4',
                                                           'type' => '211'
                                                         },
                                                  '2' => {
                                                           'name' => 'bsic',
                                                           'offset' => '5',
                                                           'type' => '211'
                                                         },
                                                  '3' => {
                                                           'name' => 'arfcn',
                                                           'offset' => '6',
                                                           'type' => '228'
                                                         },
                                                  '4' => {
                                                           'name' => 'tdma_frame',
                                                           'offset' => '8',
                                                           'type' => '257'
                                                         },
                                                  '5' => {
                                                           'name' => 'error',
                                                           'offset' => '12',
                                                           'type' => '211'
                                                         },
                                                  '6' => {
                                                           'name' => 'timeshift',
                                                           'offset' => '14',
                                                           'type' => '228'
                                                         }
                                                },
                                      'Name' => 'struct gsm_um_phdr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '7766' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1074',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rec_offset',
                                                           'offset' => '0',
                                                           'type' => '269'
                                                         },
                                                  '1' => {
                                                           'name' => 'rec_len',
                                                           'offset' => '8',
                                                           'type' => '245'
                                                         },
                                                  '10' => {
                                                            'name' => 'vlantag_offset',
                                                            'offset' => '21',
                                                            'type' => '211'
                                                          },
                                                  '11' => {
                                                            'name' => 'coreid_offset',
                                                            'offset' => '22',
                                                            'type' => '211'
                                                          },
                                                  '12' => {
                                                            'name' => 'srcnodeid_offset',
                                                            'offset' => '23',
                                                            'type' => '211'
                                                          },
                                                  '13' => {
                                                            'name' => 'destnodeid_offset',
                                                            'offset' => '24',
                                                            'type' => '211'
                                                          },
                                                  '14' => {
                                                            'name' => 'clflags_offset',
                                                            'offset' => '25',
                                                            'type' => '211'
                                                          },
                                                  '15' => {
                                                            'name' => 'src_vmname_len_offset',
                                                            'offset' => '26',
                                                            'type' => '211'
                                                          },
                                                  '16' => {
                                                            'name' => 'dst_vmname_len_offset',
                                                            'offset' => '27',
                                                            'type' => '211'
                                                          },
                                                  '17' => {
                                                            'name' => 'ns_activity_offset',
                                                            'offset' => '28',
                                                            'type' => '211'
                                                          },
                                                  '18' => {
                                                            'name' => 'data_offset',
                                                            'offset' => '29',
                                                            'type' => '211'
                                                          },
                                                  '2' => {
                                                           'name' => 'nicno_offset',
                                                           'offset' => '12',
                                                           'type' => '211'
                                                         },
                                                  '3' => {
                                                           'name' => 'nicno_len',
                                                           'offset' => '13',
                                                           'type' => '211'
                                                         },
                                                  '4' => {
                                                           'name' => 'dir_offset',
                                                           'offset' => '14',
                                                           'type' => '211'
                                                         },
                                                  '5' => {
                                                           'name' => 'dir_len',
                                                           'offset' => '15',
                                                           'type' => '211'
                                                         },
                                                  '6' => {
                                                           'name' => 'eth_offset',
                                                           'offset' => '16',
                                                           'type' => '228'
                                                         },
                                                  '7' => {
                                                           'name' => 'pcb_offset',
                                                           'offset' => '18',
                                                           'type' => '211'
                                                         },
                                                  '8' => {
                                                           'name' => 'l_pcb_offset',
                                                           'offset' => '19',
                                                           'type' => '211'
                                                         },
                                                  '9' => {
                                                           'name' => 'rec_type',
                                                           'offset' => '20',
                                                           'type' => '211'
                                                         }
                                                },
                                      'Name' => 'struct nstr_phdr',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '78' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '780291' => {
                                        'BaseType' => '470',
                                        'Name' => 'guint*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '8047' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1097',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'eth',
                                                           'offset' => '0',
                                                           'type' => '3976'
                                                         },
                                                  '1' => {
                                                           'name' => 'stuff',
                                                           'offset' => '4',
                                                           'type' => '5286'
                                                         }
                                                },
                                      'Name' => 'struct nokia_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '80508' => {
                                       'BaseType' => '113',
                                       'Header' => 'zconf.h',
                                       'Line' => '391',
                                       'Name' => 'Byte',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '80521' => {
                                       'BaseType' => '45',
                                       'Header' => 'zconf.h',
                                       'Line' => '393',
                                       'Name' => 'uInt',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '80534' => {
                                       'BaseType' => '64',
                                       'Header' => 'zconf.h',
                                       'Line' => '394',
                                       'Name' => 'uLong',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '80547' => {
                                       'BaseType' => '80508',
                                       'Header' => 'zconf.h',
                                       'Line' => '400',
                                       'Name' => 'Bytef',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '80560' => {
                                       'BaseType' => '80547',
                                       'Name' => 'Bytef const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '80565' => {
                                       'BaseType' => '177',
                                       'Header' => 'zconf.h',
                                       'Line' => '409',
                                       'Name' => 'voidpf',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '80578' => {
                                       'BaseType' => '80590',
                                       'Header' => 'zlib.h',
                                       'Line' => '81',
                                       'Name' => 'alloc_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '80590' => {
                                       'Name' => 'voidpf(*)(voidpf, uInt, uInt)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '80565'
                                                           },
                                                    '1' => {
                                                             'type' => '80521'
                                                           },
                                                    '2' => {
