$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '9.3.0',
          'Headers' => {
                         'buffer.h' => 1,
                         'file_wrappers.h' => 1,
                         'garray.h' => 1,
                         'ghash.h' => 1,
                         'glibconfig.h' => 1,
                         'glist.h' => 1,
                         'gslist.h' => 1,
                         'gtypes.h' => 1,
                         'inet_ipv4.h' => 1,
                         'inet_ipv6.h' => 1,
                         'lz4frame.h' => 1,
                         'merge.h' => 1,
                         'nstime.h' => 1,
                         'pcap-encap.h' => 1,
                         'pcapng_module.h' => 1,
                         'stat.h' => 1,
                         'stddef.h' => 1,
                         'struct_timespec.h' => 1,
                         'time_t.h' => 1,
                         'types.h' => 1,
                         'wtap-int.h' => 1,
                         'wtap.h' => 1,
                         'wtap_opttypes.h' => 1,
                         'zconf.h' => 1,
                         'zlib.h' => 1,
                         'zstd.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libwiretap.so.12.0.0',
          'LibraryVersion' => '12.0.0',
          'NameSpaces' => {},

                                                     'wtap_name_to_encap' => 1,
                                                     'wtap_name_to_file_type_subtype' => 1,
                                                     'wtap_open_offline' => 1,
                                                     'wtap_opttypes_cleanup' => 1,
                                                     'wtap_opttypes_initialize' => 1,
                                                     'wtap_packet_verdict_free' => 1,
                                                     'wtap_pcap_encap_to_wtap_encap' => 1,
                                                     'wtap_pcap_file_type_subtype' => 1,
                                                     'wtap_pcap_nsec_file_type_subtype' => 1,
                                                     'wtap_pcapng_file_type_subtype' => 1,
                                                     'wtap_plugins_supported' => 1,
                                                     'wtap_read' => 1,
                                                     'wtap_read_bytes' => 1,
                                                     'wtap_read_bytes_or_eof' => 1,
                                                     'wtap_read_packet_bytes' => 1,
                                                     'wtap_read_so_far' => 1,
                                                     'wtap_rec_cleanup' => 1,
                                                     'wtap_rec_init' => 1,
                                                     'wtap_rec_reset' => 1,
                                                     'wtap_register_encap_type' => 1,
                                                     'wtap_register_file_type_extension' => 1,
                                                     'wtap_register_file_type_subtype' => 1,
                                                     'wtap_register_open_info' => 1,
                                                     'wtap_register_plugin' => 1,
                                                     'wtap_seek_read' => 1,
                                                     'wtap_sequential_close' => 1,
                                                     'wtap_set_bytes_dumped' => 1,
                                                     'wtap_set_cb_new_ipv4' => 1,
                                                     'wtap_set_cb_new_ipv6' => 1,
                                                     'wtap_set_cb_new_secrets' => 1,
                                                     'wtap_snapshot_length' => 1,
                                                     'wtap_strerror' => 1,
                                                     'wtap_tsprec_string' => 1,
                                                     'wtap_uses_lua_filehandler' => 1,
                                                     'wtap_write_shb_comment' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '10005' => {
                                       'BaseType' => '78',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10039' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1553',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPEN_INFO_MAGIC',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'OPEN_INFO_HEURISTIC',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum wtap_open_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10052' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1559',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '90'
                                                          },
                                                   '1' => {
                                                            'name' => 'type',
                                                            'offset' => '8',
                                                            'type' => '10039'
                                                          },
                                                   '2' => {
                                                            'name' => 'open_routine',
                                                            'offset' => '16',
                                                            'type' => '9961'
                                                          },
                                                   '3' => {
                                                            'name' => 'extensions',
                                                            'offset' => '24',
                                                            'type' => '90'
                                                          },
                                                   '4' => {
                                                            'name' => 'extensions_set',
                                                            'offset' => '32',
                                                            'type' => '2192'
                                                          },
                                                   '5' => {
                                                            'name' => 'wslua_data',
                                                            'offset' => '40',
                                                            'type' => '283'
                                                          }
                                                 },
                                       'Name' => 'struct open_info',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '101' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '10164' => {
                                       'BaseType' => '10052',
                                       'Name' => 'struct open_info*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10204' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1585',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'OPTION_NOT_SUPPORTED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ONE_OPTION_SUPPORTED',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MULTIPLE_OPTIONS_SUPPORTED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum option_support_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10217' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1590',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'opt',
                                                            'offset' => '0',
                                                            'type' => '456'
                                                          },
                                                   '1' => {
                                                            'name' => 'support',
                                                            'offset' => '4',
                                                            'type' => '10204'
                                                          }
                                                 },
                                       'Name' => 'struct supported_option_type',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '10260' => {
                                       'BaseType' => '10217',
                                       'Name' => 'struct supported_option_type const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '10299' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1609',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'BLOCK_NOT_SUPPORTED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'ONE_BLOCK_SUPPORTED',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'MULTIPLE_BLOCKS_SUPPORTED',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum block_support_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10312' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1614',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '4015'
                                                          },
                                                   '1' => {
                                                            'name' => 'support',
                                                            'offset' => '4',
                                                            'type' => '10299'
                                                          },
                                                   '2' => {
                                                            'name' => 'num_supported_options',
                                                            'offset' => '8',
                                                            'type' => '52'
                                                          },
                                                   '3' => {
                                                            'name' => 'supported_options',
                                                            'offset' => '16',
                                                            'type' => '10388'
                                                          }
                                                 },
                                       'Name' => 'struct supported_block_type',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '10383' => {
                                       'BaseType' => '10312',
                                       'Name' => 'struct supported_block_type const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '10388' => {
                                       'BaseType' => '10260',
                                       'Name' => 'struct supported_option_type const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10394' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1624',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'description',
                                                            'offset' => '0',
                                                            'type' => '90'
                                                          },
                                                   '1' => {
                                                            'name' => 'name',
                                                            'offset' => '8',
                                                            'type' => '90'
                                                          },
                                                   '2' => {
                                                            'name' => 'default_file_extension',
                                                            'offset' => '16',
                                                            'type' => '90'
                                                          },
                                                   '3' => {
                                                            'name' => 'additional_file_extensions',
                                                            'offset' => '24',
                                                            'type' => '90'
                                                          },
                                                   '4' => {
                                                            'name' => 'writing_must_seek',
                                                            'offset' => '32',
                                                            'type' => '432'
                                                          },
                                                   '5' => {
                                                            'name' => 'num_supported_blocks',
                                                            'offset' => '40',
                                                            'type' => '52'
                                                          },
                                                   '6' => {
                                                            'name' => 'supported_blocks',
                                                            'offset' => '48',
                                                            'type' => '10554'
                                                          },
                                                   '7' => {
                                                            'name' => 'can_write_encap',
                                                            'offset' => '56',
                                                            'type' => '10575'
                                                          },
                                                   '8' => {
                                                            'name' => 'dump_open',
                                                            'offset' => '64',
                                                            'type' => '10612'
                                                          },
                                                   '9' => {
                                                            'name' => 'wslua_info',
                                                            'offset' => '72',
                                                            'type' => '10618'
                                                          }
                                                 },
                                       'Name' => 'struct file_type_subtype_info',
                                       'Size' => '80',
                                       'Type' => 'Struct'
                                     },
                          '10549' => {
                                       'BaseType' => '10394',
                                       'Name' => 'struct file_type_subtype_info const',
                                       'Size' => '80',
                                       'Type' => 'Const'
                                     },
                          '10554' => {
                                       'BaseType' => '10383',
                                       'Name' => 'struct supported_block_type const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1057390' => {
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '49',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'type',
                                                              'offset' => '0',
                                                              'type' => '199'
                                                            },
                                                     '1' => {
                                                              'name' => 'internal',
                                                              'offset' => '4',
                                                              'type' => '432'
                                                            },
                                                     '2' => {
                                                              'name' => 'block',
                                                              'offset' => '8',
                                                              'type' => '3905'
                                                            },
                                                     '3' => {
                                                              'name' => 'rec',
                                                              'offset' => '16',
                                                              'type' => '10845'
                                                            },
                                                     '4' => {
                                                              'name' => 'frame_buffer',
                                                              'offset' => '24',
                                                              'type' => '10851'
                                                            }
                                                   },
                                         'Name' => 'struct wtapng_block_s',
                                         'Size' => '32',
                                         'Type' => 'Struct'
                                       },
                          '1057469' => {
                                         'BaseType' => '1057390',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '55',
                                         'Name' => 'wtapng_block_t',
                                         'Size' => '32',
                                         'Type' => 'Typedef'
                                       },
                          '1057481' => {
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '62',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'byte_swapped',
                                                              'offset' => '0',
                                                              'type' => '432'
                                                            },
                                                     '1' => {
                                                              'name' => 'version_major',
                                                              'offset' => '4',
                                                              'type' => '170'
                                                            },
                                                     '2' => {
                                                              'name' => 'version_minor',
                                                              'offset' => '6',
                                                              'type' => '170'
                                                            },
                                                     '3' => {
                                                              'name' => 'interfaces',
                                                              'offset' => '8',
                                                              'type' => '3130'
                                                            },
                                                     '4' => {
                                                              'name' => 'shb_off',
                                                              'offset' => '16',
                                                              'type' => '211'
                                                            },
                                                     '5' => {
                                                              'name' => 'bblog_version',
                                                              'offset' => '24',
                                                              'type' => '199'
                                                            },
                                                     '6' => {
                                                              'name' => 'bblog_offset_tv_sec',
                                                              'offset' => '32',
                                                              'type' => '223'
                                                            },
                                                     '7' => {
                                                              'name' => 'bblog_offset_tv_usec',
                                                              'offset' => '40',
                                                              'type' => '223'
                                                            }
                                                   },
                                         'Name' => 'struct section_info_t',
                                         'Size' => '48',
                                         'Type' => 'Struct'
                                       },
                          '10575' => {
                                       'Name' => 'int(*)(int)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '78'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1057599' => {
                                         'BaseType' => '1057481',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '71',
                                         'Name' => 'section_info_t',
                                         'Size' => '48',
                                         'Type' => 'Typedef'
                                       },
                          '1057611' => {
                                         'BaseType' => '1057599',
                                         'Name' => 'section_info_t const',
                                         'Size' => '48',
                                         'Type' => 'Const'
                                       },
                          '1057616' => {
                                         'BaseType' => '1057628',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '76',
                                         'Name' => 'block_reader',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1057628' => {
                                         'Name' => 'gboolean(*)(FILE_T, guint32, gboolean, wtapng_block_t*, int*, gchar**)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '9808'
                                                             },
                                                      '1' => {
                                                               'type' => '199'
                                                             },
                                                      '2' => {
                                                               'type' => '432'
                                                             },
                                                      '3' => {
                                                               'type' => '1057674'
                                                             },
                                                      '4' => {
                                                               'type' => '10005'
                                                             },
                                                      '5' => {
                                                               'type' => '2192'
                                                             }
                                                    },
                                         'Return' => '432',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1057674' => {
                                         'BaseType' => '1057469',
                                         'Name' => 'wtapng_block_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1057680' => {
                                         'BaseType' => '1057692',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '80',
                                         'Name' => 'block_writer',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1057692' => {
                                         'Name' => 'gboolean(*)(wtap_dumper*, wtap_rec const*, guint8 const*, int*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '10606'
                                                             },
                                                      '1' => {
                                                               'type' => '11057'
                                                             },
                                                      '2' => {
                                                               'type' => '11063'
                                                             },
                                                      '3' => {
                                                               'type' => '10005'
                                                             }
                                                    },
                                         'Return' => '432',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1057728' => {
                                         'BaseType' => '1057740',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '93',
                                         'Name' => 'option_parser',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1057740' => {
                                         'Name' => 'gboolean(*)(wtap_block_t, gboolean, guint, guint8 const*, int*, gchar**)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3905'
                                                             },
                                                      '1' => {
                                                               'type' => '432'
                                                             },
                                                      '2' => {
                                                               'type' => '456'
                                                             },
                                                      '3' => {
                                                               'type' => '11063'
                                                             },
                                                      '4' => {
                                                               'type' => '10005'
                                                             },
                                                      '5' => {
                                                               'type' => '2192'
                                                             }
                                                    },
                                         'Return' => '432',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1057786' => {
                                         'BaseType' => '1057798',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '98',
                                         'Name' => 'option_sizer',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1057798' => {
                                         'Name' => 'guint32(*)(guint, wtap_optval_t*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '456'
                                                             },
                                                      '1' => {
                                                               'type' => '310087'
                                                             }
                                                    },
                                         'Return' => '199',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1057824' => {
                                         'BaseType' => '1057836',
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '99',
                                         'Name' => 'option_writer',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1057836' => {
                                         'Name' => 'gboolean(*)(wtap_dumper*, guint, wtap_optval_t*, int*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '10606'
                                                             },
                                                      '1' => {
                                                               'type' => '456'
                                                             },
                                                      '2' => {
                                                               'type' => '310087'
                                                             },
                                                      '3' => {
                                                               'type' => '10005'
                                                             }
                                                    },
                                         'Return' => '432',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1057905' => {
                                         'Header' => 'pcapng_module.h',
                                         'Line' => '130',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'OPT_SECTION_BYTE_ORDER',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'OPT_BIG_ENDIAN',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'OPT_LITTLE_ENDIAN',
                                                              'value' => '2'
                                                            }
                                                   },
                                         'Name' => 'enum pcapng_opt_byte_order_e',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '10606' => {
                                       'BaseType' => '9535',
                                       'Name' => 'wtap_dumper*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10612' => {
                                       'Name' => 'int(*)(wtap_dumper*, int*, gchar**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10606'
                                                           },
                                                    '1' => {
                                                             'type' => '10005'
                                                           },
                                                    '2' => {
                                                             'type' => '2192'
                                                           }
                                                  },
                                       'Return' => '78',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10618' => {
                                       'BaseType' => '9901',
                                       'Name' => 'wtap_wslua_file_info_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10624' => {
                                       'BaseType' => '10637',
                                       'Header' => 'wtap.h',
                                       'Line' => '1706',
                                       'Name' => 'wtap_new_ipv4_callback_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10637' => {
                                       'Name' => 'void(*)(guint const, gchar const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '468'
                                                           },
                                                    '1' => {
                                                             'type' => '535'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10659' => {
                                       'BaseType' => '10672',
                                       'Header' => 'wtap.h',
                                       'Line' => '1710',
                                       'Name' => 'wtap_new_ipv6_callback_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10672' => {
                                       'Name' => 'void(*)(void const*, gchar const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '499'
                                                           },
                                                    '1' => {
                                                             'type' => '535'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10694' => {
                                       'BaseType' => '10707',
                                       'Header' => 'wtap.h',
                                       'Line' => '1718',
                                       'Name' => 'wtap_new_secrets_callback_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10707' => {
                                       'Name' => 'void(*)(guint32, void const*, guint)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '199'
                                                           },
                                                    '1' => {
                                                             'type' => '499'
                                                           },
                                                    '2' => {
                                                             'type' => '456'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1075121' => {
                                         'BaseType' => '309850',
                                         'Name' => 'packet_verdict_opt_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10774' => {
                                       'Header' => 'wtap.h',
                                       'Line' => '1781',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'WTAP_UNCOMPRESSED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'WTAP_GZIP_COMPRESSED',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'WTAP_ZSTD_COMPRESSED',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'WTAP_LZ4_COMPRESSED',
                                                            'value' => '3'
                                                          }
                                                 },
                                       'Name' => 'enum wtap_compression_type',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '10787' => {
                                       'BaseType' => '10799',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '29',
                                       'Name' => 'subtype_read_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1079408' => {
                                         'BaseType' => '1057599',
                                         'Name' => 'section_info_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10799' => {
                                       'Name' => 'gboolean(*)(struct wtap*, wtap_rec*, Buffer*, int*, char**, gint64*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7164'
                                                           },
                                                    '1' => {
                                                             'type' => '10845'
                                                           },
                                                    '2' => {
                                                             'type' => '10851'
                                                           },
                                                    '3' => {
                                                             'type' => '10005'
                                                           },
                                                    '4' => {
                                                             'type' => '3155'
                                                           },
                                                    '5' => {
                                                             'type' => '10857'
                                                           }
                                                  },
                                       'Return' => '432',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '108' => {
                                     'BaseType' => '101',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '10845' => {
                                       'BaseType' => '9442',
                                       'Name' => 'wtap_rec*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10851' => {
                                       'BaseType' => '3845',
                                       'Name' => 'Buffer*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10857' => {
                                       'BaseType' => '211',
                                       'Name' => 'gint64*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '10863' => {
                                       'BaseType' => '10875',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '31',
                                       'Name' => 'subtype_seek_read_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '1086529' => {
                                         'BaseType' => '1057611',
                                         'Name' => 'section_info_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '10875' => {
                                       'Name' => 'gboolean(*)(struct wtap*, gint64, wtap_rec*, Buffer*, int*, char**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7164'
                                                           },
                                                    '1' => {
                                                             'type' => '211'
                                                           },
                                                    '2' => {
                                                             'type' => '10845'
                                                           },
                                                    '3' => {
                                                             'type' => '10851'
                                                           },
                                                    '4' => {
                                                             'type' => '10005'
                                                           },
                                                    '5' => {
                                                             'type' => '3155'
                                                           }
                                                  },
                                       'Return' => '432',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10932' => {
                                       'Name' => 'void(*)(struct wtap*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '7164'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10938' => {
                                       'BaseType' => '283',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '85',
                                       'Name' => 'WFILE_T',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10950' => {
                                       'BaseType' => '10962',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '87',
                                       'Name' => 'subtype_add_idb_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10962' => {
                                       'Name' => 'gboolean(*)(struct wtap_dumper*, wtap_block_t, int*, gchar**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10998'
                                                           },
                                                    '1' => {
                                                             'type' => '3905'
                                                           },
                                                    '2' => {
                                                             'type' => '10005'
                                                           },
                                                    '3' => {
                                                             'type' => '2192'
                                                           }
                                                  },
                                       'Return' => '432',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10998' => {
                                       'BaseType' => '9548',
                                       'Name' => 'struct wtap_dumper*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11004' => {
                                       'BaseType' => '11016',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '90',
                                       'Name' => 'subtype_write_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11016' => {
                                       'Name' => 'gboolean(*)(struct wtap_dumper*, wtap_rec const*, guint8 const*, int*, gchar**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10998'
                                                           },
                                                    '1' => {
                                                             'type' => '11057'
                                                           },
                                                    '2' => {
                                                             'type' => '11063'
                                                           },
                                                    '3' => {
                                                             'type' => '10005'
                                                           },
                                                    '4' => {
                                                             'type' => '2192'
                                                           }
                                                  },
                                       'Return' => '432',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '1103658' => {
                                         'Name' => 'gboolean(*)(wtapng_block_t*, section_info_t const*, guint16, guint16, guint8 const*, int*, gchar**)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1057674'
                                                             },
                                                      '1' => {
                                                               'type' => '1086529'
                                                             },
                                                      '2' => {
                                                               'type' => '170'
                                                             },
                                                      '3' => {
                                                               'type' => '170'
                                                             },
                                                      '4' => {
                                                               'type' => '11063'
                                                             },
                                                      '5' => {
                                                               'type' => '10005'
                                                             },
                                                      '6' => {
                                                               'type' => '2192'
                                                             }
                                                    },
                                         'Return' => '432',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '11057' => {
                                       'BaseType' => '9455',
                                       'Name' => 'wtap_rec const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11063' => {
                                       'BaseType' => '151',
                                       'Name' => 'guint8 const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11069' => {
                                       'BaseType' => '11081',
                                       'Header' => 'wtap-int.h',
                                       'Line' => '93',
                                       'Name' => 'subtype_finish_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '11081' => {
                                       'Name' => 'gboolean(*)(struct wtap_dumper*, int*, gchar**)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '10998'
                                                           },
                                                    '1' => {
                                                             'type' => '10005'
                                                           },
                                                    '2' => {
                                                             'type' => '2192'
                                                           }
                                                  },
                                       'Return' => '432',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '11112' => {
                                       'BaseType' => '9503',
                                       'Name' => 'addrinfo_lists_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1129192' => {
                                         'BaseType' => '432',
                                         'Name' => 'gboolean const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '113' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1133019' => {
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '211',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'interface_data',
                                                              'offset' => '0',
                                                              'type' => '3130'
                                                            }
                                                   },
                                         'Name' => 'struct wtapng_iface_descriptions_s',
                                         'Size' => '8',
                                         'Type' => 'Struct'
                                       },
                          '1133046' => {
                                         'BaseType' => '1133019',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '213',
                                         'Name' => 'wtapng_iface_descriptions_t',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1138651' => {
                                         'Header' => 'wtap.h',
                                         'Line' => '1427',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'encap',
                                                              'offset' => '0',
                                                              'type' => '78'
                                                            },
                                                     '1' => {
                                                              'name' => 'snaplen',
                                                              'offset' => '4',
                                                              'type' => '78'
                                                            },
                                                     '2' => {
                                                              'name' => 'tsprec',
                                                              'offset' => '8',
                                                              'type' => '78'
                                                            },
                                                     '3' => {
                                                              'name' => 'shb_hdrs',
                                                              'offset' => '16',
                                                              'type' => '3130'
                                                            },
                                                     '4' => {
                                                              'name' => 'idb_inf',
                                                              'offset' => '24',
                                                              'type' => '1138792'
                                                            },
                                                     '5' => {
                                                              'name' => 'nrb_hdrs',
                                                              'offset' => '32',
                                                              'type' => '3130'
                                                            },
                                                     '6' => {
                                                              'name' => 'dsbs_initial',
                                                              'offset' => '40',
                                                              'type' => '3130'
                                                            },
                                                     '7' => {
                                                              'name' => 'dsbs_growing',
                                                              'offset' => '48',
                                                              'type' => '9516'
                                                            },
                                                     '8' => {
                                                              'name' => 'dont_copy_idbs',
                                                              'offset' => '56',
                                                              'type' => '432'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_dump_params',
                                         'Size' => '64',
                                         'Type' => 'Struct'
                                       },
                          '1138792' => {
                                         'BaseType' => '1133046',
                                         'Name' => 'wtapng_iface_descriptions_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1138804' => {
                                         'BaseType' => '1138651',
                                         'Header' => 'wtap.h',
                                         'Line' => '1439',
                                         'Name' => 'wtap_dump_params',
                                         'Size' => '64',
                                         'Type' => 'Typedef'
                                       },
                          '1138817' => {
                                         'BaseType' => '1138804',
                                         'Name' => 'wtap_dump_params const',
                                         'Size' => '64',
                                         'Type' => 'Const'
                                       },
                          '1138835' => {
                                         'BaseType' => '9522',
                                         'Name' => 'wtap const',
                                         'Size' => '168',
                                         'Type' => 'Const'
                                       },
                          '1139219' => {
                                         'Header' => 'wtap.h',
                                         'Line' => '1484',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'name',
                                                              'offset' => '0',
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'name' => 'is_capture_file',
                                                              'offset' => '8',
                                                              'type' => '432'
                                                            },
                                                     '2' => {
                                                              'name' => 'extensions',
                                                              'offset' => '16',
                                                              'type' => '90'
                                                            }
                                                   },
                                         'Name' => 'struct file_extension_info',
                                         'Size' => '24',
                                         'Type' => 'Struct'
                                       },
                          '1139276' => {
                                         'BaseType' => '1139219',
                                         'Name' => 'struct file_extension_info const',
                                         'Size' => '24',
                                         'Type' => 'Const'
                                       },
                          '1140187' => {
                                         'Header' => 'wtap.h',
                                         'Line' => '2131',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'FT_SORT_BY_NAME',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'FT_SORT_BY_DESCRIPTION',
                                                              'value' => '1'
                                                            }
                                                   },
                                         'Name' => 'enum ft_sort_order',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1140796' => {
                                         'BaseType' => '1139276',
                                         'Name' => 'struct file_extension_info const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1140979' => {
                                         'BaseType' => '10549',
                                         'Name' => 'struct file_type_subtype_info const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1144225' => {
                                         'BaseType' => '1138817',
                                         'Name' => 'wtap_dump_params const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1154691' => {
                                         'BaseType' => '1138835',
                                         'Name' => 'wtap const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1157338' => {
                                         'BaseType' => '31757',
                                         'Name' => 'struct stat*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1169388' => {
                                         'BaseType' => '1169400',
                                         'Header' => 'zstd.h',
                                         'Line' => '218',
                                         'Name' => 'ZSTD_DCtx',
                                         'Type' => 'Typedef'
                                       },
                          '1169400' => {
                                         'Name' => 'struct ZSTD_DCtx_s',
                                         'Type' => 'Struct'
                                       },
                          '1169545' => {
                                         'BaseType' => '1169558',
                                         'Header' => 'lz4frame.h',
                                         'Line' => '340',
                                         'Name' => 'LZ4F_dctx',
                                         'Type' => 'Typedef'
                                       },
                          '1169558' => {
                                         'Name' => 'struct LZ4F_dctx_s',
                                         'Type' => 'Struct'
                                       },
                          '1169563' => {
                                         'BaseType' => '1169545',
                                         'Name' => 'LZ4F_dctx*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1169711' => {
                                         'Line' => '136',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'UNKNOWN',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'UNCOMPRESSED',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'ZLIB',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GZIP_AFTER_HEADER',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'ZSTD',
                                                              'value' => '4'
                                                            },
                                                     '5' => {
                                                              'name' => 'LZ4',
                                                              'value' => '5'
                                                            }
                                                   },
                                         'Name' => 'enum compression_t',
                                         'Size' => '4',
                                         'Source' => 'file_wrappers.c',
                                         'Type' => 'Enum'
                                       },
                          '1169723' => {
                                         'Line' => '162',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'buf',
                                                              'offset' => '0',
                                                              'type' => '717'
                                                            },
                                                     '1' => {
                                                              'name' => 'next',
                                                              'offset' => '8',
                                                              'type' => '717'
                                                            },
                                                     '2' => {
                                                              'name' => 'avail',
                                                              'offset' => '16',
                                                              'type' => '456'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_reader_buf',
                                         'Size' => '24',
                                         'Source' => 'file_wrappers.c',
                                         'Type' => 'Struct'
                                       },
                          '1169776' => {
                                         'BaseType' => '1169388',
                                         'Name' => 'ZSTD_DCtx*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1185876' => {
                                         'BaseType' => '3905',
                                         'Name' => 'wtap_block_t const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '1192687' => {
                                         'Header' => 'merge.h',
                                         'Line' => '25',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'RECORD_PRESENT',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'RECORD_NOT_PRESENT',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'AT_EOF',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GOT_ERROR',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum in_file_state_e',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1192699' => {
                                         'Header' => 'merge.h',
                                         'Line' => '30',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'filename',
                                                              'offset' => '0',
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'name' => 'wth',
                                                              'offset' => '8',
                                                              'type' => '13157'
                                                            },
                                                     '2' => {
                                                              'name' => 'rec',
                                                              'offset' => '16',
                                                              'type' => '9442'
                                                            },
                                                     '3' => {
                                                              'name' => 'frame_buffer',
                                                              'offset' => '264',
                                                              'type' => '3845'
                                                            },
                                                     '4' => {
                                                              'name' => 'state',
                                                              'offset' => '296',
                                                              'type' => '1192687'
                                                            },
                                                     '5' => {
                                                              'name' => 'packet_num',
                                                              'offset' => '300',
                                                              'type' => '199'
                                                            },
                                                     '6' => {
                                                              'name' => 'size',
                                                              'offset' => '304',
                                                              'type' => '211'
                                                            },
                                                     '7' => {
                                                              'name' => 'idb_index_map',
                                                              'offset' => '312',
                                                              'type' => '3130'
                                                            },
                                                     '8' => {
                                                              'name' => 'dsbs_seen',
                                                              'offset' => '320',
                                                              'type' => '456'
                                                            }
                                                   },
                                         'Name' => 'struct merge_in_file_s',
                                         'Size' => '328',
                                         'Type' => 'Struct'
                                       },
                          '1192843' => {
                                         'BaseType' => '1192699',
                                         'Header' => 'merge.h',
                                         'Line' => '40',
                                         'Name' => 'merge_in_file_t',
                                         'Size' => '328',
                                         'Type' => 'Typedef'
                                       },
                          '1192855' => {
                                         'BaseType' => '1192843',
                                         'Name' => 'merge_in_file_t const',
                                         'Size' => '328',
                                         'Type' => 'Const'
                                       },
                          '1192929' => {
                                         'Header' => 'merge.h',
                                         'Line' => '54',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MERGE_OK',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MERGE_USER_ABORTED',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MERGE_ERR_CANT_OPEN_INFILE',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MERGE_ERR_CANT_OPEN_OUTFILE',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'MERGE_ERR_CANT_READ_INFILE',
                                                              'value' => '4'
                                                            },
                                                     '5' => {
                                                              'name' => 'MERGE_ERR_BAD_PHDR_INTERFACE_ID',
                                                              'value' => '5'
                                                            },
                                                     '6' => {
                                                              'name' => 'MERGE_ERR_CANT_WRITE_OUTFILE',
                                                              'value' => '6'
                                                            },
                                                     '7' => {
                                                              'name' => 'MERGE_ERR_CANT_CLOSE_OUTFILE',
                                                              'value' => '7'
                                                            },
                                                     '8' => {
                                                              'name' => 'MERGE_ERR_INVALID_OPTION',
                                                              'value' => '8'
                                                            }
                                                   },
                                         'Name' => 'enum merge_result',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1192986' => {
                                         'Header' => 'merge.h',
                                         'Line' => '64',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MERGE_EVENT_INPUT_FILES_OPENED',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MERGE_EVENT_FRAME_TYPE_SELECTED',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MERGE_EVENT_READY_TO_MERGE',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MERGE_EVENT_RECORD_WAS_READ',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'MERGE_EVENT_DONE',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum merge_event',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1193037' => {
                                         'Header' => 'merge.h',
                                         'Line' => '73',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'IDB_MERGE_MODE_NONE',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'IDB_MERGE_MODE_ALL_SAME',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'IDB_MERGE_MODE_ANY_SAME',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'IDB_MERGE_MODE_MAX',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum idb_merge_mode',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1193049' => {
                                         'BaseType' => '1193037',
                                         'Name' => 'idb_merge_mode const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '1193125' => {
                                         'BaseType' => '1192855',
                                         'Name' => 'merge_in_file_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1193131' => {
                                         'Name' => 'gboolean(*)(merge_event, int, merge_in_file_t const*, guint const, void*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1192986'
                                                             },
                                                      '1' => {
                                                               'type' => '78'
                                                             },
                                                      '2' => {
                                                               'type' => '1193125'
                                                             },
                                                      '3' => {
                                                               'type' => '468'
                                                             },
                                                      '4' => {
                                                               'type' => '283'
                                                             }
                                                    },
                                         'Return' => '432',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1193137' => {
                                         'Header' => 'merge.h',
                                         'Line' => '113',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'callback_func',
                                                              'offset' => '0',
                                                              'type' => '1193131'
                                                            },
                                                     '1' => {
                                                              'name' => 'data',
                                                              'offset' => '8',
                                                              'type' => '283'
                                                            }
                                                   },
                                         'Name' => 'struct merge_progress_callback_t',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1194413' => {
                                         'BaseType' => '96',
                                         'Name' => 'char const*const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1194419' => {
                                         'BaseType' => '1193137',
                                         'Name' => 'merge_progress_callback_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '120' => {
                                     'BaseType' => '132',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '40',
                                     'Name' => 'gint8',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '1220254' => {
                                         'Header' => 'wtap.h',
                                         'Line' => '2222',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'register_wtap_module',
                                                              'offset' => '0',
                                                              'type' => '806'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_plugin',
                                         'Size' => '8',
                                         'Type' => 'Struct'
                                       },
                          '1220267' => {
                                         'BaseType' => '1220254',
                                         'Name' => 'wtap_plugin const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '1225861' => {
                                         'BaseType' => '1138804',
                                         'Name' => 'wtap_dump_params*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1230650' => {
                                         'BaseType' => '1220267',
                                         'Name' => 'wtap_plugin const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1237635' => {
                                         'BaseType' => '1237648',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '522',
                                         'Name' => 'wtap_block_create_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1237648' => {
                                         'Name' => 'void(*)(wtap_block_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3905'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1237665' => {
                                         'BaseType' => '1237648',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '523',
                                         'Name' => 'wtap_mand_free_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1237678' => {
                                         'BaseType' => '1237691',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '524',
                                         'Name' => 'wtap_mand_copy_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1237691' => {
                                         'Name' => 'void(*)(wtap_block_t, wtap_block_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '3905'
                                                             },
                                                      '1' => {
                                                               'type' => '3905'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1244482' => {
                                         'Line' => '43',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'block_type',
                                                              'offset' => '0',
                                                              'type' => '4015'
                                                            },
                                                     '1' => {
                                                              'name' => 'name',
                                                              'offset' => '8',
                                                              'type' => '90'
                                                            },
                                                     '2' => {
                                                              'name' => 'description',
                                                              'offset' => '16',
                                                              'type' => '90'
                                                            },
                                                     '3' => {
                                                              'name' => 'create',
                                                              'offset' => '24',
                                                              'type' => '1237635'
                                                            },
                                                     '4' => {
                                                              'name' => 'free_mand',
                                                              'offset' => '32',
                                                              'type' => '1237665'
                                                            },
                                                     '5' => {
                                                              'name' => 'copy_mand',
                                                              'offset' => '40',
                                                              'type' => '1237678'
                                                            },
                                                     '6' => {
                                                              'name' => 'options',
                                                              'offset' => '48',
                                                              'type' => '67648'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_blocktype_t',
                                         'Size' => '56',
                                         'Source' => 'wtap_opttypes.c',
                                         'Type' => 'Struct'
                                       },
                          '1244573' => {
                                         'BaseType' => '1244482',
                                         'Name' => 'wtap_blocktype_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1253193' => {
                                         'BaseType' => '307994',
                                         'Name' => 'GBytes**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1256871' => {
                                         'BaseType' => '308842',
                                         'Name' => 'ws_in6_addr*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1312' => {
                                      'BaseType' => '1324',
                                      'Header' => 'glist.h',
                                      'Line' => '37',
                                      'Name' => 'GList',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '13157' => {
                                       'BaseType' => '9522',
                                       'Name' => 'wtap*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '132' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1324' => {
                                      'Header' => 'glist.h',
                                      'Line' => '39',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '487'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '1377'
                                                         },
                                                  '2' => {
                                                           'name' => 'prev',
                                                           'offset' => '16',
                                                           'type' => '1377'
                                                         }
                                                },
                                      'Name' => 'struct _GList',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '1377' => {
                                      'BaseType' => '1312',
                                      'Name' => 'GList*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '139' => {
                                     'BaseType' => '156',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '41',
                                     'Name' => 'guint8',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '1404' => {
                                      'BaseType' => '1416',
                                      'Header' => 'gslist.h',
                                      'Line' => '37',
                                      'Name' => 'GSList',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '1416' => {
                                      'Header' => 'gslist.h',
                                      'Line' => '39',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '487'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '1456'
                                                         }
                                                },
                                      'Name' => 'struct _GSList',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1456' => {
                                      'BaseType' => '1404',
                                      'Name' => 'GSList*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '146934' => {
                                        'BaseType' => '223',
                                        'Name' => 'guint64*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '151' => {
                                     'BaseType' => '139',
                                     'Name' => 'guint8 const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '156' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '170' => {
                                     'BaseType' => '71',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '44',
                                     'Name' => 'guint16',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '187' => {
                                     'BaseType' => '78',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '51',
                                     'Name' => 'gint32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '191037' => {
                                        'BaseType' => '199',
                                        'Name' => 'guint32*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '199' => {
                                     'BaseType' => '45',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '52',
                                     'Name' => 'guint32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '211' => {
                                     'BaseType' => '113',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '61',
                                     'Name' => 'gint64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2192' => {
                                      'BaseType' => '711',
                                      'Name' => 'gchar**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '223' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '62',
                                     'Name' => 'guint64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '235' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '78',
                                     'Name' => 'gsize',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '247' => {
                                     'BaseType' => '113',
                                     'Header' => 'types.h',
                                     'Line' => '152',
                                     'Name' => '__off_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '271' => {
                                     'BaseType' => '113',
                                     'Header' => 'types.h',
                                     'Line' => '160',
                                     'Name' => '__time_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '283' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '285' => {
                                     'BaseType' => '101',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '28691' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '145',
                                       'Name' => '__dev_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28703' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '146',
                                       'Name' => '__uid_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '28715' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '147',
                                       'Name' => '__gid_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '28727' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '148',
                                       'Name' => '__ino_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28739' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '150',
                                       'Name' => '__mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '28751' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '151',
                                       'Name' => '__nlink_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28801' => {
                                       'BaseType' => '113',
                                       'Header' => 'types.h',
                                       'Line' => '174',
                                       'Name' => '__blksize_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28813' => {
                                       'BaseType' => '113',
                                       'Header' => 'types.h',
                                       'Line' => '179',
                                       'Name' => '__blkcnt_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28825' => {
                                       'BaseType' => '113',
                                       'Header' => 'types.h',
                                       'Line' => '196',
                                       'Name' => '__syscall_slong_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '28878' => {
                                       'Header' => 'struct_timespec.h',
                                       'Line' => '10',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tv_sec',
                                                            'offset' => '0',
                                                            'type' => '271'
                                                          },
                                                   '1' => {
                                                            'name' => 'tv_nsec',
                                                            'offset' => '8',
                                                            'type' => '28825'
                                                          }
                                                 },
                                       'Name' => 'struct timespec',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '291' => {
                                     'BaseType' => '271',
                                     'Header' => 'time_t.h',
                                     'Line' => '7',
                                     'Name' => 'time_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '305267' => {
                                        'BaseType' => '305279',
                                        'Header' => 'garray.h',
                                        'Line' => '36',
                                        'Name' => 'GBytes',
                                        'Type' => 'Typedef'
                                      },
                          '305279' => {
                                        'Name' => 'struct _GBytes',
                                        'Type' => 'Struct'
                                      },
                          '305341' => {
                                        'BaseType' => '305353',
                                        'Header' => 'garray.h',
                                        'Line' => '38',
                                        'Name' => 'GByteArray',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '305353' => {
                                        'Header' => 'garray.h',
                                        'Line' => '47',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'data',
                                                             'offset' => '0',
                                                             'type' => '717'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '456'
                                                           }
                                                  },
                                        'Name' => 'struct _GByteArray',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '307994' => {
                                        'BaseType' => '305267',
                                        'Name' => 'GBytes*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '308012' => {
                                        'BaseType' => '305341',
                                        'Name' => 'GByteArray*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '308787' => {
                                        'BaseType' => '199',
                                        'Header' => 'inet_ipv4.h',
                                        'Line' => '15',
                                        'Name' => 'ws_in4_addr',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '308799' => {
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '20',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bytes',
                                                             'offset' => '0',
                                                             'type' => '68753'
                                                           }
                                                  },
                                        'Name' => 'struct e_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '308842' => {
                                        'BaseType' => '308799',
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '22',
                                        'Name' => 'ws_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '309156' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '286',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT8',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT32',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT64',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'WTAP_OPTTYPE_STRING',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'WTAP_OPTTYPE_BYTES',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'WTAP_OPTTYPE_IPv4',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'WTAP_OPTTYPE_IPv6',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'WTAP_OPTTYPE_CUSTOM',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => 'WTAP_OPTTYPE_IF_FILTER',
                                                             'value' => '8'
                                                           },
                                                    '9' => {
                                                             'name' => 'WTAP_OPTTYPE_PACKET_VERDICT',
                                                             'value' => '9'
                                                           }
                                                  },
                                        'Name' => 'enum wtap_opttype_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '309227' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '296',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'WTAP_OPTTYPE_SUCCESS',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'WTAP_OPTTYPE_NO_SUCH_OPTION',
                                                             'value' => '18446744073709551615 (-1)'
                                                           },
                                                    '2' => {
                                                             'name' => 'WTAP_OPTTYPE_NOT_FOUND',
                                                             'value' => '18446744073709551614 (-2)'
                                                           },
                                                    '3' => {
                                                             'name' => 'WTAP_OPTTYPE_TYPE_MISMATCH',
                                                             'value' => '18446744073709551613 (-3)'
                                                           },
                                                    '4' => {
                                                             'name' => 'WTAP_OPTTYPE_NUMBER_MISMATCH',
                                                             'value' => '18446744073709551612 (-4)'
                                                           },
                                                    '5' => {
                                                             'name' => 'WTAP_OPTTYPE_ALREADY_EXISTS',
                                                             'value' => '18446744073709551611 (-5)'
                                                           },
                                                    '6' => {
                                                             'name' => 'WTAP_OPTTYPE_BAD_BLOCK',
                                                             'value' => '18446744073709551610 (-6)'
                                                           }
                                                  },
                                        'Name' => 'enum wtap_opttype_return_val',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '309240' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '308',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'custom_data_len',
                                                             'offset' => '0',
                                                             'type' => '235'
                                                           },
                                                    '1' => {
                                                             'name' => 'custom_data',
                                                             'offset' => '8',
                                                             'type' => '711'
                                                           }
                                                  },
                                        'Name' => 'struct generic_custom_opt_data',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '309283' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '312',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '199'
                                                           },
                                                    '1' => {
                                                             'name' => 'custom_data_len',
                                                             'offset' => '8',
                                                             'type' => '235'
                                                           },
                                                    '2' => {
                                                             'name' => 'custom_data',
                                                             'offset' => '16',
                                                             'type' => '711'
                                                           },
                                                    '3' => {
                                                             'name' => 'use_little_endian',
                                                             'offset' => '24',
                                                             'type' => '432'
                                                           }
                                                  },
                                        'Name' => 'struct nflx_custom_opt_data',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '309354' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '307',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'generic_data',
                                                             'offset' => '0',
                                                             'type' => '309240'
                                                           },
                                                    '1' => {
                                                             'name' => 'nflx_data',
                                                             'offset' => '0',
                                                             'type' => '309283'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-307',
                                        'Size' => '32',
                                        'Type' => 'Union'
                                      },
                          '309391' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '305',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pen',
                                                             'offset' => '0',
                                                             'type' => '199'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '309354'
                                                           }
                                                  },
                                        'Name' => 'struct custom_opt_s',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '309434' => {
                                        'BaseType' => '309391',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '319',
                                        'Name' => 'custom_opt_t',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '309447' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '334',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'code',
                                                             'offset' => '0',
                                                             'type' => '170'
                                                           },
                                                    '1' => {
                                                             'name' => 'jt',
                                                             'offset' => '2',
                                                             'type' => '139'
                                                           },
                                                    '2' => {
                                                             'name' => 'jf',
                                                             'offset' => '3',
                                                             'type' => '139'
                                                           },
                                                    '3' => {
                                                             'name' => 'k',
                                                             'offset' => '4',
                                                             'type' => '199'
                                                           }
                                                  },
                                        'Name' => 'struct wtap_bpf_insn_s',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '309514' => {
                                        'BaseType' => '309447',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '339',
                                        'Name' => 'wtap_bpf_insn_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '309555' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '347',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'if_filter_pcap',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'if_filter_bpf',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum if_filter_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '309568' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '353',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bpf_prog_len',
                                                             'offset' => '0',
                                                             'type' => '456'
                                                           },
                                                    '1' => {
                                                             'name' => 'bpf_prog',
                                                             'offset' => '8',
                                                             'type' => '309611'
                                                           }
                                                  },
                                        'Name' => 'struct wtap_bpf_insns',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '309611' => {
                                        'BaseType' => '309514',
                                        'Name' => 'wtap_bpf_insn_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '309617' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '351',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'filter_str',
                                                             'offset' => '0',
                                                             'type' => '711'
                                                           },
                                                    '1' => {
                                                             'name' => 'bpf_prog',
                                                             'offset' => '0',
                                                             'type' => '309568'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-351',
                                        'Size' => '16',
                                        'Type' => 'Union'
                                      },
                          '309654' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '349',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '309555'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '309617'
                                                           }
                                                  },
                                        'Name' => 'struct if_filter_opt_s',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '309697' => {
                                        'BaseType' => '309654',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '358',
                                        'Name' => 'if_filter_opt_t',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '309744' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '369',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'packet_verdict_hardware',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'packet_verdict_linux_ebpf_tc',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'packet_verdict_linux_ebpf_xdp',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum packet_verdict_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '309757' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '373',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'verdict_bytes',
                                                             'offset' => '0',
                                                             'type' => '308012'
                                                           },
                                                    '1' => {
                                                             'name' => 'verdict_linux_ebpf_tc',
                                                             'offset' => '0',
                                                             'type' => '223'
                                                           },
                                                    '2' => {
                                                             'name' => 'verdict_linux_ebpf_xdp',
                                                             'offset' => '0',
                                                             'type' => '223'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-373',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '309807' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '371',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '309744'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '309757'
                                                           }
                                                  },
                                        'Name' => 'struct packet_verdict_opt_s',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '309850' => {
                                        'BaseType' => '309807',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '378',
                                        'Name' => 'packet_verdict_opt_t',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '310004' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '394',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'uint8val',
                                                             'offset' => '0',
                                                             'type' => '139'
                                                           },
                                                    '1' => {
                                                             'name' => 'uint32val',
                                                             'offset' => '0',
                                                             'type' => '199'
                                                           },
                                                    '2' => {
                                                             'name' => 'uint64val',
                                                             'offset' => '0',
                                                             'type' => '223'
                                                           },
                                                    '3' => {
                                                             'name' => 'ipv4val',
                                                             'offset' => '0',
                                                             'type' => '308787'
                                                           },
                                                    '4' => {
                                                             'name' => 'ipv6val',
                                                             'offset' => '0',
                                                             'type' => '308842'
                                                           },
                                                    '5' => {
                                                             'name' => 'stringval',
                                                             'offset' => '0',
                                                             'type' => '285'
                                                           },
                                                    '6' => {
                                                             'name' => 'byteval',
                                                             'offset' => '0',
                                                             'type' => '307994'
                                                           },
                                                    '7' => {
                                                             'name' => 'custom_opt',
                                                             'offset' => '0',
                                                             'type' => '309434'
                                                           },
                                                    '8' => {
                                                             'name' => 'if_filterval',
                                                             'offset' => '0',
                                                             'type' => '309697'
                                                           },
                                                    '9' => {
                                                             'name' => 'packet_verdictval',
                                                             'offset' => '0',
                                                             'type' => '309850'
                                                           }
                                                  },
                                        'Name' => 'union wtap_optval_t',
                                        'Size' => '40',
                                        'Type' => 'Union'
                                      },
                          '310033' => {
                                        'BaseType' => '310046',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '1089',
                                        'Name' => 'wtap_block_foreach_func',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '310046' => {
                                        'Name' => 'gboolean(*)(wtap_block_t, guint, wtap_opttype_e, wtap_optval_t*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '3905'
                                                            },
                                                     '1' => {
                                                              'type' => '456'
                                                            },
                                                     '2' => {
                                                              'type' => '309156'
                                                            },
                                                     '3' => {
                                                              'type' => '310087'
                                                            },
                                                     '4' => {
                                                              'type' => '283'
                                                            }
                                                   },
                                        'Return' => '432',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '310087' => {
                                        'BaseType' => '310004',
                                        'Name' => 'wtap_optval_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '3130' => {
                                      'BaseType' => '602',
                                      'Name' => 'GArray*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3136' => {
                                      'BaseType' => '659',
                                      'Name' => 'GPtrArray*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3155' => {
                                      'BaseType' => '285',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '31757' => {
                                       'Header' => 'stat.h',
                                       'Line' => '46',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'st_dev',
                                                            'offset' => '0',
                                                            'type' => '28691'
                                                          },
                                                   '1' => {
                                                            'name' => 'st_ino',
                                                            'offset' => '8',
                                                            'type' => '28727'
                                                          },
                                                   '10' => {
                                                             'name' => 'st_blocks',
                                                             'offset' => '64',
                                                             'type' => '28813'
                                                           },
                                                   '11' => {
                                                             'name' => 'st_atim',
                                                             'offset' => '72',
                                                             'type' => '28878'
                                                           },
                                                   '12' => {
                                                             'name' => 'st_mtim',
                                                             'offset' => '88',
                                                             'type' => '28878'
                                                           },
                                                   '13' => {
                                                             'name' => 'st_ctim',
                                                             'offset' => '104',
                                                             'type' => '28878'
                                                           },
                                                   '14' => {
                                                             'name' => '__glibc_reserved',
                                                             'offset' => '120',
                                                             'type' => '31966'
                                                           },
                                                   '2' => {
                                                            'name' => 'st_nlink',
                                                            'offset' => '16',
                                                            'type' => '28751'
                                                          },
                                                   '3' => {
                                                            'name' => 'st_mode',
                                                            'offset' => '24',
                                                            'type' => '28739'
                                                          },
                                                   '4' => {
                                                            'name' => 'st_uid',
                                                            'offset' => '28',
                                                            'type' => '28703'
                                                          },
                                                   '5' => {
                                                            'name' => 'st_gid',
                                                            'offset' => '32',
                                                            'type' => '28715'
                                                          },
                                                   '6' => {
                                                            'name' => '__pad0',
                                                            'offset' => '36',
                                                            'type' => '78'
                                                          },
                                                   '7' => {
                                                            'name' => 'st_rdev',
                                                            'offset' => '40',
                                                            'type' => '28691'
                                                          },
                                                   '8' => {
                                                            'name' => 'st_size',
                                                            'offset' => '48',
                                                            'type' => '247'
                                                          },
                                                   '9' => {
                                                            'name' => 'st_blksize',
                                                            'offset' => '56',
                                                            'type' => '28801'
                                                          }
                                                 },
                                       'Name' => 'struct stat',
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '31966' => {
                                       'BaseType' => '28825',
                                       'Name' => '__syscall_slong_t[3]',
                                       'Size' => '24',
                                       'Type' => 'Array'
                                     },
                          '337262' => {
                                        'BaseType' => '309697',
                                        'Name' => 'if_filter_opt_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '3779' => {
                                      'Header' => 'buffer.h',
                                      'Line' => '21',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '717'
                                                         },
                                                  '1' => {
                                                           'name' => 'allocated',
                                                           'offset' => '8',
                                                           'type' => '235'
                                                         },
                                                  '2' => {
                                                           'name' => 'start',
                                                           'offset' => '16',
                                                           'type' => '235'
                                                         },
                                                  '3' => {
                                                           'name' => 'first_free',
                                                           'offset' => '24',
                                                           'type' => '235'
                                                         }
                                                },
                                      'Name' => 'struct Buffer',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '3845' => {
                                      'BaseType' => '3779',
                                      'Header' => 'buffer.h',
                                      'Line' => '26',
                                      'Name' => 'Buffer',
                                      'Size' => '32',
                                      'Type' => 'Typedef'
                                    },
                          '3893' => {
                                      'Header' => 'nstime.h',
                                      'Line' => '31',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'secs',
                                                           'offset' => '0',
                                                           'type' => '291'
                                                         },
                                                  '1' => {
                                                           'name' => 'nsecs',
                                                           'offset' => '8',
                                                           'type' => '78'
                                                         }
                                                },
                                      'Name' => 'struct nstime_t',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '3905' => {
                                      'BaseType' => '3917',
                                      'Header' => 'wtap_opttypes.h',
                                      'Line' => '142',
                                      'Name' => 'wtap_block_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '391' => {
                                     'BaseType' => '101',
                                     'Header' => 'gtypes.h',
                                     'Line' => '46',
                                     'Name' => 'gchar',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '3917' => {
                                      'BaseType' => '3923',
                                      'Name' => 'struct wtap_block*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3923' => {
                                      'Line' => '82',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'info',
                                                           'offset' => '0',
                                                           'type' => '1244573'
                                                         },
                                                  '1' => {
                                                           'name' => 'mandatory_data',
                                                           'offset' => '8',
                                                           'type' => '283'
                                                         },
                                                  '2' => {
                                                           'name' => 'options',
                                                           'offset' => '16',
                                                           'type' => '3130'
                                                         },
                                                  '3' => {
                                                           'name' => 'ref_count',
                                                           'offset' => '24',
                                                           'type' => '420'
                                                         }
                                                },
                                      'Name' => 'struct wtap_block',
                                      'Size' => '32',
                                      'Source' => 'wtap_opttypes.c',
                                      'Type' => 'Struct'
                                    },
                          '4015' => {
                                      'Header' => 'wtap_opttypes.h',
                                      'Line' => '191',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WTAP_BLOCK_SECTION',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WTAP_BLOCK_IF_ID_AND_INFO',
                                                           'value' => '1'
                                                         },
                                                  '10' => {
                                                            'name' => 'WTAP_BLOCK_CUSTOM',
                                                            'value' => '10'
                                                          },
                                                  '11' => {
                                                            'name' => 'MAX_WTAP_BLOCK_TYPE_VALUE',
                                                            'value' => '11'
                                                          },
                                                  '2' => {
                                                           'name' => 'WTAP_BLOCK_NAME_RESOLUTION',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'WTAP_BLOCK_IF_STATISTICS',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'WTAP_BLOCK_DECRYPTION_SECRETS',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'WTAP_BLOCK_PACKET',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'WTAP_BLOCK_FT_SPECIFIC_REPORT',
                                                           'value' => '6'
                                                         },
                                                  '7' => {
                                                           'name' => 'WTAP_BLOCK_FT_SPECIFIC_EVENT',
                                                           'value' => '7'
                                                         },
                                                  '8' => {
                                                           'name' => 'WTAP_BLOCK_SYSDIG_EVENT',
                                                           'value' => '8'
                                                         },
                                                  '9' => {
                                                           'name' => 'WTAP_BLOCK_SYSTEMD_JOURNAL_EXPORT',
                                                           'value' => '9'
                                                         }
                                                },
                                      'Name' => 'enum wtap_block_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '4027' => {
                                      'BaseType' => '101',
                                      'Name' => 'char[64]',
                                      'Size' => '64',
                                      'Type' => 'Array'
                                    },
                          '403' => {
                                     'BaseType' => '391',
                                     'Name' => 'gchar const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '4043' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '358',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fcs_len',
                                                           'offset' => '0',
                                                           'type' => '420'
                                                         }
                                                },
                                      'Name' => 'struct eth_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '4072' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '365',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'flags',
                                                           'offset' => '0',
                                                           'type' => '139'
                                                         }
                                                },
                                      'Name' => 'struct dte_dce_phdr',
                                      'Size' => '1',
                                      'Type' => 'Struct'
                                    },
                          '4101' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '372',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'uton',
                                                           'offset' => '0',
                                                           'type' => '432'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '4',
                                                           'type' => '139'
                                                         }
                                                },
                                      'Name' => 'struct isdn_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4144' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '455',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'flags',
                                                           'offset' => '0',
                                                           'type' => '199'
                                                         },
                                                  '1' => {
                                                           'name' => 'aal',
                                                           'offset' => '4',
                                                           'type' => '139'
                                                         },
                                                  '10' => {
                                                            'name' => 'aal5t_len',
                                                            'offset' => '20',
                                                            'type' => '170'
                                                          },
                                                  '11' => {
                                                            'name' => 'aal5t_chksum',
                                                            'offset' => '24',
                                                            'type' => '199'
                                                          },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '5',
                                                           'type' => '139'
                                                         },
                                                  '3' => {
                                                           'name' => 'subtype',
                                                           'offset' => '6',
                                                           'type' => '139'
                                                         },
                                                  '4' => {
                                                           'name' => 'vpi',
                                                           'offset' => '8',
                                                           'type' => '170'
                                                         },
                                                  '5' => {
                                                           'name' => 'vci',
                                                           'offset' => '10',
                                                           'type' => '170'
                                                         },
                                                  '6' => {
                                                           'name' => 'aal2_cid',
                                                           'offset' => '12',
                                                           'type' => '139'
                                                         },
                                                  '7' => {
                                                           'name' => 'channel',
                                                           'offset' => '14',
                                                           'type' => '170'
                                                         },
                                                  '8' => {
                                                           'name' => 'cells',
                                                           'offset' => '16',
                                                           'type' => '170'
                                                         },
                                                  '9' => {
                                                           'name' => 'aal5t_u2u',
                                                           'offset' => '18',
                                                           'type' => '170'
                                                         }
                                                },
                                      'Name' => 'struct atm_phdr',
                                      'Size' => '28',
                                      'Type' => 'Struct'
                                    },
                          '420' => {
                                     'BaseType' => '78',
                                     'Header' => 'gtypes.h',
                                     'Line' => '49',
                                     'Name' => 'gint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '432' => {
                                     'BaseType' => '420',
                                     'Header' => 'gtypes.h',
                                     'Line' => '50',
                                     'Name' => 'gboolean',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '4327' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '482',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '170'
                                                         },
                                                  '1' => {
                                                           'name' => 'user',
                                                           'offset' => '2',
                                                           'type' => '4027'
                                                         },
                                                  '2' => {
                                                           'name' => 'sess',
                                                           'offset' => '68',
                                                           'type' => '199'
                                                         },
                                                  '3' => {
                                                           'name' => 'call_num',
                                                           'offset' => '72',
                                                           'type' => '4027'
                                                         },
                                                  '4' => {
                                                           'name' => 'chunk',
                                                           'offset' => '136',
                                                           'type' => '199'
                                                         },
                                                  '5' => {
                                                           'name' => 'task',
                                                           'offset' => '140',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct ascend_phdr',
                                      'Size' => '144',
                                      'Type' => 'Struct'
                                    },
                          '4426' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '492',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '432'
                                                         }
                                                },
                                      'Name' => 'struct p2p_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '4455' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '544',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_set',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_pattern',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_index',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '3' => {
                                                           'name' => 'hop_set',
                                                           'offset' => '1',
                                                           'type' => '139'
                                                         },
                                                  '4' => {
                                                           'name' => 'hop_pattern',
                                                           'offset' => '2',
                                                           'type' => '139'
                                                         },
                                                  '5' => {
                                                           'name' => 'hop_index',
                                                           'offset' => '3',
                                                           'type' => '139'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11_fhss',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '45' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '456' => {
                                     'BaseType' => '45',
                                     'Header' => 'gtypes.h',
                                     'Line' => '55',
                                     'Name' => 'guint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '4563' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '557',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_preamble',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '1' => {
                                                           'name' => 'short_preamble',
                                                           'offset' => '4',
                                                           'type' => '432'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11b',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4609' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '567',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_channel_type',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_turbo_type',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '2',
                                                           'name' => 'channel_type',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '2',
                                                           'name' => 'turbo_type',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11a',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '468' => {
                                     'BaseType' => '456',
                                     'Name' => 'guint const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '4692' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '603',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mode',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '1' => {
                                                           'name' => 'mode',
                                                           'offset' => '4',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11g',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4738' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '619',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bandwidth',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'greenfield',
                                                            'offset' => '8',
                                                            'type' => '456'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fec',
                                                            'offset' => '8',
                                                            'type' => '456'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '2',
                                                            'name' => 'stbc_streams',
                                                            'offset' => '8',
                                                            'type' => '456'
                                                          },
                                                  '13' => {
                                                            'name' => 'ness',
                                                            'offset' => '12',
                                                            'type' => '456'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_greenfield',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_fec',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_stbc_streams',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_ness',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '7' => {
                                                           'name' => 'mcs_index',
                                                           'offset' => '2',
                                                           'type' => '170'
                                                         },
                                                  '8' => {
                                                           'name' => 'bandwidth',
                                                           'offset' => '4',
                                                           'type' => '456'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'short_gi',
                                                           'offset' => '8',
                                                           'type' => '456'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11n',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '487' => {
                                     'BaseType' => '283',
                                     'Header' => 'gtypes.h',
                                     'Line' => '103',
                                     'Name' => 'gpointer',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '4982' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '671',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_stbc',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_txop_ps_not_allowed',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'stbc',
                                                            'offset' => '0',
                                                            'type' => '456'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'txop_ps_not_allowed',
                                                            'offset' => '0',
                                                            'type' => '456'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'short_gi',
                                                            'offset' => '0',
                                                            'type' => '456'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'short_gi_nsym_disambig',
                                                            'offset' => '0',
                                                            'type' => '456'
                                                          },
                                                  '14' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ldpc_extra_ofdm_symbol',
                                                            'offset' => '0',
                                                            'type' => '456'
                                                          },
                                                  '15' => {
                                                            'bitfield' => '1',
                                                            'name' => 'beamformed',
                                                            'offset' => '0',
                                                            'type' => '456'
                                                          },
                                                  '16' => {
                                                            'name' => 'bandwidth',
                                                            'offset' => '2',
                                                            'type' => '139'
                                                          },
                                                  '17' => {
                                                            'name' => 'mcs',
                                                            'offset' => '3',
                                                            'type' => '5353'
                                                          },
                                                  '18' => {
                                                            'name' => 'nss',
                                                            'offset' => '7',
                                                            'type' => '5353'
                                                          },
                                                  '19' => {
                                                            'name' => 'fec',
                                                            'offset' => '11',
                                                            'type' => '139'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '20' => {
                                                            'name' => 'group_id',
                                                            'offset' => '12',
                                                            'type' => '139'
                                                          },
                                                  '21' => {
                                                            'name' => 'partial_aid',
                                                            'offset' => '14',
                                                            'type' => '170'
                                                          },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi_nsym_disambig',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_ldpc_extra_ofdm_symbol',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_beamformed',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bandwidth',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '7' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_fec',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_group_id',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_partial_aid',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ac',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '499' => {
                                     'BaseType' => '505',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '505' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '52' => {
                                    'BaseType' => '64',
                                    'Header' => 'stddef.h',
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '535' => {
                                     'BaseType' => '403',
                                     'Name' => 'gchar const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5353' => {
                                      'BaseType' => '139',
                                      'Name' => 'guint8[4]',
                                      'Size' => '4',
                                      'Type' => 'Array'
                                    },
                          '5369' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '712',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '1' => {
                                                           'name' => 'mcs',
                                                           'offset' => '1',
                                                           'type' => '139'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ad',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '5415' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '722',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bwru',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_gi',
                                                           'offset' => '0',
                                                           'type' => '456'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '4',
                                                           'name' => 'nsts',
                                                           'offset' => '0',
                                                           'type' => '139'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '4',
                                                           'name' => 'mcs',
                                                           'offset' => '1',
                                                           'type' => '139'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '4',
                                                           'name' => 'bwru',
                                                           'offset' => '1',
                                                           'type' => '139'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '2',
                                                           'name' => 'gi',
                                                           'offset' => '2',
                                                           'type' => '139'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ax',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '5548' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '734',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'info_11_fhss',
                                                           'offset' => '0',
                                                           'type' => '4455'
                                                         },
                                                  '1' => {
                                                           'name' => 'info_11b',
                                                           'offset' => '0',
                                                           'type' => '4563'
                                                         },
                                                  '2' => {
                                                           'name' => 'info_11a',
                                                           'offset' => '0',
                                                           'type' => '4609'
                                                         },
                                                  '3' => {
                                                           'name' => 'info_11g',
                                                           'offset' => '0',
                                                           'type' => '4692'
                                                         },
                                                  '4' => {
                                                           'name' => 'info_11n',
                                                           'offset' => '0',
                                                           'type' => '4738'
                                                         },
                                                  '5' => {
                                                           'name' => 'info_11ac',
                                                           'offset' => '0',
                                                           'type' => '4982'
                                                         },
                                                  '6' => {
                                                           'name' => 'info_11ad',
                                                           'offset' => '0',
                                                           'type' => '5369'
                                                         },
                                                  '7' => {
                                                           'name' => 'info_11ax',
                                                           'offset' => '0',
                                                           'type' => '5415'
                                                         }
                                                },
                                      'Name' => 'union ieee_802_11_phy_info',
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '5667' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '745',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fcs_len',
                                                           'offset' => '0',
                                                           'type' => '420'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'decrypted',
                                                           'offset' => '4',
                                                           'type' => '456'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_percent',
                                                            'offset' => '28',
                                                            'type' => '456'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_signal_dbm',
                                                            'offset' => '28',
                                                            'type' => '456'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_dbm',
                                                            'offset' => '28',
                                                            'type' => '456'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_signal_db',
                                                            'offset' => '28',
                                                            'type' => '456'
                                                          },
                                                  '14' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_db',
                                                            'offset' => '28',
                                                            'type' => '456'
                                                          },
                                                  '15' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_tsf_timestamp',
                                                            'offset' => '28',
                                                            'type' => '456'
                                                          },
                                                  '16' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_aggregate_info',
                                                            'offset' => '28',
                                                            'type' => '456'
                                                          },
                                                  '17' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_zero_length_psdu_type',
                                                            'offset' => '28',
                                                            'type' => '456'
                                                          },
                                                  '18' => {
                                                            'name' => 'channel',
                                                            'offset' => '30',
                                                            'type' => '170'
                                                          },
                                                  '19' => {
                                                            'name' => 'frequency',
                                                            'offset' => '32',
                                                            'type' => '199'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'datapad',
                                                           'offset' => '4',
                                                           'type' => '456'
                                                         },
                                                  '20' => {
                                                            'name' => 'data_rate',
                                                            'offset' => '36',
                                                            'type' => '170'
                                                          },
                                                  '21' => {
                                                            'name' => 'signal_percent',
                                                            'offset' => '38',
                                                            'type' => '139'
                                                          },
                                                  '22' => {
                                                            'name' => 'noise_percent',
                                                            'offset' => '39',
                                                            'type' => '139'
                                                          },
                                                  '23' => {
                                                            'name' => 'signal_dbm',
                                                            'offset' => '40',
                                                            'type' => '120'
                                                          },
                                                  '24' => {
                                                            'name' => 'noise_dbm',
                                                            'offset' => '41',
                                                            'type' => '120'
                                                          },
                                                  '25' => {
                                                            'name' => 'signal_db',
                                                            'offset' => '42',
                                                            'type' => '139'
                                                          },
                                                  '26' => {
                                                            'name' => 'noise_db',
                                                            'offset' => '43',
                                                            'type' => '139'
                                                          },
                                                  '27' => {
                                                            'name' => 'tsf_timestamp',
                                                            'offset' => '48',
                                                            'type' => '223'
                                                          },
                                                  '28' => {
                                                            'name' => 'aggregate_flags',
                                                            'offset' => '56',
                                                            'type' => '199'
                                                          },
                                                  '29' => {
                                                            'name' => 'aggregate_id',
                                                            'offset' => '60',
                                                            'type' => '199'
                                                          },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'no_a_msdus',
                                                           'offset' => '4',
                                                           'type' => '456'
                                                         },
                                                  '30' => {
                                                            'name' => 'zero_length_psdu_type',
                                                            'offset' => '64',
                                                            'type' => '139'
                                                          },
                                                  '4' => {
                                                           'name' => 'phy',
                                                           'offset' => '8',
                                                           'type' => '456'
                                                         },
                                                  '5' => {
                                                           'name' => 'phy_info',
                                                           'offset' => '12',
                                                           'type' => '5548'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_channel',
                                                           'offset' => '28',
                                                           'type' => '456'
                                                         },
                                                  '7' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_frequency',
                                                           'offset' => '28',
                                                           'type' => '456'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_data_rate',
                                                           'offset' => '28',
                                                           'type' => '456'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_signal_percent',
                                                           'offset' => '28',
                                                           'type' => '456'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11_phdr',
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '602' => {
                                     'BaseType' => '619',
                                     'Header' => 'garray.h',
                                     'Line' => '37',
                                     'Name' => 'GArray',
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '614' => {
                                     'BaseType' => '602',
                                     'Name' => 'GArray const',
                                     'Size' => '16',
                                     'Type' => 'Const'
                                   },
                          '6161' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '813',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'encap',
                                                           'offset' => '0',
                                                           'type' => '139'
                                                         },
                                                  '1' => {
                                                           'name' => 'direction',
                                                           'offset' => '1',
                                                           'type' => '139'
                                                         },
                                                  '2' => {
                                                           'name' => 'if_name',
                                                           'offset' => '2',
                                                           'type' => '6287'
                                                         },
                                                  '3' => {
                                                           'name' => 'pro',
                                                           'offset' => '130',
                                                           'type' => '170'
                                                         },
                                                  '4' => {
                                                           'name' => 'off',
                                                           'offset' => '132',
                                                           'type' => '170'
                                                         },
                                                  '5' => {
                                                           'name' => 'pri',
                                                           'offset' => '134',
                                                           'type' => '170'
                                                         },
                                                  '6' => {
                                                           'name' => 'rm',
                                                           'offset' => '136',
                                                           'type' => '170'
                                                         },
                                                  '7' => {
                                                           'name' => 'err',
                                                           'offset' => '138',
                                                           'type' => '170'
                                                         }
                                                },
                                      'Name' => 'struct cosine_phdr',
                                      'Size' => '140',
                                      'Type' => 'Struct'
                                    },
                          '619' => {
                                     'Header' => 'garray.h',
                                     'Line' => '41',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '711'
                                                        },
                                                 '1' => {
                                                          'name' => 'len',
                                                          'offset' => '8',
                                                          'type' => '456'
                                                        }
                                               },
                                     'Name' => 'struct _GArray',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '6287' => {
                                      'BaseType' => '101',
                                      'Name' => 'char[128]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '6303' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '845',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pkttype',
                                                           'offset' => '0',
                                                           'type' => '170'
                                                         }
                                                },
                                      'Name' => 'struct irda_phdr',
                                      'Size' => '2',
                                      'Type' => 'Struct'
                                    },
                          '6332' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '851',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'subsys',
                                                           'offset' => '0',
                                                           'type' => '170'
                                                         },
                                                  '1' => {
                                                           'name' => 'devid',
                                                           'offset' => '4',
                                                           'type' => '199'
                                                         },
                                                  '2' => {
                                                           'name' => 'kind',
                                                           'offset' => '8',
                                                           'type' => '199'
                                                         },
                                                  '3' => {
                                                           'name' => 'pid',
                                                           'offset' => '12',
                                                           'type' => '187'
                                                         },
                                                  '4' => {
                                                           'name' => 'uid',
                                                           'offset' => '16',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct nettl_phdr',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '64' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '6417' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '865',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '139'
                                                         },
                                                  '1' => {
                                                           'name' => 'annex_a_used',
                                                           'offset' => '1',
                                                           'type' => '139'
                                                         },
                                                  '2' => {
                                                           'name' => 'link_number',
                                                           'offset' => '2',
                                                           'type' => '170'
                                                         }
                                                },
                                      'Name' => 'struct mtp2_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '6474' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '874',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'vp',
                                                           'offset' => '0',
                                                           'type' => '170'
                                                         },
                                                  '1' => {
                                                           'name' => 'vc',
                                                           'offset' => '2',
                                                           'type' => '170'
                                                         },
                                                  '2' => {
                                                           'name' => 'cid',
                                                           'offset' => '4',
                                                           'type' => '170'
                                                         }
                                                },
                                      'Name' => 'anon-struct-wtap.h-874',
                                      'Size' => '6',
                                      'Type' => 'Struct'
                                    },
                          '6562' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '881',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '6474'
                                                         },
                                                  '1' => {
                                                           'name' => 'ds0mask',
                                                           'offset' => '0',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'union k12_input_info_t',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '6575' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '883',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'input',
                                                           'offset' => '0',
                                                           'type' => '199'
                                                         },
                                                  '1' => {
                                                           'name' => 'input_name',
                                                           'offset' => '8',
                                                           'type' => '535'
                                                         },
                                                  '2' => {
                                                           'name' => 'stack_file',
                                                           'offset' => '16',
                                                           'type' => '535'
                                                         },
                                                  '3' => {
                                                           'name' => 'input_type',
                                                           'offset' => '24',
                                                           'type' => '199'
                                                         },
                                                  '4' => {
                                                           'name' => 'input_info',
                                                           'offset' => '28',
                                                           'type' => '6562'
                                                         },
                                                  '5' => {
                                                           'name' => 'extra_info',
                                                           'offset' => '40',
                                                           'type' => '717'
                                                         },
                                                  '6' => {
                                                           'name' => 'extra_length',
                                                           'offset' => '48',
                                                           'type' => '199'
                                                         },
                                                  '7' => {
                                                           'name' => 'stuff',
                                                           'offset' => '56',
                                                           'type' => '283'
                                                         }
                                                },
                                      'Name' => 'struct k12_phdr',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '659' => {
                                     'BaseType' => '671',
                                     'Header' => 'garray.h',
                                     'Line' => '39',
                                     'Name' => 'GPtrArray',
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '66845' => {
                                       'BaseType' => '66857',
                                       'Header' => 'ghash.h',
                                       'Line' => '37',
                                       'Name' => 'GHashTable',
                                       'Type' => 'Typedef'
                                     },
                          '66857' => {
                                       'Name' => 'struct _GHashTable',
                                       'Type' => 'Struct'
                                     },
                          '6702' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '898',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pkttype',
                                                           'offset' => '0',
                                                           'type' => '170'
                                                         },
                                                  '1' => {
                                                           'name' => 'we_network',
                                                           'offset' => '2',
                                                           'type' => '139'
                                                         }
                                                },
                                      'Name' => 'struct lapd_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '671' => {
                                     'Header' => 'garray.h',
                                     'Line' => '53',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'pdata',
                                                          'offset' => '0',
                                                          'type' => '723'
                                                        },
                                                 '1' => {
                                                          'name' => 'len',
                                                          'offset' => '8',
                                                          'type' => '456'
                                                        }
                                               },
                                     'Name' => 'struct _GPtrArray',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '6745' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '906',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'isdn',
                                                           'offset' => '0',
                                                           'type' => '4101'
                                                         },
                                                  '1' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '4144'
                                                         },
                                                  '2' => {
                                                           'name' => 'p2p',
                                                           'offset' => '0',
                                                           'type' => '4426'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-906',
                                      'Size' => '28',
                                      'Type' => 'Union'
                                    },
                          '67648' => {
                                       'BaseType' => '66845',
                                       'Name' => 'GHashTable*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '6795' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '904',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'inner_pseudo_header',
                                                           'offset' => '0',
                                                           'type' => '6745'
                                                         },
                                                  '1' => {
                                                           'name' => 'seek_off',
                                                           'offset' => '32',
                                                           'type' => '211'
                                                         },
                                                  '2' => {
                                                           'name' => 'wth',
                                                           'offset' => '40',
                                                           'type' => '7164'
                                                         }
                                                },
                                      'Name' => 'struct catapult_dct2000_phdr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '6852' => {
                                      'Header' => 'wtap-int.h',
                                      'Line' => '37',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fh',
                                                           'offset' => '0',
                                                           'type' => '9808'
                                                         },
                                                  '1' => {
                                                           'name' => 'random_fh',
                                                           'offset' => '8',
                                                           'type' => '9808'
                                                         },
                                                  '10' => {
                                                            'name' => 'pathname',
                                                            'offset' => '72',
                                                            'type' => '285'
                                                          },
                                                  '11' => {
                                                            'name' => 'priv',
                                                            'offset' => '80',
                                                            'type' => '283'
                                                          },
                                                  '12' => {
                                                            'name' => 'wslua_data',
                                                            'offset' => '88',
                                                            'type' => '283'
                                                          },
                                                  '13' => {
                                                            'name' => 'subtype_read',
                                                            'offset' => '96',
                                                            'type' => '10787'
                                                          },
                                                  '14' => {
                                                            'name' => 'subtype_seek_read',
                                                            'offset' => '104',
                                                            'type' => '10863'
                                                          },
                                                  '15' => {
                                                            'name' => 'subtype_sequential_close',
                                                            'offset' => '112',
                                                            'type' => '10932'
                                                          },
                                                  '16' => {
                                                            'name' => 'subtype_close',
                                                            'offset' => '120',
                                                            'type' => '10932'
                                                          },
                                                  '17' => {
                                                            'name' => 'file_encap',
                                                            'offset' => '128',
                                                            'type' => '78'
                                                          },
                                                  '18' => {
                                                            'name' => 'file_tsprec',
                                                            'offset' => '132',
                                                            'type' => '78'
                                                          },
                                                  '19' => {
                                                            'name' => 'add_new_ipv4',
                                                            'offset' => '136',
                                                            'type' => '10624'
                                                          },
                                                  '2' => {
                                                           'name' => 'ispipe',
                                                           'offset' => '16',
                                                           'type' => '432'
                                                         },
                                                  '20' => {
                                                            'name' => 'add_new_ipv6',
                                                            'offset' => '144',
                                                            'type' => '10659'
                                                          },
                                                  '21' => {
                                                            'name' => 'add_new_secrets',
                                                            'offset' => '152',
                                                            'type' => '10694'
                                                          },
                                                  '22' => {
                                                            'name' => 'fast_seek',
                                                            'offset' => '160',
                                                            'type' => '3136'
                                                          },
                                                  '3' => {
                                                           'name' => 'file_type_subtype',
                                                           'offset' => '20',
                                                           'type' => '78'
                                                         },
                                                  '4' => {
                                                           'name' => 'snapshot_length',
                                                           'offset' => '24',
                                                           'type' => '456'
                                                         },
                                                  '5' => {
                                                           'name' => 'shb_hdrs',
                                                           'offset' => '32',
                                                           'type' => '3130'
                                                         },
                                                  '6' => {
                                                           'name' => 'interface_data',
                                                           'offset' => '40',
                                                           'type' => '3130'
                                                         },
                                                  '7' => {
                                                           'name' => 'next_interface_data',
                                                           'offset' => '48',
                                                           'type' => '456'
                                                         },
                                                  '8' => {
                                                           'name' => 'nrb_hdrs',
                                                           'offset' => '56',
                                                           'type' => '3130'
                                                         },
                                                  '9' => {
                                                           'name' => 'dsbs',
                                                           'offset' => '64',
                                                           'type' => '3130'
                                                         }
                                                },
                                      'Name' => 'struct wtap',
                                      'Size' => '168',
                                      'Type' => 'Struct'
                                    },
                          '68753' => {
                                       'BaseType' => '139',
                                       'Name' => 'guint8[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '71' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '711' => {
                                     'BaseType' => '391',
                                     'Name' => 'gchar*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '7164' => {
                                      'BaseType' => '6852',
                                      'Name' => 'struct wtap*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '717' => {
                                     'BaseType' => '139',
                                     'Name' => 'guint8*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '7170' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '919',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ts',
                                                           'offset' => '0',
                                                           'type' => '223'
                                                         },
                                                  '1' => {
                                                           'name' => 'type',
                                                           'offset' => '8',
                                                           'type' => '139'
                                                         },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '9',
                                                           'type' => '139'
                                                         },
                                                  '3' => {
                                                           'name' => 'rlen',
                                                           'offset' => '10',
                                                           'type' => '170'
                                                         },
                                                  '4' => {
                                                           'name' => 'lctr',
                                                           'offset' => '12',
                                                           'type' => '170'
                                                         },
                                                  '5' => {
                                                           'name' => 'wlen',
                                                           'offset' => '14',
                                                           'type' => '170'
                                                         }
                                                },
                                      'Name' => 'struct erf_phdr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '723' => {
                                     'BaseType' => '487',
                                     'Name' => 'gpointer*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '7268' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '928',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ehdr',
                                                           'offset' => '0',
                                                           'type' => '223'
                                                         }
                                                },
                                      'Name' => 'struct erf_ehdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '7297' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '939',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'offset',
                                                           'offset' => '0',
                                                           'type' => '139'
                                                         },
                                                  '1' => {
                                                           'name' => 'pad',
                                                           'offset' => '1',
                                                           'type' => '139'
                                                         }
                                                },
                                      'Name' => 'struct wtap_erf_eth_hdr',
                                      'Size' => '2',
                                      'Type' => 'Struct'
                                    },
                          '7340' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '947',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'eth_hdr',
                                                           'offset' => '0',
                                                           'type' => '7297'
                                                         },
                                                  '1' => {
                                                           'name' => 'mc_hdr',
                                                           'offset' => '0',
                                                           'type' => '199'
                                                         },
                                                  '2' => {
                                                           'name' => 'aal2_hdr',
                                                           'offset' => '0',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-947',
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '7390' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '944',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'phdr',
                                                           'offset' => '0',
                                                           'type' => '7170'
                                                         },
                                                  '1' => {
                                                           'name' => 'ehdr_list',
                                                           'offset' => '16',
                                                           'type' => '7447'
                                                         },
                                                  '2' => {
                                                           'name' => 'subhdr',
                                                           'offset' => '144',
                                                           'type' => '7340'
                                                         }
                                                },
                                      'Name' => 'struct erf_mc_phdr',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '7447' => {
                                      'BaseType' => '7268',
                                      'Name' => 'struct erf_ehdr[16]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '7463' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1010',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sita_flags',
                                                           'offset' => '0',
                                                           'type' => '139'
                                                         },
                                                  '1' => {
                                                           'name' => 'sita_signals',
                                                           'offset' => '1',
                                                           'type' => '139'
                                                         },
                                                  '2' => {
                                                           'name' => 'sita_errors1',
                                                           'offset' => '2',
                                                           'type' => '139'
                                                         },
                                                  '3' => {
                                                           'name' => 'sita_errors2',
                                                           'offset' => '3',
                                                           'type' => '139'
                                                         },
                                                  '4' => {
                                                           'name' => 'sita_proto',
                                                           'offset' => '4',
                                                           'type' => '139'
                                                         }
                                                },
                                      'Name' => 'struct sita_phdr',
                                      'Size' => '5',
                                      'Type' => 'Struct'
                                    },
                          '7548' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1019',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '432'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '4',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct bthci_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '7591' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1031',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'adapter_id',
                                                           'offset' => '0',
                                                           'type' => '170'
                                                         },
                                                  '1' => {
                                                           'name' => 'opcode',
                                                           'offset' => '2',
                                                           'type' => '170'
                                                         }
                                                },
                                      'Name' => 'struct btmon_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '7634' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1037',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'uton',
                                                           'offset' => '0',
                                                           'type' => '432'
                                                         }
                                                },
                                      'Name' => 'struct l1event_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '7663' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1042',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'is_event',
                                                           'offset' => '0',
                                                           'type' => '139'
                                                         },
                                                  '1' => {
                                                           'name' => 'bus',
                                                           'offset' => '1',
                                                           'type' => '139'
                                                         },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '4',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct i2c_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '7720' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1049',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'uplink',
                                                           'offset' => '0',
                                                           'type' => '432'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '4',
                                                           'type' => '139'
                                                         },
                                                  '2' => {
                                                           'name' => 'bsic',
                                                           'offset' => '5',
                                                           'type' => '139'
                                                         },
                                                  '3' => {
                                                           'name' => 'arfcn',
                                                           'offset' => '6',
                                                           'type' => '170'
                                                         },
                                                  '4' => {
                                                           'name' => 'tdma_frame',
                                                           'offset' => '8',
                                                           'type' => '199'
                                                         },
                                                  '5' => {
                                                           'name' => 'error',
                                                           'offset' => '12',
                                                           'type' => '139'
                                                         },
                                                  '6' => {
                                                           'name' => 'timeshift',
                                                           'offset' => '14',
                                                           'type' => '170'
                                                         }
                                                },
                                      'Name' => 'struct gsm_um_phdr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '774957' => {
                                        'BaseType' => '456',
                                        'Name' => 'guint*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '78' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '7833' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1071',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rec_offset',
                                                           'offset' => '0',
                                                           'type' => '211'
                                                         },
                                                  '1' => {
                                                           'name' => 'rec_len',
                                                           'offset' => '8',
                                                           'type' => '187'
                                                         },
                                                  '10' => {
                                                            'name' => 'vlantag_offset',
                                                            'offset' => '21',
                                                            'type' => '139'
                                                          },
                                                  '11' => {
                                                            'name' => 'coreid_offset',
                                                            'offset' => '22',
                                                            'type' => '139'
                                                          },
                                                  '12' => {
                                                            'name' => 'srcnodeid_offset',
                                                            'offset' => '23',
                                                            'type' => '139'
                                                          },
                                                  '13' => {
                                                            'name' => 'destnodeid_offset',
                                                            'offset' => '24',
                                                            'type' => '139'
                                                          },
                                                  '14' => {
                                                            'name' => 'clflags_offset',
                                                            'offset' => '25',
                                                            'type' => '139'
                                                          },
                                                  '15' => {
                                                            'name' => 'src_vmname_len_offset',
                                                            'offset' => '26',
                                                            'type' => '139'
                                                          },
                                                  '16' => {
                                                            'name' => 'dst_vmname_len_offset',
                                                            'offset' => '27',
                                                            'type' => '139'
                                                          },
                                                  '17' => {
                                                            'name' => 'ns_activity_offset',
                                                            'offset' => '28',
                                                            'type' => '139'
                                                          },
                                                  '18' => {
                                                            'name' => 'data_offset',
                                                            'offset' => '29',
                                                            'type' => '139'
                                                          },
                                                  '2' => {
                                                           'name' => 'nicno_offset',
                                                           'offset' => '12',
                                                           'type' => '139'
                                                         },
                                                  '3' => {
                                                           'name' => 'nicno_len',
                                                           'offset' => '13',
                                                           'type' => '139'
                                                         },
                                                  '4' => {
                                                           'name' => 'dir_offset',
                                                           'offset' => '14',
                                                           'type' => '139'
                                                         },
                                                  '5' => {
                                                           'name' => 'dir_len',
                                                           'offset' => '15',
                                                           'type' => '139'
                                                         },
                                                  '6' => {
                                                           'name' => 'eth_offset',
                                                           'offset' => '16',
                                                           'type' => '170'
                                                         },
                                                  '7' => {
                                                           'name' => 'pcb_offset',
                                                           'offset' => '18',
                                                           'type' => '139'
                                                         },
                                                  '8' => {
                                                           'name' => 'l_pcb_offset',
                                                           'offset' => '19',
                                                           'type' => '139'
                                                         },
                                                  '9' => {
                                                           'name' => 'rec_type',
                                                           'offset' => '20',
                                                           'type' => '139'
                                                         }
                                                },
                                      'Name' => 'struct nstr_phdr',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '80294' => {
                                       'BaseType' => '156',
                                       'Header' => 'zconf.h',
                                       'Line' => '391',
                                       'Name' => 'Byte',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '80307' => {
                                       'BaseType' => '45',
                                       'Header' => 'zconf.h',
                                       'Line' => '393',
                                       'Name' => 'uInt',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '80320' => {
                                       'BaseType' => '64',
                                       'Header' => 'zconf.h',
                                       'Line' => '394',
                                       'Name' => 'uLong',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '80333' => {
                                       'BaseType' => '80294',
                                       'Header' => 'zconf.h',
                                       'Line' => '400',
                                       'Name' => 'Bytef',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '80346' => {
                                       'BaseType' => '80333',
                                       'Name' => 'Bytef const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '80351' => {
                                       'BaseType' => '283',
                                       'Header' => 'zconf.h',
                                       'Line' => '409',
                                       'Name' => 'voidpf',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '80364' => {
                                       'BaseType' => '80376',
                                       'Header' => 'zlib.h',
                                       'Line' => '81',
                                       'Name' => 'alloc_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '80376' => {
                                       'Name' => 'voidpf(*)(voidpf, uInt, uInt)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '80351'
                                                           },
                                                    '1' => {
