$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '11.2.0',
          'Headers' => {
                         'buffer.h' => 1,
                         'file_wrappers.h' => 1,
                         'garray.h' => 1,
                         'ghash.h' => 1,
                         'glibconfig.h' => 1,
                         'glist.h' => 1,
                         'gslist.h' => 1,
                         'gtypes.h' => 1,
                         'inet_ipv4.h' => 1,
                         'inet_ipv6.h' => 1,
                         'lz4frame.h' => 1,
                         'merge.h' => 1,
                         'nstime.h' => 1,
                         'pcap-encap.h' => 1,
                         'pcapng_module.h' => 1,
                         'stddef.h' => 1,
                         'struct_stat.h' => 1,
                         'struct_timespec.h' => 1,
                         'time_t.h' => 1,
                         'types.h' => 1,
                         'wtap-int.h' => 1,
                         'wtap.h' => 1,
                         'wtap_opttypes.h' => 1,
                         'zconf.h' => 1,
                         'zlib.h' => 1,
                         'zstd.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libwiretap.so.12.0.1',
          'LibraryVersion' => '12.0.1',
          'NameSpaces' => {},

                                                     'wtap_name_to_encap' => 1,
                                                     'wtap_name_to_file_type_subtype' => 1,
                                                     'wtap_open_offline' => 1,
                                                     'wtap_opttypes_cleanup' => 1,
                                                     'wtap_opttypes_initialize' => 1,
                                                     'wtap_packet_verdict_free' => 1,
                                                     'wtap_pcap_encap_to_wtap_encap' => 1,
                                                     'wtap_pcap_file_type_subtype' => 1,
                                                     'wtap_pcap_nsec_file_type_subtype' => 1,
                                                     'wtap_pcapng_file_type_subtype' => 1,
                                                     'wtap_plugins_supported' => 1,
                                                     'wtap_read' => 1,
                                                     'wtap_read_bytes' => 1,
                                                     'wtap_read_bytes_or_eof' => 1,
                                                     'wtap_read_packet_bytes' => 1,
                                                     'wtap_read_so_far' => 1,
                                                     'wtap_rec_cleanup' => 1,
                                                     'wtap_rec_init' => 1,
                                                     'wtap_rec_reset' => 1,
                                                     'wtap_register_encap_type' => 1,
                                                     'wtap_register_file_type_extension' => 1,
                                                     'wtap_register_file_type_subtype' => 1,
                                                     'wtap_register_open_info' => 1,
                                                     'wtap_register_plugin' => 1,
                                                     'wtap_seek_read' => 1,
                                                     'wtap_sequential_close' => 1,
                                                     'wtap_set_bytes_dumped' => 1,
                                                     'wtap_set_cb_new_ipv4' => 1,
                                                     'wtap_set_cb_new_ipv6' => 1,
                                                     'wtap_set_cb_new_secrets' => 1,
                                                     'wtap_snapshot_length' => 1,
                                                     'wtap_strerror' => 1,
                                                     'wtap_tsprec_string' => 1,
                                                     'wtap_uses_lua_filehandler' => 1,
                                                     'wtap_write_shb_comment' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1001653' => {
                                         'Header' => 'merge.h',
                                         'Line' => '25',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'RECORD_PRESENT',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'RECORD_NOT_PRESENT',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'AT_EOF',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GOT_ERROR',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum in_file_state_e',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1001665' => {
                                         'Header' => 'merge.h',
                                         'Line' => '30',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'filename',
                                                              'offset' => '0',
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'name' => 'wth',
                                                              'offset' => '8',
                                                              'type' => '8722'
                                                            },
                                                     '2' => {
                                                              'name' => 'rec',
                                                              'offset' => '22',
                                                              'type' => '6272'
                                                            },
                                                     '3' => {
                                                              'name' => 'frame_buffer',
                                                              'offset' => '612',
                                                              'type' => '675'
                                                            },
                                                     '4' => {
                                                              'name' => 'state',
                                                              'offset' => '662',
                                                              'type' => '1001653'
                                                            },
                                                     '5' => {
                                                              'name' => 'packet_num',
                                                              'offset' => '768',
                                                              'type' => '189'
                                                            },
                                                     '6' => {
                                                              'name' => 'size',
                                                              'offset' => '772',
                                                              'type' => '201'
                                                            },
                                                     '7' => {
                                                              'name' => 'idb_index_map',
                                                              'offset' => '786',
                                                              'type' => '591'
                                                            },
                                                     '8' => {
                                                              'name' => 'dsbs_seen',
                                                              'offset' => '800',
                                                              'type' => '310'
                                                            }
                                                   },
                                         'Name' => 'struct merge_in_file_s',
                                         'Size' => '328',
                                         'Type' => 'Struct'
                                       },
                          '1001809' => {
                                         'BaseType' => '1001665',
                                         'Header' => 'merge.h',
                                         'Line' => '40',
                                         'Name' => 'merge_in_file_t',
                                         'Size' => '328',
                                         'Type' => 'Typedef'
                                       },
                          '1001821' => {
                                         'BaseType' => '1001809',
                                         'Name' => 'merge_in_file_t const',
                                         'Size' => '328',
                                         'Type' => 'Const'
                                       },
                          '1001895' => {
                                         'Header' => 'merge.h',
                                         'Line' => '54',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MERGE_OK',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MERGE_USER_ABORTED',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MERGE_ERR_CANT_OPEN_INFILE',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MERGE_ERR_CANT_OPEN_OUTFILE',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'MERGE_ERR_CANT_READ_INFILE',
                                                              'value' => '4'
                                                            },
                                                     '5' => {
                                                              'name' => 'MERGE_ERR_BAD_PHDR_INTERFACE_ID',
                                                              'value' => '5'
                                                            },
                                                     '6' => {
                                                              'name' => 'MERGE_ERR_CANT_WRITE_OUTFILE',
                                                              'value' => '6'
                                                            },
                                                     '7' => {
                                                              'name' => 'MERGE_ERR_CANT_CLOSE_OUTFILE',
                                                              'value' => '7'
                                                            },
                                                     '8' => {
                                                              'name' => 'MERGE_ERR_INVALID_OPTION',
                                                              'value' => '8'
                                                            }
                                                   },
                                         'Name' => 'enum merge_result',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1001952' => {
                                         'Header' => 'merge.h',
                                         'Line' => '64',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MERGE_EVENT_INPUT_FILES_OPENED',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MERGE_EVENT_FRAME_TYPE_SELECTED',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MERGE_EVENT_READY_TO_MERGE',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MERGE_EVENT_RECORD_WAS_READ',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'MERGE_EVENT_DONE',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum merge_event',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1002003' => {
                                         'Header' => 'merge.h',
                                         'Line' => '73',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'IDB_MERGE_MODE_NONE',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'IDB_MERGE_MODE_ALL_SAME',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'IDB_MERGE_MODE_ANY_SAME',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'IDB_MERGE_MODE_MAX',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum idb_merge_mode',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1002015' => {
                                         'BaseType' => '1002003',
                                         'Name' => 'idb_merge_mode const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '1002091' => {
                                         'BaseType' => '1001821',
                                         'Name' => 'merge_in_file_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1002097' => {
                                         'Name' => 'gboolean(*)(merge_event, int, merge_in_file_t const*, guint const, void*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1001952'
                                                             },
                                                      '1' => {
                                                               'type' => '78'
                                                             },
                                                      '2' => {
                                                               'type' => '1002091'
                                                             },
                                                      '3' => {
                                                               'type' => '322'
                                                             },
                                                      '4' => {
                                                               'type' => '249'
                                                             }
                                                    },
                                         'Return' => '298',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1002103' => {
                                         'Header' => 'merge.h',
                                         'Line' => '113',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'callback_func',
                                                              'offset' => '0',
                                                              'type' => '1002097'
                                                            },
                                                     '1' => {
                                                              'name' => 'data',
                                                              'offset' => '8',
                                                              'type' => '249'
                                                            }
                                                   },
                                         'Name' => 'struct merge_progress_callback_t',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1004131' => {
                                         'BaseType' => '95044',
                                         'Name' => 'char const*const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1004137' => {
                                         'BaseType' => '1002103',
                                         'Name' => 'merge_progress_callback_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1026209' => {
                                         'Header' => 'wtap.h',
                                         'Line' => '2222',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'register_wtap_module',
                                                              'offset' => '0',
                                                              'type' => '943220'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_plugin',
                                         'Size' => '8',
                                         'Type' => 'Struct'
                                       },
                          '1026222' => {
                                         'BaseType' => '1026209',
                                         'Name' => 'wtap_plugin const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '103' => {
                                     'BaseType' => '96',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '1033159' => {
                                         'BaseType' => '950244',
                                         'Name' => 'wtap_dump_params*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1037966' => {
                                         'BaseType' => '1026222',
                                         'Name' => 'wtap_plugin const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1041593' => {
                                         'BaseType' => '1041606',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '522',
                                         'Name' => 'wtap_block_create_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1041606' => {
                                         'Name' => 'void(*)(wtap_block_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '735'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1041623' => {
                                         'BaseType' => '1041606',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '523',
                                         'Name' => 'wtap_mand_free_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1041636' => {
                                         'BaseType' => '1041649',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '524',
                                         'Name' => 'wtap_mand_copy_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1041649' => {
                                         'Name' => 'void(*)(wtap_block_t, wtap_block_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '735'
                                                             },
                                                      '1' => {
                                                               'type' => '735'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1041844' => {
                                         'Line' => '43',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'block_type',
                                                              'offset' => '0',
                                                              'type' => '845'
                                                            },
                                                     '1' => {
                                                              'name' => 'name',
                                                              'offset' => '8',
                                                              'type' => '90'
                                                            },
                                                     '2' => {
                                                              'name' => 'description',
                                                              'offset' => '22',
                                                              'type' => '90'
                                                            },
                                                     '3' => {
                                                              'name' => 'create',
                                                              'offset' => '36',
                                                              'type' => '1041593'
                                                            },
                                                     '4' => {
                                                              'name' => 'free_mand',
                                                              'offset' => '50',
                                                              'type' => '1041623'
                                                            },
                                                     '5' => {
                                                              'name' => 'copy_mand',
                                                              'offset' => '64',
                                                              'type' => '1041636'
                                                            },
                                                     '6' => {
                                                              'name' => 'options',
                                                              'offset' => '72',
                                                              'type' => '50133'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_blocktype_t',
                                         'Size' => '56',
                                         'Source' => 'wtap_opttypes.c',
                                         'Type' => 'Struct'
                                       },
                          '1041935' => {
                                         'BaseType' => '1041844',
                                         'Name' => 'wtap_blocktype_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1050548' => {
                                         'BaseType' => '245521',
                                         'Name' => 'GBytes**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '108' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '115' => {
                                     'BaseType' => '127',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '42',
                                     'Name' => 'gint8',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '1157' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '482',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '165'
                                                         },
                                                  '1' => {
                                                           'name' => 'user',
                                                           'offset' => '2',
                                                           'type' => '857'
                                                         },
                                                  '2' => {
                                                           'name' => 'sess',
                                                           'offset' => '104',
                                                           'type' => '189'
                                                         },
                                                  '3' => {
                                                           'name' => 'call_num',
                                                           'offset' => '114',
                                                           'type' => '857'
                                                         },
                                                  '4' => {
                                                           'name' => 'chunk',
                                                           'offset' => '310',
                                                           'type' => '189'
                                                         },
                                                  '5' => {
                                                           'name' => 'task',
                                                           'offset' => '320',
                                                           'type' => '189'
                                                         }
                                                },
                                      'Name' => 'struct ascend_phdr',
                                      'Size' => '144',
                                      'Type' => 'Struct'
                                    },
                          '117539' => {
                                        'BaseType' => '213',
                                        'Name' => 'guint64*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1256' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '492',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '298'
                                                         }
                                                },
                                      'Name' => 'struct p2p_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '127' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1285' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '544',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_set',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_pattern',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_index',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '3' => {
                                                           'name' => 'hop_set',
                                                           'offset' => '1',
                                                           'type' => '134'
                                                         },
                                                  '4' => {
                                                           'name' => 'hop_pattern',
                                                           'offset' => '2',
                                                           'type' => '134'
                                                         },
                                                  '5' => {
                                                           'name' => 'hop_index',
                                                           'offset' => '3',
                                                           'type' => '134'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11_fhss',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '134' => {
                                     'BaseType' => '151',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '43',
                                     'Name' => 'guint8',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '1393' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '557',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_preamble',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'name' => 'short_preamble',
                                                           'offset' => '4',
                                                           'type' => '298'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11b',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '1439' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '567',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_channel_type',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_turbo_type',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '2',
                                                           'name' => 'channel_type',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '2',
                                                           'name' => 'turbo_type',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11a',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '146' => {
                                     'BaseType' => '134',
                                     'Name' => 'guint8 const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '151' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '152029' => {
                                        'BaseType' => '189',
                                        'Name' => 'guint32*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1522' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '603',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mode',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'name' => 'mode',
                                                           'offset' => '4',
                                                           'type' => '189'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11g',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '1568' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '619',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bandwidth',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'greenfield',
                                                            'offset' => '8',
                                                            'type' => '310'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fec',
                                                            'offset' => '8',
                                                            'type' => '310'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '2',
                                                            'name' => 'stbc_streams',
                                                            'offset' => '8',
                                                            'type' => '310'
                                                          },
                                                  '13' => {
                                                            'name' => 'ness',
                                                            'offset' => '18',
                                                            'type' => '310'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_greenfield',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_fec',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_stbc_streams',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_ness',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '7' => {
                                                           'name' => 'mcs_index',
                                                           'offset' => '2',
                                                           'type' => '165'
                                                         },
                                                  '8' => {
                                                           'name' => 'bandwidth',
                                                           'offset' => '4',
                                                           'type' => '310'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'short_gi',
                                                           'offset' => '8',
                                                           'type' => '310'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11n',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '165' => {
                                     'BaseType' => '71',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '46',
                                     'Name' => 'guint16',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '177' => {
                                     'BaseType' => '78',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '53',
                                     'Name' => 'gint32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1812' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '671',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_stbc',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_txop_ps_not_allowed',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'stbc',
                                                            'offset' => '0',
                                                            'type' => '310'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'txop_ps_not_allowed',
                                                            'offset' => '0',
                                                            'type' => '310'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'short_gi',
                                                            'offset' => '0',
                                                            'type' => '310'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'short_gi_nsym_disambig',
                                                            'offset' => '0',
                                                            'type' => '310'
                                                          },
                                                  '14' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ldpc_extra_ofdm_symbol',
                                                            'offset' => '0',
                                                            'type' => '310'
                                                          },
                                                  '15' => {
                                                            'bitfield' => '1',
                                                            'name' => 'beamformed',
                                                            'offset' => '0',
                                                            'type' => '310'
                                                          },
                                                  '16' => {
                                                            'name' => 'bandwidth',
                                                            'offset' => '2',
                                                            'type' => '134'
                                                          },
                                                  '17' => {
                                                            'name' => 'mcs',
                                                            'offset' => '3',
                                                            'type' => '2183'
                                                          },
                                                  '18' => {
                                                            'name' => 'nss',
                                                            'offset' => '7',
                                                            'type' => '2183'
                                                          },
                                                  '19' => {
                                                            'name' => 'fec',
                                                            'offset' => '17',
                                                            'type' => '134'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '20' => {
                                                            'name' => 'group_id',
                                                            'offset' => '18',
                                                            'type' => '134'
                                                          },
                                                  '21' => {
                                                            'name' => 'partial_aid',
                                                            'offset' => '20',
                                                            'type' => '165'
                                                          },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi_nsym_disambig',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_ldpc_extra_ofdm_symbol',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_beamformed',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bandwidth',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '7' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_fec',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_group_id',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_partial_aid',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ac',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '189' => {
                                     'BaseType' => '45',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '54',
                                     'Name' => 'guint32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '201' => {
                                     'BaseType' => '108',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '63',
                                     'Name' => 'gint64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '213' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '64',
                                     'Name' => 'guint64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2183' => {
                                      'BaseType' => '134',
                                      'Name' => 'guint8[4]',
                                      'Size' => '4',
                                      'Type' => 'Array'
                                    },
                          '2199' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '712',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'name' => 'mcs',
                                                           'offset' => '1',
                                                           'type' => '134'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ad',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '2245' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '722',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bwru',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_gi',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '4',
                                                           'name' => 'nsts',
                                                           'offset' => '0',
                                                           'type' => '134'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '4',
                                                           'name' => 'mcs',
                                                           'offset' => '1',
                                                           'type' => '134'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '4',
                                                           'name' => 'bwru',
                                                           'offset' => '1',
                                                           'type' => '134'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '2',
                                                           'name' => 'gi',
                                                           'offset' => '2',
                                                           'type' => '134'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ax',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '22457' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '145',
                                       'Name' => '__dev_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22469' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '146',
                                       'Name' => '__uid_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '22481' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '147',
                                       'Name' => '__gid_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '22493' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '148',
                                       'Name' => '__ino_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '225' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '80',
                                     'Name' => 'gsize',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '22505' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '150',
                                       'Name' => '__mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '22517' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '151',
                                       'Name' => '__nlink_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22529' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '152',
                                       'Name' => '__off_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22555' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '175',
                                       'Name' => '__blksize_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22567' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '180',
                                       'Name' => '__blkcnt_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22579' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '197',
                                       'Name' => '__syscall_slong_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22627' => {
                                       'Header' => 'struct_timespec.h',
                                       'Line' => '11',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tv_sec',
                                                            'offset' => '0',
                                                            'type' => '237'
                                                          },
                                                   '1' => {
                                                            'name' => 'tv_nsec',
                                                            'offset' => '8',
                                                            'type' => '22579'
                                                          }
                                                 },
                                       'Name' => 'struct timespec',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '23001' => {
                                       'Header' => 'struct_stat.h',
                                       'Line' => '26',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'st_dev',
                                                            'offset' => '0',
                                                            'type' => '22457'
                                                          },
                                                   '1' => {
                                                            'name' => 'st_ino',
                                                            'offset' => '8',
                                                            'type' => '22493'
                                                          },
                                                   '10' => {
                                                             'name' => 'st_blocks',
                                                             'offset' => '100',
                                                             'type' => '22567'
                                                           },
                                                   '11' => {
                                                             'name' => 'st_atim',
                                                             'offset' => '114',
                                                             'type' => '22627'
                                                           },
                                                   '12' => {
                                                             'name' => 'st_mtim',
                                                             'offset' => '136',
                                                             'type' => '22627'
                                                           },
                                                   '13' => {
                                                             'name' => 'st_ctim',
                                                             'offset' => '260',
                                                             'type' => '22627'
                                                           },
                                                   '14' => {
                                                             'name' => '__glibc_reserved',
                                                             'offset' => '288',
                                                             'type' => '23210'
                                                           },
                                                   '2' => {
                                                            'name' => 'st_nlink',
                                                            'offset' => '22',
                                                            'type' => '22517'
                                                          },
                                                   '3' => {
                                                            'name' => 'st_mode',
                                                            'offset' => '36',
                                                            'type' => '22505'
                                                          },
                                                   '4' => {
                                                            'name' => 'st_uid',
                                                            'offset' => '40',
                                                            'type' => '22469'
                                                          },
                                                   '5' => {
                                                            'name' => 'st_gid',
                                                            'offset' => '50',
                                                            'type' => '22481'
                                                          },
                                                   '6' => {
                                                            'name' => '__pad0',
                                                            'offset' => '54',
                                                            'type' => '78'
                                                          },
                                                   '7' => {
                                                            'name' => 'st_rdev',
                                                            'offset' => '64',
                                                            'type' => '22457'
                                                          },
                                                   '8' => {
                                                            'name' => 'st_size',
                                                            'offset' => '72',
                                                            'type' => '22529'
                                                          },
                                                   '9' => {
                                                            'name' => 'st_blksize',
                                                            'offset' => '86',
                                                            'type' => '22555'
                                                          }
                                                 },
                                       'Name' => 'struct stat',
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '23210' => {
                                       'BaseType' => '22579',
                                       'Name' => '__syscall_slong_t[3]',
                                       'Size' => '24',
                                       'Type' => 'Array'
                                     },
                          '237' => {
                                     'BaseType' => '108',
                                     'Header' => 'types.h',
                                     'Line' => '160',
                                     'Name' => '__time_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2378' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '734',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'info_11_fhss',
                                                           'offset' => '0',
                                                           'type' => '1285'
                                                         },
                                                  '1' => {
                                                           'name' => 'info_11b',
                                                           'offset' => '0',
                                                           'type' => '1393'
                                                         },
                                                  '2' => {
                                                           'name' => 'info_11a',
                                                           'offset' => '0',
                                                           'type' => '1439'
                                                         },
                                                  '3' => {
                                                           'name' => 'info_11g',
                                                           'offset' => '0',
                                                           'type' => '1522'
                                                         },
                                                  '4' => {
                                                           'name' => 'info_11n',
                                                           'offset' => '0',
                                                           'type' => '1568'
                                                         },
                                                  '5' => {
                                                           'name' => 'info_11ac',
                                                           'offset' => '0',
                                                           'type' => '1812'
                                                         },
                                                  '6' => {
                                                           'name' => 'info_11ad',
                                                           'offset' => '0',
                                                           'type' => '2199'
                                                         },
                                                  '7' => {
                                                           'name' => 'info_11ax',
                                                           'offset' => '0',
                                                           'type' => '2245'
                                                         }
                                                },
                                      'Name' => 'union ieee_802_11_phy_info',
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '245091' => {
                                        'BaseType' => '245103',
                                        'Header' => 'garray.h',
                                        'Line' => '36',
                                        'Name' => 'GBytes',
                                        'Type' => 'Typedef'
                                      },
                          '245103' => {
                                        'Name' => 'struct _GBytes',
                                        'Type' => 'Struct'
                                      },
                          '245165' => {
                                        'BaseType' => '245177',
                                        'Header' => 'garray.h',
                                        'Line' => '38',
                                        'Name' => 'GByteArray',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '245177' => {
                                        'Header' => 'garray.h',
                                        'Line' => '47',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'data',
                                                             'offset' => '0',
                                                             'type' => '481'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '310'
                                                           }
                                                  },
                                        'Name' => 'struct _GByteArray',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '245521' => {
                                        'BaseType' => '245091',
                                        'Name' => 'GBytes*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '245539' => {
                                        'BaseType' => '245165',
                                        'Name' => 'GByteArray*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '245683' => {
                                        'BaseType' => '189',
                                        'Header' => 'inet_ipv4.h',
                                        'Line' => '15',
                                        'Name' => 'ws_in4_addr',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '245695' => {
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '20',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bytes',
                                                             'offset' => '0',
                                                             'type' => '50290'
                                                           }
                                                  },
                                        'Name' => 'struct e_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '245738' => {
                                        'BaseType' => '245695',
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '22',
                                        'Name' => 'ws_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '246052' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '286',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT8',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT32',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT64',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'WTAP_OPTTYPE_STRING',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'WTAP_OPTTYPE_BYTES',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'WTAP_OPTTYPE_IPv4',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'WTAP_OPTTYPE_IPv6',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'WTAP_OPTTYPE_CUSTOM',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => 'WTAP_OPTTYPE_IF_FILTER',
                                                             'value' => '8'
                                                           },
                                                    '9' => {
                                                             'name' => 'WTAP_OPTTYPE_PACKET_VERDICT',
                                                             'value' => '9'
                                                           }
                                                  },
                                        'Name' => 'enum wtap_opttype_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '246136' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '308',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'custom_data_len',
                                                             'offset' => '0',
                                                             'type' => '225'
                                                           },
                                                    '1' => {
                                                             'name' => 'custom_data',
                                                             'offset' => '8',
                                                             'type' => '475'
                                                           }
                                                  },
                                        'Name' => 'struct generic_custom_opt_data',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '246179' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '312',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '189'
                                                           },
                                                    '1' => {
                                                             'name' => 'custom_data_len',
                                                             'offset' => '8',
                                                             'type' => '225'
                                                           },
                                                    '2' => {
                                                             'name' => 'custom_data',
                                                             'offset' => '22',
                                                             'type' => '475'
                                                           },
                                                    '3' => {
                                                             'name' => 'use_little_endian',
                                                             'offset' => '36',
                                                             'type' => '298'
                                                           }
                                                  },
                                        'Name' => 'struct nflx_custom_opt_data',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '246250' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '307',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'generic_data',
                                                             'offset' => '0',
                                                             'type' => '246136'
                                                           },
                                                    '1' => {
                                                             'name' => 'nflx_data',
                                                             'offset' => '0',
                                                             'type' => '246179'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-307',
                                        'Size' => '32',
                                        'Type' => 'Union'
                                      },
                          '246287' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '305',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pen',
                                                             'offset' => '0',
                                                             'type' => '189'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '246250'
                                                           }
                                                  },
                                        'Name' => 'struct custom_opt_s',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '246330' => {
                                        'BaseType' => '246287',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '319',
                                        'Name' => 'custom_opt_t',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '246343' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '334',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'code',
                                                             'offset' => '0',
                                                             'type' => '165'
                                                           },
                                                    '1' => {
                                                             'name' => 'jt',
                                                             'offset' => '2',
                                                             'type' => '134'
                                                           },
                                                    '2' => {
                                                             'name' => 'jf',
                                                             'offset' => '3',
                                                             'type' => '134'
                                                           },
                                                    '3' => {
                                                             'name' => 'k',
                                                             'offset' => '4',
                                                             'type' => '189'
                                                           }
                                                  },
                                        'Name' => 'struct wtap_bpf_insn_s',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '246410' => {
                                        'BaseType' => '246343',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '339',
                                        'Name' => 'wtap_bpf_insn_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '246451' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '347',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'if_filter_pcap',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'if_filter_bpf',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum if_filter_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '246464' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '353',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bpf_prog_len',
                                                             'offset' => '0',
                                                             'type' => '310'
                                                           },
                                                    '1' => {
                                                             'name' => 'bpf_prog',
                                                             'offset' => '8',
                                                             'type' => '246507'
                                                           }
                                                  },
                                        'Name' => 'struct wtap_bpf_insns',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '246507' => {
                                        'BaseType' => '246410',
                                        'Name' => 'wtap_bpf_insn_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '246513' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '351',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'filter_str',
                                                             'offset' => '0',
                                                             'type' => '475'
                                                           },
                                                    '1' => {
                                                             'name' => 'bpf_prog',
                                                             'offset' => '0',
                                                             'type' => '246464'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-351',
                                        'Size' => '16',
                                        'Type' => 'Union'
                                      },
                          '246550' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '349',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '246451'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '246513'
                                                           }
                                                  },
                                        'Name' => 'struct if_filter_opt_s',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '246593' => {
                                        'BaseType' => '246550',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '358',
                                        'Name' => 'if_filter_opt_t',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '246640' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '369',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'packet_verdict_hardware',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'packet_verdict_linux_ebpf_tc',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'packet_verdict_linux_ebpf_xdp',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum packet_verdict_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '246653' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '373',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'verdict_bytes',
                                                             'offset' => '0',
                                                             'type' => '245539'
                                                           },
                                                    '1' => {
                                                             'name' => 'verdict_linux_ebpf_tc',
                                                             'offset' => '0',
                                                             'type' => '213'
                                                           },
                                                    '2' => {
                                                             'name' => 'verdict_linux_ebpf_xdp',
                                                             'offset' => '0',
                                                             'type' => '213'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-373',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '246703' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '371',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '246640'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '246653'
                                                           }
                                                  },
                                        'Name' => 'struct packet_verdict_opt_s',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '246746' => {
                                        'BaseType' => '246703',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '378',
                                        'Name' => 'packet_verdict_opt_t',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '246900' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '394',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'uint8val',
                                                             'offset' => '0',
                                                             'type' => '134'
                                                           },
                                                    '1' => {
                                                             'name' => 'uint32val',
                                                             'offset' => '0',
                                                             'type' => '189'
                                                           },
                                                    '2' => {
                                                             'name' => 'uint64val',
                                                             'offset' => '0',
                                                             'type' => '213'
                                                           },
                                                    '3' => {
                                                             'name' => 'ipv4val',
                                                             'offset' => '0',
                                                             'type' => '245683'
                                                           },
                                                    '4' => {
                                                             'name' => 'ipv6val',
                                                             'offset' => '0',
                                                             'type' => '245738'
                                                           },
                                                    '5' => {
                                                             'name' => 'stringval',
                                                             'offset' => '0',
                                                             'type' => '251'
                                                           },
                                                    '6' => {
                                                             'name' => 'byteval',
                                                             'offset' => '0',
                                                             'type' => '245521'
                                                           },
                                                    '7' => {
                                                             'name' => 'custom_opt',
                                                             'offset' => '0',
                                                             'type' => '246330'
                                                           },
                                                    '8' => {
                                                             'name' => 'if_filterval',
                                                             'offset' => '0',
                                                             'type' => '246593'
                                                           },
                                                    '9' => {
                                                             'name' => 'packet_verdictval',
                                                             'offset' => '0',
                                                             'type' => '246746'
                                                           }
                                                  },
                                        'Name' => 'union wtap_optval_t',
                                        'Size' => '40',
                                        'Type' => 'Union'
                                      },
                          '246929' => {
                                        'BaseType' => '246942',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '1089',
                                        'Name' => 'wtap_block_foreach_func',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '246942' => {
                                        'Name' => 'gboolean(*)(wtap_block_t, guint, wtap_opttype_e, wtap_optval_t*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '735'
                                                            },
                                                     '1' => {
                                                              'type' => '310'
                                                            },
                                                     '2' => {
                                                              'type' => '246052'
                                                            },
                                                     '3' => {
                                                              'type' => '246983'
                                                            },
                                                     '4' => {
                                                              'type' => '249'
                                                            }
                                                   },
                                        'Return' => '298',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '246983' => {
                                        'BaseType' => '246900',
                                        'Name' => 'wtap_optval_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '249' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '2497' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '745',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fcs_len',
                                                           'offset' => '0',
                                                           'type' => '286'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'decrypted',
                                                           'offset' => '4',
                                                           'type' => '310'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_percent',
                                                            'offset' => '40',
                                                            'type' => '310'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_signal_dbm',
                                                            'offset' => '40',
                                                            'type' => '310'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_dbm',
                                                            'offset' => '40',
                                                            'type' => '310'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_signal_db',
                                                            'offset' => '40',
                                                            'type' => '310'
                                                          },
                                                  '14' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_db',
                                                            'offset' => '40',
                                                            'type' => '310'
                                                          },
                                                  '15' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_tsf_timestamp',
                                                            'offset' => '40',
                                                            'type' => '310'
                                                          },
                                                  '16' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_aggregate_info',
                                                            'offset' => '40',
                                                            'type' => '310'
                                                          },
                                                  '17' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_zero_length_psdu_type',
                                                            'offset' => '40',
                                                            'type' => '310'
                                                          },
                                                  '18' => {
                                                            'name' => 'channel',
                                                            'offset' => '48',
                                                            'type' => '165'
                                                          },
                                                  '19' => {
                                                            'name' => 'frequency',
                                                            'offset' => '50',
                                                            'type' => '189'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'datapad',
                                                           'offset' => '4',
                                                           'type' => '310'
                                                         },
                                                  '20' => {
                                                            'name' => 'data_rate',
                                                            'offset' => '54',
                                                            'type' => '165'
                                                          },
                                                  '21' => {
                                                            'name' => 'signal_percent',
                                                            'offset' => '56',
                                                            'type' => '134'
                                                          },
                                                  '22' => {
                                                            'name' => 'noise_percent',
                                                            'offset' => '57',
                                                            'type' => '134'
                                                          },
                                                  '23' => {
                                                            'name' => 'signal_dbm',
                                                            'offset' => '64',
                                                            'type' => '115'
                                                          },
                                                  '24' => {
                                                            'name' => 'noise_dbm',
                                                            'offset' => '65',
                                                            'type' => '115'
                                                          },
                                                  '25' => {
                                                            'name' => 'signal_db',
                                                            'offset' => '66',
                                                            'type' => '134'
                                                          },
                                                  '26' => {
                                                            'name' => 'noise_db',
                                                            'offset' => '67',
                                                            'type' => '134'
                                                          },
                                                  '27' => {
                                                            'name' => 'tsf_timestamp',
                                                            'offset' => '72',
                                                            'type' => '213'
                                                          },
                                                  '28' => {
                                                            'name' => 'aggregate_flags',
                                                            'offset' => '86',
                                                            'type' => '189'
                                                          },
                                                  '29' => {
                                                            'name' => 'aggregate_id',
                                                            'offset' => '96',
                                                            'type' => '189'
                                                          },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'no_a_msdus',
                                                           'offset' => '4',
                                                           'type' => '310'
                                                         },
                                                  '30' => {
                                                            'name' => 'zero_length_psdu_type',
                                                            'offset' => '100',
                                                            'type' => '134'
                                                          },
                                                  '4' => {
                                                           'name' => 'phy',
                                                           'offset' => '8',
                                                           'type' => '310'
                                                         },
                                                  '5' => {
                                                           'name' => 'phy_info',
                                                           'offset' => '18',
                                                           'type' => '2378'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_channel',
                                                           'offset' => '40',
                                                           'type' => '310'
                                                         },
                                                  '7' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_frequency',
                                                           'offset' => '40',
                                                           'type' => '310'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_data_rate',
                                                           'offset' => '40',
                                                           'type' => '310'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_signal_percent',
                                                           'offset' => '40',
                                                           'type' => '310'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11_phdr',
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '251' => {
                                     'BaseType' => '96',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '255757' => {
                                        'BaseType' => '246593',
                                        'Name' => 'if_filter_opt_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '257' => {
                                     'BaseType' => '237',
                                     'Header' => 'time_t.h',
                                     'Line' => '10',
                                     'Name' => 'time_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '269' => {
                                     'BaseType' => '96',
                                     'Header' => 'gtypes.h',
                                     'Line' => '46',
                                     'Name' => 'gchar',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '281' => {
                                     'BaseType' => '269',
                                     'Name' => 'gchar const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '286' => {
                                     'BaseType' => '78',
                                     'Header' => 'gtypes.h',
                                     'Line' => '49',
                                     'Name' => 'gint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '298' => {
                                     'BaseType' => '286',
                                     'Header' => 'gtypes.h',
                                     'Line' => '50',
                                     'Name' => 'gboolean',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2991' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '813',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'encap',
                                                           'offset' => '0',
                                                           'type' => '134'
                                                         },
                                                  '1' => {
                                                           'name' => 'direction',
                                                           'offset' => '1',
                                                           'type' => '134'
                                                         },
                                                  '2' => {
                                                           'name' => 'if_name',
                                                           'offset' => '2',
                                                           'type' => '3117'
                                                         },
                                                  '3' => {
                                                           'name' => 'pro',
                                                           'offset' => '304',
                                                           'type' => '165'
                                                         },
                                                  '4' => {
                                                           'name' => 'off',
                                                           'offset' => '306',
                                                           'type' => '165'
                                                         },
                                                  '5' => {
                                                           'name' => 'pri',
                                                           'offset' => '308',
                                                           'type' => '165'
                                                         },
                                                  '6' => {
                                                           'name' => 'rm',
                                                           'offset' => '310',
                                                           'type' => '165'
                                                         },
                                                  '7' => {
                                                           'name' => 'err',
                                                           'offset' => '312',
                                                           'type' => '165'
                                                         }
                                                },
                                      'Name' => 'struct cosine_phdr',
                                      'Size' => '140',
                                      'Type' => 'Struct'
                                    },
                          '310' => {
                                     'BaseType' => '45',
                                     'Header' => 'gtypes.h',
                                     'Line' => '55',
                                     'Name' => 'guint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '3117' => {
                                      'BaseType' => '96',
                                      'Name' => 'char[128]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '31231' => {
                                       'BaseType' => '23001',
                                       'Name' => 'struct stat*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3133' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '845',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pkttype',
                                                           'offset' => '0',
                                                           'type' => '165'
                                                         }
                                                },
                                      'Name' => 'struct irda_phdr',
                                      'Size' => '2',
                                      'Type' => 'Struct'
                                    },
                          '3162' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '851',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'subsys',
                                                           'offset' => '0',
                                                           'type' => '165'
                                                         },
                                                  '1' => {
                                                           'name' => 'devid',
                                                           'offset' => '4',
                                                           'type' => '189'
                                                         },
                                                  '2' => {
                                                           'name' => 'kind',
                                                           'offset' => '8',
                                                           'type' => '189'
                                                         },
                                                  '3' => {
                                                           'name' => 'pid',
                                                           'offset' => '18',
                                                           'type' => '177'
                                                         },
                                                  '4' => {
                                                           'name' => 'uid',
                                                           'offset' => '22',
                                                           'type' => '189'
                                                         }
                                                },
                                      'Name' => 'struct nettl_phdr',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '322' => {
                                     'BaseType' => '310',
                                     'Name' => 'guint const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '3247' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '865',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '134'
                                                         },
                                                  '1' => {
                                                           'name' => 'annex_a_used',
                                                           'offset' => '1',
                                                           'type' => '134'
                                                         },
                                                  '2' => {
                                                           'name' => 'link_number',
                                                           'offset' => '2',
                                                           'type' => '165'
                                                         }
                                                },
                                      'Name' => 'struct mtp2_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '3304' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '874',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'vp',
                                                           'offset' => '0',
                                                           'type' => '165'
                                                         },
                                                  '1' => {
                                                           'name' => 'vc',
                                                           'offset' => '2',
                                                           'type' => '165'
                                                         },
                                                  '2' => {
                                                           'name' => 'cid',
                                                           'offset' => '4',
                                                           'type' => '165'
                                                         }
                                                },
                                      'Name' => 'anon-struct-wtap.h-874',
                                      'Size' => '6',
                                      'Type' => 'Struct'
                                    },
                          '3392' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '881',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '3304'
                                                         },
                                                  '1' => {
                                                           'name' => 'ds0mask',
                                                           'offset' => '0',
                                                           'type' => '189'
                                                         }
                                                },
                                      'Name' => 'union k12_input_info_t',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '3405' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '883',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'input',
                                                           'offset' => '0',
                                                           'type' => '189'
                                                         },
                                                  '1' => {
                                                           'name' => 'input_name',
                                                           'offset' => '8',
                                                           'type' => '360'
                                                         },
                                                  '2' => {
                                                           'name' => 'stack_file',
                                                           'offset' => '22',
                                                           'type' => '360'
                                                         },
                                                  '3' => {
                                                           'name' => 'input_type',
                                                           'offset' => '36',
                                                           'type' => '189'
                                                         },
                                                  '4' => {
                                                           'name' => 'input_info',
                                                           'offset' => '40',
                                                           'type' => '3392'
                                                         },
                                                  '5' => {
                                                           'name' => 'extra_info',
                                                           'offset' => '64',
                                                           'type' => '481'
                                                         },
                                                  '6' => {
                                                           'name' => 'extra_length',
                                                           'offset' => '72',
                                                           'type' => '189'
                                                         },
                                                  '7' => {
                                                           'name' => 'stuff',
                                                           'offset' => '86',
                                                           'type' => '249'
                                                         }
                                                },
                                      'Name' => 'struct k12_phdr',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '341' => {
                                     'BaseType' => '249',
                                     'Header' => 'gtypes.h',
                                     'Line' => '103',
                                     'Name' => 'gpointer',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '353' => {
                                     'BaseType' => '359',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '3532' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '898',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pkttype',
                                                           'offset' => '0',
                                                           'type' => '165'
                                                         },
                                                  '1' => {
                                                           'name' => 'we_network',
                                                           'offset' => '2',
                                                           'type' => '134'
                                                         }
                                                },
                                      'Name' => 'struct lapd_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '3575' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '906',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'isdn',
                                                           'offset' => '0',
                                                           'type' => '931'
                                                         },
                                                  '1' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '974'
                                                         },
                                                  '2' => {
                                                           'name' => 'p2p',
                                                           'offset' => '0',
                                                           'type' => '1256'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-906',
                                      'Size' => '28',
                                      'Type' => 'Union'
                                    },
                          '359' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '360' => {
                                     'BaseType' => '281',
                                     'Name' => 'gchar const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '3625' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '904',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'inner_pseudo_header',
                                                           'offset' => '0',
                                                           'type' => '3575'
                                                         },
                                                  '1' => {
                                                           'name' => 'seek_off',
                                                           'offset' => '50',
                                                           'type' => '201'
                                                         },
                                                  '2' => {
                                                           'name' => 'wth',
                                                           'offset' => '64',
                                                           'type' => '3994'
                                                         }
                                                },
                                      'Name' => 'struct catapult_dct2000_phdr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '366' => {
                                     'BaseType' => '383',
                                     'Header' => 'garray.h',
                                     'Line' => '37',
                                     'Name' => 'GArray',
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '3682' => {
                                      'Header' => 'wtap-int.h',
                                      'Line' => '37',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fh',
                                                           'offset' => '0',
                                                           'type' => '6638'
                                                         },
                                                  '1' => {
                                                           'name' => 'random_fh',
                                                           'offset' => '8',
                                                           'type' => '6638'
                                                         },
                                                  '10' => {
                                                            'name' => 'pathname',
                                                            'offset' => '114',
                                                            'type' => '251'
                                                          },
                                                  '11' => {
                                                            'name' => 'priv',
                                                            'offset' => '128',
                                                            'type' => '249'
                                                          },
                                                  '12' => {
                                                            'name' => 'wslua_data',
                                                            'offset' => '136',
                                                            'type' => '249'
                                                          },
                                                  '13' => {
                                                            'name' => 'subtype_read',
                                                            'offset' => '150',
                                                            'type' => '7414'
                                                          },
                                                  '14' => {
                                                            'name' => 'subtype_seek_read',
                                                            'offset' => '260',
                                                            'type' => '7490'
                                                          },
                                                  '15' => {
                                                            'name' => 'subtype_sequential_close',
                                                            'offset' => '274',
                                                            'type' => '7559'
                                                          },
                                                  '16' => {
                                                            'name' => 'subtype_close',
                                                            'offset' => '288',
                                                            'type' => '7559'
                                                          },
                                                  '17' => {
                                                            'name' => 'file_encap',
                                                            'offset' => '296',
                                                            'type' => '78'
                                                          },
                                                  '18' => {
                                                            'name' => 'file_tsprec',
                                                            'offset' => '306',
                                                            'type' => '78'
                                                          },
                                                  '19' => {
                                                            'name' => 'add_new_ipv4',
                                                            'offset' => '310',
                                                            'type' => '7251'
                                                          },
                                                  '2' => {
                                                           'name' => 'ispipe',
                                                           'offset' => '22',
                                                           'type' => '298'
                                                         },
                                                  '20' => {
                                                            'name' => 'add_new_ipv6',
                                                            'offset' => '324',
                                                            'type' => '7286'
                                                          },
                                                  '21' => {
                                                            'name' => 'add_new_secrets',
                                                            'offset' => '338',
                                                            'type' => '7321'
                                                          },
                                                  '22' => {
                                                            'name' => 'fast_seek',
                                                            'offset' => '352',
                                                            'type' => '597'
                                                          },
                                                  '3' => {
                                                           'name' => 'file_type_subtype',
                                                           'offset' => '32',
                                                           'type' => '78'
                                                         },
                                                  '4' => {
                                                           'name' => 'snapshot_length',
                                                           'offset' => '36',
                                                           'type' => '310'
                                                         },
                                                  '5' => {
                                                           'name' => 'shb_hdrs',
                                                           'offset' => '50',
                                                           'type' => '591'
                                                         },
                                                  '6' => {
                                                           'name' => 'interface_data',
                                                           'offset' => '64',
                                                           'type' => '591'
                                                         },
                                                  '7' => {
                                                           'name' => 'next_interface_data',
                                                           'offset' => '72',
                                                           'type' => '310'
                                                         },
                                                  '8' => {
                                                           'name' => 'nrb_hdrs',
                                                           'offset' => '86',
                                                           'type' => '591'
                                                         },
                                                  '9' => {
                                                           'name' => 'dsbs',
                                                           'offset' => '100',
                                                           'type' => '591'
                                                         }
                                                },
                                      'Name' => 'struct wtap',
                                      'Size' => '168',
                                      'Type' => 'Struct'
                                    },
                          '378' => {
                                     'BaseType' => '366',
                                     'Name' => 'GArray const',
                                     'Size' => '16',
                                     'Type' => 'Const'
                                   },
                          '383' => {
                                     'Header' => 'garray.h',
                                     'Line' => '41',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '475'
                                                        },
                                                 '1' => {
                                                          'name' => 'len',
                                                          'offset' => '8',
                                                          'type' => '310'
                                                        }
                                               },
                                     'Name' => 'struct _GArray',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '3994' => {
                                      'BaseType' => '3682',
                                      'Name' => 'struct wtap*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4000' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '919',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ts',
                                                           'offset' => '0',
                                                           'type' => '213'
                                                         },
                                                  '1' => {
                                                           'name' => 'type',
                                                           'offset' => '8',
                                                           'type' => '134'
                                                         },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '9',
                                                           'type' => '134'
                                                         },
                                                  '3' => {
                                                           'name' => 'rlen',
                                                           'offset' => '16',
                                                           'type' => '165'
                                                         },
                                                  '4' => {
                                                           'name' => 'lctr',
                                                           'offset' => '18',
                                                           'type' => '165'
                                                         },
                                                  '5' => {
                                                           'name' => 'wlen',
                                                           'offset' => '20',
                                                           'type' => '165'
                                                         }
                                                },
                                      'Name' => 'struct erf_phdr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4098' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '928',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ehdr',
                                                           'offset' => '0',
                                                           'type' => '213'
                                                         }
                                                },
                                      'Name' => 'struct erf_ehdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4127' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '939',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'offset',
                                                           'offset' => '0',
                                                           'type' => '134'
                                                         },
                                                  '1' => {
                                                           'name' => 'pad',
                                                           'offset' => '1',
                                                           'type' => '134'
                                                         }
                                                },
                                      'Name' => 'struct wtap_erf_eth_hdr',
                                      'Size' => '2',
                                      'Type' => 'Struct'
                                    },
                          '4170' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '947',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'eth_hdr',
                                                           'offset' => '0',
                                                           'type' => '4127'
                                                         },
                                                  '1' => {
                                                           'name' => 'mc_hdr',
                                                           'offset' => '0',
                                                           'type' => '189'
                                                         },
                                                  '2' => {
                                                           'name' => 'aal2_hdr',
                                                           'offset' => '0',
                                                           'type' => '189'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-947',
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '4220' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '944',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'phdr',
                                                           'offset' => '0',
                                                           'type' => '4000'
                                                         },
                                                  '1' => {
                                                           'name' => 'ehdr_list',
                                                           'offset' => '22',
                                                           'type' => '4277'
                                                         },
                                                  '2' => {
                                                           'name' => 'subhdr',
                                                           'offset' => '324',
                                                           'type' => '4170'
                                                         }
                                                },
                                      'Name' => 'struct erf_mc_phdr',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '423' => {
                                     'BaseType' => '435',
                                     'Header' => 'garray.h',
                                     'Line' => '39',
                                     'Name' => 'GPtrArray',
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '4277' => {
                                      'BaseType' => '4098',
                                      'Name' => 'struct erf_ehdr[16]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '4293' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1010',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sita_flags',
                                                           'offset' => '0',
                                                           'type' => '134'
                                                         },
                                                  '1' => {
                                                           'name' => 'sita_signals',
                                                           'offset' => '1',
                                                           'type' => '134'
                                                         },
                                                  '2' => {
                                                           'name' => 'sita_errors1',
                                                           'offset' => '2',
                                                           'type' => '134'
                                                         },
                                                  '3' => {
                                                           'name' => 'sita_errors2',
                                                           'offset' => '3',
                                                           'type' => '134'
                                                         },
                                                  '4' => {
                                                           'name' => 'sita_proto',
                                                           'offset' => '4',
                                                           'type' => '134'
                                                         }
                                                },
                                      'Name' => 'struct sita_phdr',
                                      'Size' => '5',
                                      'Type' => 'Struct'
                                    },
                          '435' => {
                                     'Header' => 'garray.h',
                                     'Line' => '53',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'pdata',
                                                          'offset' => '0',
                                                          'type' => '487'
                                                        },
                                                 '1' => {
                                                          'name' => 'len',
                                                          'offset' => '8',
                                                          'type' => '310'
                                                        }
                                               },
                                     'Name' => 'struct _GPtrArray',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '4378' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1019',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '298'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '4',
                                                           'type' => '189'
                                                         }
                                                },
                                      'Name' => 'struct bthci_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4421' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1031',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'adapter_id',
                                                           'offset' => '0',
                                                           'type' => '165'
                                                         },
                                                  '1' => {
                                                           'name' => 'opcode',
                                                           'offset' => '2',
                                                           'type' => '165'
                                                         }
                                                },
                                      'Name' => 'struct btmon_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '4464' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1037',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'uton',
                                                           'offset' => '0',
                                                           'type' => '298'
                                                         }
                                                },
                                      'Name' => 'struct l1event_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '4493' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1042',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'is_event',
                                                           'offset' => '0',
                                                           'type' => '134'
                                                         },
                                                  '1' => {
                                                           'name' => 'bus',
                                                           'offset' => '1',
                                                           'type' => '134'
                                                         },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '4',
                                                           'type' => '189'
                                                         }
                                                },
                                      'Name' => 'struct i2c_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '45' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '4550' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1049',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'uplink',
                                                           'offset' => '0',
                                                           'type' => '298'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '4',
                                                           'type' => '134'
                                                         },
                                                  '2' => {
                                                           'name' => 'bsic',
                                                           'offset' => '5',
                                                           'type' => '134'
                                                         },
                                                  '3' => {
                                                           'name' => 'arfcn',
                                                           'offset' => '6',
                                                           'type' => '165'
                                                         },
                                                  '4' => {
                                                           'name' => 'tdma_frame',
                                                           'offset' => '8',
                                                           'type' => '189'
                                                         },
                                                  '5' => {
                                                           'name' => 'error',
                                                           'offset' => '18',
                                                           'type' => '134'
                                                         },
                                                  '6' => {
                                                           'name' => 'timeshift',
                                                           'offset' => '20',
                                                           'type' => '165'
                                                         }
                                                },
                                      'Name' => 'struct gsm_um_phdr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4663' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1071',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rec_offset',
                                                           'offset' => '0',
                                                           'type' => '201'
                                                         },
                                                  '1' => {
                                                           'name' => 'rec_len',
                                                           'offset' => '8',
                                                           'type' => '177'
                                                         },
                                                  '10' => {
                                                            'name' => 'vlantag_offset',
                                                            'offset' => '33',
                                                            'type' => '134'
                                                          },
                                                  '11' => {
                                                            'name' => 'coreid_offset',
                                                            'offset' => '34',
                                                            'type' => '134'
                                                          },
                                                  '12' => {
                                                            'name' => 'srcnodeid_offset',
                                                            'offset' => '35',
                                                            'type' => '134'
                                                          },
                                                  '13' => {
                                                            'name' => 'destnodeid_offset',
                                                            'offset' => '36',
                                                            'type' => '134'
                                                          },
                                                  '14' => {
                                                            'name' => 'clflags_offset',
                                                            'offset' => '37',
                                                            'type' => '134'
                                                          },
                                                  '15' => {
                                                            'name' => 'src_vmname_len_offset',
                                                            'offset' => '38',
                                                            'type' => '134'
                                                          },
                                                  '16' => {
                                                            'name' => 'dst_vmname_len_offset',
                                                            'offset' => '39',
                                                            'type' => '134'
                                                          },
                                                  '17' => {
                                                            'name' => 'ns_activity_offset',
                                                            'offset' => '40',
                                                            'type' => '134'
                                                          },
                                                  '18' => {
                                                            'name' => 'data_offset',
                                                            'offset' => '41',
                                                            'type' => '134'
                                                          },
                                                  '2' => {
                                                           'name' => 'nicno_offset',
                                                           'offset' => '18',
                                                           'type' => '134'
                                                         },
                                                  '3' => {
                                                           'name' => 'nicno_len',
                                                           'offset' => '19',
                                                           'type' => '134'
                                                         },
                                                  '4' => {
                                                           'name' => 'dir_offset',
                                                           'offset' => '20',
                                                           'type' => '134'
                                                         },
                                                  '5' => {
                                                           'name' => 'dir_len',
                                                           'offset' => '21',
                                                           'type' => '134'
                                                         },
                                                  '6' => {
                                                           'name' => 'eth_offset',
                                                           'offset' => '22',
                                                           'type' => '165'
                                                         },
                                                  '7' => {
                                                           'name' => 'pcb_offset',
                                                           'offset' => '24',
                                                           'type' => '134'
                                                         },
                                                  '8' => {
                                                           'name' => 'l_pcb_offset',
                                                           'offset' => '25',
                                                           'type' => '134'
                                                         },
                                                  '9' => {
                                                           'name' => 'rec_type',
                                                           'offset' => '32',
                                                           'type' => '134'
                                                         }
                                                },
                                      'Name' => 'struct nstr_phdr',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '475' => {
                                     'BaseType' => '269',
                                     'Name' => 'gchar*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '481' => {
                                     'BaseType' => '134',
                                     'Name' => 'guint8*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '487' => {
                                     'BaseType' => '341',
                                     'Name' => 'gpointer*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '4944' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1094',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'eth',
                                                           'offset' => '0',
                                                           'type' => '873'
                                                         },
                                                  '1' => {
                                                           'name' => 'stuff',
                                                           'offset' => '4',
                                                           'type' => '2183'
                                                         }
                                                },
                                      'Name' => 'struct nokia_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4987' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1100',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'adapter',
                                                           'offset' => '0',
                                                           'type' => '134'
                                                         },
                                                  '1' => {
                                                           'name' => 'flags',
                                                           'offset' => '1',
                                                           'type' => '134'
                                                         }
                                                },
                                      'Name' => 'struct llcp_phdr',
                                      'Size' => '2',
                                      'Type' => 'Struct'
                                    },
                          '50110' => {
                                       'BaseType' => '50122',
                                       'Header' => 'ghash.h',
                                       'Line' => '37',
                                       'Name' => 'GHashTable',
                                       'Type' => 'Typedef'
                                     },
                          '50122' => {
                                       'Name' => 'struct _GHashTable',
                                       'Type' => 'Struct'
                                     },
                          '50133' => {
                                       'BaseType' => '50110',
                                       'Name' => 'GHashTable*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '50290' => {
                                       'BaseType' => '134',
                                       'Name' => 'guint8[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '5030' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1106',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'version',
                                                           'offset' => '0',
                                                           'type' => '286'
                                                         }
                                                },
                                      'Name' => 'struct logcat_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '5059' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1117',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'eth',
                                                           'offset' => '0',
                                                           'type' => '873'
                                                         },
                                                  '1' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '974'
                                                         },
                                                  '2' => {
                                                           'name' => 'ieee_802_11',
                                                           'offset' => '0',
                                                           'type' => '2497'
                                                         }
                                                },
                                      'Name' => 'union sub_wtap_pseudo_header',
                                      'Size' => '72',
                                      'Type' => 'Union'
                                    },
                          '50590' => {
                                       'Header' => 'wtap_opttypes.h',
                                       'Line' => '296',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'WTAP_OPTTYPE_SUCCESS',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'WTAP_OPTTYPE_NO_SUCH_OPTION',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '2' => {
                                                            'name' => 'WTAP_OPTTYPE_NOT_FOUND',
                                                            'value' => '18446744073709551614 (-2)'
                                                          },
                                                   '3' => {
                                                            'name' => 'WTAP_OPTTYPE_TYPE_MISMATCH',
                                                            'value' => '18446744073709551613 (-3)'
                                                          },
                                                   '4' => {
                                                            'name' => 'WTAP_OPTTYPE_NUMBER_MISMATCH',
                                                            'value' => '18446744073709551612 (-4)'
                                                          },
                                                   '5' => {
                                                            'name' => 'WTAP_OPTTYPE_ALREADY_EXISTS',
                                                            'value' => '18446744073709551611 (-5)'
                                                          },
                                                   '6' => {
                                                            'name' => 'WTAP_OPTTYPE_BAD_BLOCK',
                                                            'value' => '18446744073709551610 (-6)'
                                                          }
                                                 },
                                       'Name' => 'enum wtap_opttype_return_val',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '507' => {
                                     'BaseType' => '519',
                                     'Header' => 'glist.h',
                                     'Line' => '37',
                                     'Name' => 'GList',
                                     'Size' => '24',
                                     'Type' => 'Typedef'
                                   },
                          '5113' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1112',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'title',
                                                           'offset' => '0',
                                                           'type' => '481'
                                                         },
                                                  '1' => {
                                                           'name' => 'descLength',
                                                           'offset' => '8',
                                                           'type' => '189'
                                                         },
                                                  '2' => {
                                                           'name' => 'description',
                                                           'offset' => '22',
                                                           'type' => '481'
                                                         },
                                                  '3' => {
                                                           'name' => 'sub_encap',
                                                           'offset' => '36',
                                                           'type' => '310'
                                                         },
                                                  '4' => {
                                                           'name' => 'subheader',
                                                           'offset' => '50',
                                                           'type' => '5059'
                                                         }
                                                },
                                      'Name' => 'struct netmon_phdr',
                                      'Size' => '104',
                                      'Type' => 'Struct'
                                    },
                          '519' => {
                                     'Header' => 'glist.h',
                                     'Line' => '39',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '341'
                                                        },
                                                 '1' => {
                                                          'name' => 'next',
                                                          'offset' => '8',
                                                          'type' => '572'
                                                        },
                                                 '2' => {
                                                          'name' => 'prev',
                                                          'offset' => '22',
                                                          'type' => '572'
                                                        }
                                               },
                                     'Name' => 'struct _GList',
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   },
                          '5198' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1125',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pathname',
                                                           'offset' => '0',
                                                           'type' => '90'
                                                         }
                                                },
                                      'Name' => 'struct ber_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '52' => {
                                    'BaseType' => '64',
                                    'Header' => 'stddef.h',
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '5227' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1129',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'eth',
                                                           'offset' => '0',
                                                           'type' => '873'
                                                         },
                                                  '1' => {
                                                           'name' => 'dte_dce',
                                                           'offset' => '0',
                                                           'type' => '902'
                                                         },
                                                  '10' => {
                                                            'name' => 'mtp2',
                                                            'offset' => '0',
                                                            'type' => '3247'
                                                          },
                                                  '11' => {
                                                            'name' => 'k12',
                                                            'offset' => '0',
                                                            'type' => '3405'
                                                          },
                                                  '12' => {
                                                            'name' => 'lapd',
                                                            'offset' => '0',
                                                            'type' => '3532'
                                                          },
                                                  '13' => {
                                                            'name' => 'dct2000',
                                                            'offset' => '0',
                                                            'type' => '3625'
                                                          },
                                                  '14' => {
                                                            'name' => 'erf',
                                                            'offset' => '0',
                                                            'type' => '4220'
                                                          },
                                                  '15' => {
                                                            'name' => 'sita',
                                                            'offset' => '0',
                                                            'type' => '4293'
                                                          },
                                                  '16' => {
                                                            'name' => 'bthci',
                                                            'offset' => '0',
                                                            'type' => '4378'
                                                          },
                                                  '17' => {
                                                            'name' => 'btmon',
                                                            'offset' => '0',
                                                            'type' => '4421'
                                                          },
                                                  '18' => {
                                                            'name' => 'l1event',
                                                            'offset' => '0',
                                                            'type' => '4464'
                                                          },
                                                  '19' => {
                                                            'name' => 'i2c',
                                                            'offset' => '0',
                                                            'type' => '4493'
                                                          },
                                                  '2' => {
                                                           'name' => 'isdn',
                                                           'offset' => '0',
                                                           'type' => '931'
                                                         },
                                                  '20' => {
                                                            'name' => 'gsm_um',
                                                            'offset' => '0',
                                                            'type' => '4550'
                                                          },
                                                  '21' => {
                                                            'name' => 'nstr',
                                                            'offset' => '0',
                                                            'type' => '4663'
                                                          },
                                                  '22' => {
                                                            'name' => 'nokia',
                                                            'offset' => '0',
                                                            'type' => '4944'
                                                          },
                                                  '23' => {
                                                            'name' => 'llcp',
                                                            'offset' => '0',
                                                            'type' => '4987'
                                                          },
                                                  '24' => {
                                                            'name' => 'logcat',
                                                            'offset' => '0',
                                                            'type' => '5030'
                                                          },
                                                  '25' => {
                                                            'name' => 'netmon',
                                                            'offset' => '0',
                                                            'type' => '5113'
                                                          },
                                                  '26' => {
                                                            'name' => 'ber',
                                                            'offset' => '0',
                                                            'type' => '5198'
                                                          },
                                                  '3' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '974'
                                                         },
                                                  '4' => {
                                                           'name' => 'ascend',
                                                           'offset' => '0',
                                                           'type' => '1157'
                                                         },
                                                  '5' => {
                                                           'name' => 'p2p',
                                                           'offset' => '0',
                                                           'type' => '1256'
                                                         },
                                                  '6' => {
                                                           'name' => 'ieee_802_11',
                                                           'offset' => '0',
                                                           'type' => '2497'
                                                         },
                                                  '7' => {
                                                           'name' => 'cosine',
                                                           'offset' => '0',
                                                           'type' => '2991'
                                                         },
                                                  '8' => {
                                                           'name' => 'irda',
                                                           'offset' => '0',
                                                           'type' => '3133'
                                                         },
                                                  '9' => {
                                                           'name' => 'nettl',
                                                           'offset' => '0',
                                                           'type' => '3162'
                                                         }
                                                },
                                      'Name' => 'union wtap_pseudo_header',
                                      'Size' => '152',
                                      'Type' => 'Union'
                                    },
                          '5674' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1227',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'caplen',
                                                           'offset' => '0',
                                                           'type' => '189'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '4',
                                                           'type' => '189'
                                                         },
                                                  '2' => {
                                                           'name' => 'pkt_encap',
                                                           'offset' => '8',
                                                           'type' => '78'
                                                         },
                                                  '3' => {
                                                           'name' => 'interface_id',
                                                           'offset' => '18',
                                                           'type' => '189'
                                                         },
                                                  '4' => {
                                                           'name' => 'pseudo_header',
                                                           'offset' => '22',
                                                           'type' => '5227'
                                                         }
                                                },
                                      'Name' => 'struct wtap_packet_header',
                                      'Size' => '168',
                                      'Type' => 'Struct'
                                    },
                          '572' => {
                                     'BaseType' => '507',
                                     'Name' => 'GList*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5726' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1303',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'record_type',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'name' => 'record_len',
                                                           'offset' => '4',
                                                           'type' => '189'
                                                         }
                                                },
                                      'Name' => 'struct wtap_ft_specific_header',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '578' => {
                                     'BaseType' => '475',
                                     'Name' => 'gchar**',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5876' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1317',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'record_type',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'name' => 'byte_order',
                                                           'offset' => '4',
                                                           'type' => '78'
                                                         },
                                                  '2' => {
                                                           'name' => 'timestamp',
                                                           'offset' => '8',
                                                           'type' => '213'
                                                         },
                                                  '3' => {
                                                           'name' => 'thread_id',
                                                           'offset' => '22',
                                                           'type' => '213'
                                                         },
                                                  '4' => {
                                                           'name' => 'event_len',
                                                           'offset' => '36',
                                                           'type' => '189'
                                                         },
                                                  '5' => {
                                                           'name' => 'event_filelen',
                                                           'offset' => '40',
                                                           'type' => '189'
                                                         },
                                                  '6' => {
                                                           'name' => 'event_type',
                                                           'offset' => '50',
                                                           'type' => '165'
                                                         },
                                                  '7' => {
                                                           'name' => 'nparams',
                                                           'offset' => '54',
                                                           'type' => '189'
                                                         },
                                                  '8' => {
                                                           'name' => 'cpu_id',
                                                           'offset' => '64',
                                                           'type' => '165'
                                                         }
                                                },
                                      'Name' => 'struct wtap_syscall_header',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '591' => {
                                     'BaseType' => '366',
                                     'Name' => 'GArray*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5914' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1321',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'record_len',
                                                           'offset' => '0',
                                                           'type' => '189'
                                                         }
                                                },
                                      'Name' => 'struct wtap_systemd_journal_export_header',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '5927' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1328',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '189'
                                                         },
                                                  '1' => {
                                                           'name' => 'skipped',
                                                           'offset' => '4',
                                                           'type' => '189'
                                                         }
                                                },
                                      'Name' => 'struct nflx',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '597' => {
                                     'BaseType' => '423',
                                     'Name' => 'GPtrArray*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5970' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1327',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'nflx_custom_data_header',
                                                           'offset' => '0',
                                                           'type' => '5927'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-1327',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '597106' => {
                                        'BaseType' => '245738',
                                        'Name' => 'ws_in6_addr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '59868' => {
                                       'BaseType' => '151',
                                       'Header' => 'zconf.h',
                                       'Line' => '391',
                                       'Name' => 'Byte',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '59881' => {
                                       'BaseType' => '45',
                                       'Header' => 'zconf.h',
                                       'Line' => '393',
                                       'Name' => 'uInt',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '59894' => {
                                       'BaseType' => '64',
                                       'Header' => 'zconf.h',
                                       'Line' => '394',
                                       'Name' => 'uLong',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '59907' => {
                                       'BaseType' => '59868',
                                       'Header' => 'zconf.h',
                                       'Line' => '400',
                                       'Name' => 'Bytef',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '59920' => {
                                       'BaseType' => '59907',
                                       'Name' => 'Bytef const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '59925' => {
                                       'BaseType' => '249',
                                       'Header' => 'zconf.h',
                                       'Line' => '409',
                                       'Name' => 'voidpf',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '59938' => {
                                       'BaseType' => '59950',
                                       'Header' => 'zlib.h',
                                       'Line' => '81',
                                       'Name' => 'alloc_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '59950' => {
                                       'Name' => 'voidpf(*)(voidpf, uInt, uInt)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '59925'
                                                           },
                                                    '1' => {
                                                             'type' => '59881'
                                                           },
                                                    '2' => {
                                                             'type' => '59881'
                                                           }
                                                  },
                                       'Return' => '59925',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '59981' => {
                                       'BaseType' => '59993',
                                       'Header' => 'zlib.h',
                                       'Line' => '82',
                                       'Name' => 'free_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '59993' => {
                                       'Name' => 'void(*)(voidpf, voidpf)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '59925'
                                                           },
                                                    '1' => {
                                                             'type' => '59925'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '60015' => {
                                       'Header' => 'zlib.h',
                                       'Line' => '86',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_in',
                                                            'offset' => '0',
                                                            'type' => '60211'
                                                          },
                                                   '1' => {
                                                            'name' => 'avail_in',
                                                            'offset' => '8',
                                                            'type' => '59881'
                                                          },
                                                   '10' => {
                                                             'name' => 'opaque',
                                                             'offset' => '128',
                                                             'type' => '59925'
                                                           },
                                                   '11' => {
                                                             'name' => 'data_type',
                                                             'offset' => '136',
                                                             'type' => '78'
                                                           },
                                                   '12' => {
                                                             'name' => 'adler',
                                                             'offset' => '150',
                                                             'type' => '59894'
                                                           },
                                                   '13' => {
                                                             'name' => 'reserved',
                                                             'offset' => '260',
                                                             'type' => '59894'
                                                           },
                                                   '2' => {
                                                            'name' => 'total_in',
                                                            'offset' => '22',
                                                            'type' => '59894'
                                                          },
                                                   '3' => {
                                                            'name' => 'next_out',
                                                            'offset' => '36',
                                                            'type' => '60217'
                                                          },
                                                   '4' => {
                                                            'name' => 'avail_out',
                                                            'offset' => '50',
                                                            'type' => '59881'
                                                          },
                                                   '5' => {
                                                            'name' => 'total_out',
                                                            'offset' => '64',
                                                            'type' => '59894'
                                                          },
                                                   '6' => {
                                                            'name' => 'msg',
                                                            'offset' => '72',
                                                            'type' => '90'
                                                          },
                                                   '7' => {
                                                            'name' => 'state',
                                                            'offset' => '86',
                                                            'type' => '60228'
                                                          },
                                                   '8' => {
                                                            'name' => 'zalloc',
                                                            'offset' => '100',
                                                            'type' => '59938'
                                                          },
                                                   '9' => {
                                                            'name' => 'zfree',
                                                            'offset' => '114',
                                                            'type' => '59981'
                                                          }
                                                 },
                                       'Name' => 'struct z_stream_s',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '60211' => {
                                       'BaseType' => '59920',
                                       'Name' => 'Bytef const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60217' => {
                                       'BaseType' => '59907',
                                       'Name' => 'Bytef*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60223' => {
                                       'Name' => 'struct internal_state',
                                       'Type' => 'Struct'
                                     },
                          '60228' => {
                                       'BaseType' => '60223',
                                       'Name' => 'struct internal_state*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60234' => {
                                       'BaseType' => '60015',
                                       'Header' => 'zlib.h',
                                       'Line' => '106',
                                       'Name' => 'z_stream',
                                       'Size' => '112',
                                       'Type' => 'Typedef'
                                     },
                          '603' => {
                                     'BaseType' => '251',
                                     'Name' => 'char**',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '6061' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1333',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'length',
                                                           'offset' => '0',
                                                           'type' => '189'
                                                         },
                                                  '1' => {
                                                           'name' => 'pen',
                                                           'offset' => '4',
                                                           'type' => '189'
                                                         },
                                                  '2' => {
                                                           'name' => 'copy_allowed',
                                                           'offset' => '8',
                                                           'type' => '298'
                                                         },
                                                  '3' => {
                                                           'name' => 'custom_data_header',
                                                           'offset' => '18',
                                                           'type' => '5970'
                                                         }
                                                },
                                      'Name' => 'struct wtap_custom_block_header',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '6074' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1343',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'packet_header',
                                                           'offset' => '0',
                                                           'type' => '5674'
                                                         },
                                                  '1' => {
                                                           'name' => 'ft_specific_header',
                                                           'offset' => '0',
                                                           'type' => '5726'
                                                         },
                                                  '2' => {
                                                           'name' => 'syscall_header',
                                                           'offset' => '0',
                                                           'type' => '5876'
                                                         },
                                                  '3' => {
                                                           'name' => 'systemd_journal_export_header',
                                                           'offset' => '0',
                                                           'type' => '5914'
                                                         },
                                                  '4' => {
                                                           'name' => 'custom_block_header',
                                                           'offset' => '0',
                                                           'type' => '6061'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-1343',
                                      'Size' => '168',
                                      'Type' => 'Union'
                                    },
                          '609' => {
                                     'Header' => 'buffer.h',
                                     'Line' => '21',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '481'
                                                        },
                                                 '1' => {
                                                          'name' => 'allocated',
                                                          'offset' => '8',
                                                          'type' => '225'
                                                        },
                                                 '2' => {
                                                          'name' => 'start',
                                                          'offset' => '22',
                                                          'type' => '225'
                                                        },
                                                 '3' => {
                                                          'name' => 'first_free',
                                                          'offset' => '36',
                                                          'type' => '225'
                                                        }
                                               },
                                     'Name' => 'struct Buffer',
                                     'Size' => '32',
                                     'Type' => 'Struct'
                                   },
                          '6272' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1359',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rec_type',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'name' => 'presence_flags',
                                                           'offset' => '4',
                                                           'type' => '189'
                                                         },
                                                  '2' => {
                                                           'name' => 'ts',
                                                           'offset' => '8',
                                                           'type' => '723'
                                                         },
                                                  '3' => {
                                                           'name' => 'tsprec',
                                                           'offset' => '36',
                                                           'type' => '78'
                                                         },
                                                  '4' => {
                                                           'name' => 'rec_header',
                                                           'offset' => '50',
                                                           'type' => '6074'
                                                         },
                                                  '5' => {
                                                           'name' => 'block',
                                                           'offset' => '512',
                                                           'type' => '735'
                                                         },
                                                  '6' => {
                                                           'name' => 'block_was_modified',
                                                           'offset' => '520',
                                                           'type' => '298'
                                                         },
                                                  '7' => {
                                                           'name' => 'options_buf',
                                                           'offset' => '534',
                                                           'type' => '675'
                                                         }
                                                },
                                      'Name' => 'struct wtap_rec',
                                      'Size' => '248',
                                      'Type' => 'Struct'
                                    },
                          '6285' => {
                                      'BaseType' => '6272',
                                      'Name' => 'wtap_rec const',
                                      'Size' => '248',
                                      'Type' => 'Const'
                                    },
                          '6290' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1408',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ipv4_addr_list',
                                                           'offset' => '0',
                                                           'type' => '572'
                                                         },
                                                  '1' => {
                                                           'name' => 'ipv6_addr_list',
                                                           'offset' => '8',
                                                           'type' => '572'
                                                         }
                                                },
                                      'Name' => 'struct addrinfo_lists',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6333' => {
                                      'BaseType' => '6290',
                                      'Header' => 'wtap.h',
                                      'Line' => '1411',
                                      'Name' => 'addrinfo_lists_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '6346' => {
                                      'BaseType' => '378',
                                      'Name' => 'GArray const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6352' => {
                                      'BaseType' => '3682',
                                      'Header' => 'wtap.h',
                                      'Line' => '1446',
                                      'Name' => 'wtap',
                                      'Size' => '168',
                                      'Type' => 'Typedef'
                                    },
                          '6365' => {
                                      'BaseType' => '6378',
                                      'Header' => 'wtap.h',
                                      'Line' => '1447',
                                      'Name' => 'wtap_dumper',
                                      'Size' => '136',
                                      'Type' => 'Typedef'
                                    },
                          '6378' => {
                                      'Header' => 'wtap-int.h',
                                      'Line' => '95',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fh',
                                                           'offset' => '0',
                                                           'type' => '7565'
                                                         },
                                                  '1' => {
                                                           'name' => 'file_type_subtype',
                                                           'offset' => '8',
                                                           'type' => '78'
                                                         },
                                                  '10' => {
                                                            'name' => 'subtype_write',
                                                            'offset' => '100',
                                                            'type' => '7631'
                                                          },
                                                  '11' => {
                                                            'name' => 'subtype_finish',
                                                            'offset' => '114',
                                                            'type' => '7696'
                                                          },
                                                  '12' => {
                                                            'name' => 'addrinfo_lists',
                                                            'offset' => '128',
                                                            'type' => '7739'
                                                          },
                                                  '13' => {
                                                            'name' => 'shb_hdrs',
                                                            'offset' => '136',
                                                            'type' => '591'
                                                          },
                                                  '14' => {
                                                            'name' => 'nrb_hdrs',
                                                            'offset' => '150',
                                                            'type' => '591'
                                                          },
                                                  '15' => {
                                                            'name' => 'interface_data',
                                                            'offset' => '260',
                                                            'type' => '591'
                                                          },
                                                  '16' => {
                                                            'name' => 'dsbs_initial',
                                                            'offset' => '274',
                                                            'type' => '591'
                                                          },
                                                  '17' => {
                                                            'name' => 'dsbs_growing',
                                                            'offset' => '288',
                                                            'type' => '6346'
                                                          },
                                                  '18' => {
                                                            'name' => 'dsbs_growing_written',
                                                            'offset' => '296',
                                                            'type' => '310'
                                                          },
                                                  '2' => {
                                                           'name' => 'snaplen',
                                                           'offset' => '18',
                                                           'type' => '78'
                                                         },
                                                  '3' => {
                                                           'name' => 'encap',
                                                           'offset' => '22',
                                                           'type' => '78'
                                                         },
                                                  '4' => {
                                                           'name' => 'compression_type',
                                                           'offset' => '32',
                                                           'type' => '7401'
                                                         },
                                                  '5' => {
                                                           'name' => 'needs_reload',
                                                           'offset' => '36',
                                                           'type' => '298'
                                                         },
                                                  '6' => {
                                                           'name' => 'bytes_dumped',
                                                           'offset' => '50',
                                                           'type' => '201'
                                                         },
                                                  '7' => {
                                                           'name' => 'priv',
                                                           'offset' => '64',
                                                           'type' => '249'
                                                         },
                                                  '8' => {
                                                           'name' => 'wslua_data',
                                                           'offset' => '72',
                                                           'type' => '249'
                                                         },
                                                  '9' => {
                                                           'name' => 'subtype_add_idb',
                                                           'offset' => '86',
                                                           'type' => '7577'
                                                         }
                                                },
                                      'Name' => 'struct wtap_dumper',
                                      'Size' => '136',
                                      'Type' => 'Struct'
                                    },
                          '64' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '642646' => {
                                        'BaseType' => '310',
                                        'Name' => 'guint*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '6638' => {
                                      'BaseType' => '6651',
                                      'Header' => 'wtap.h',
                                      'Line' => '1449',
                                      'Name' => 'FILE_T',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6651' => {
                                      'BaseType' => '6657',
                                      'Name' => 'struct wtap_reader*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6657' => {
                                      'Line' => '168',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fd',
                                                           'offset' => '0',
                                                           'type' => '78'
                                                         },
                                                  '1' => {
                                                           'name' => 'raw_pos',
                                                           'offset' => '8',
                                                           'type' => '201'
                                                         },
                                                  '10' => {
                                                            'name' => 'last_compression',
                                                            'offset' => '264',
                                                            'type' => '980837'
                                                          },
                                                  '11' => {
                                                            'name' => 'is_compressed',
                                                            'offset' => '274',
                                                            'type' => '298'
                                                          },
                                                  '12' => {
                                                            'name' => 'skip',
                                                            'offset' => '288',
                                                            'type' => '201'
                                                          },
                                                  '13' => {
                                                            'name' => 'seek_pending',
                                                            'offset' => '296',
                                                            'type' => '298'
                                                          },
                                                  '14' => {
                                                            'name' => 'err',
                                                            'offset' => '306',
                                                            'type' => '78'
                                                          },
                                                  '15' => {
                                                            'name' => 'err_info',
                                                            'offset' => '310',
                                                            'type' => '90'
                                                          },
                                                  '16' => {
                                                            'name' => 'strm',
                                                            'offset' => '324',
                                                            'type' => '60234'
                                                          },
                                                  '17' => {
                                                            'name' => 'dont_check_crc',
                                                            'offset' => '598',
                                                            'type' => '298'
                                                          },
                                                  '18' => {
                                                            'name' => 'fast_seek',
                                                            'offset' => '612',
                                                            'type' => '597'
                                                          },
                                                  '19' => {
                                                            'name' => 'fast_seek_cur',
                                                            'offset' => '626',
                                                            'type' => '249'
                                                          },
                                                  '2' => {
                                                           'name' => 'pos',
                                                           'offset' => '22',
                                                           'type' => '201'
                                                         },
                                                  '20' => {
                                                            'name' => 'zstd_dctx',
                                                            'offset' => '640',
                                                            'type' => '980902'
                                                          },
                                                  '21' => {
                                                            'name' => 'lz4_dctx',
                                                            'offset' => '648',
                                                            'type' => '980632'
                                                          },
                                                  '3' => {
                                                           'name' => 'size',
                                                           'offset' => '36',
                                                           'type' => '310'
                                                         },
                                                  '4' => {
                                                           'name' => 'in',
                                                           'offset' => '50',
                                                           'type' => '980849'
                                                         },
                                                  '5' => {
                                                           'name' => 'out',
                                                           'offset' => '86',
                                                           'type' => '980849'
                                                         },
                                                  '6' => {
                                                           'name' => 'eof',
                                                           'offset' => '128',
                                                           'type' => '298'
                                                         },
                                                  '7' => {
                                                           'name' => 'start',
                                                           'offset' => '136',
                                                           'type' => '201'
                                                         },
                                                  '8' => {
                                                           'name' => 'raw',
                                                           'offset' => '150',
                                                           'type' => '201'
                                                         },
                                                  '9' => {
                                                           'name' => 'compression',
                                                           'offset' => '260',
                                                           'type' => '980837'
                                                         }
                                                },
                                      'Name' => 'struct wtap_reader',
                                      'Size' => '296',
                                      'Source' => 'file_wrappers.c',
                                      'Type' => 'Struct'
                                    },
                          '6662' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1462',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wslua_can_write_encap',
                                                           'offset' => '0',
                                                           'type' => '6725'
                                                         },
                                                  '1' => {
                                                           'name' => 'wslua_data',
                                                           'offset' => '8',
                                                           'type' => '249'
                                                         }
                                                },
                                      'Name' => 'struct wtap_wslua_file_info',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6725' => {
                                      'Name' => 'int(*)(int, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '78'
                                                          },
                                                   '1' => {
                                                            'type' => '249'
                                                          }
                                                 },
                                      'Return' => '78',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6731' => {
                                      'BaseType' => '6662',
                                      'Header' => 'wtap.h',
                                      'Line' => '1465',
                                      'Name' => 'wtap_wslua_file_info_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '675' => {
                                     'BaseType' => '609',
                                     'Header' => 'buffer.h',
                                     'Line' => '26',
                                     'Name' => 'Buffer',
                                     'Size' => '32',
                                     'Type' => 'Typedef'
                                   },
                          '6778' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1526',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WTAP_OPEN_NOT_MINE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WTAP_OPEN_MINE',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'WTAP_OPEN_ERROR',
                                                           'value' => '18446744073709551615 (-1)'
                                                         }
                                                },
                                      'Name' => 'enum wtap_open_return_val',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6791' => {
                                      'BaseType' => '78',
                                      'Name' => 'int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6831' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1585',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'OPTION_NOT_SUPPORTED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ONE_OPTION_SUPPORTED',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'MULTIPLE_OPTIONS_SUPPORTED',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum option_support_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6844' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1590',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'opt',
                                                           'offset' => '0',
                                                           'type' => '310'
                                                         },
                                                  '1' => {
                                                           'name' => 'support',
                                                           'offset' => '4',
                                                           'type' => '6831'
                                                         }
                                                },
                                      'Name' => 'struct supported_option_type',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '6887' => {
                                      'BaseType' => '6844',
                                      'Name' => 'struct supported_option_type const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '6926' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1609',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'BLOCK_NOT_SUPPORTED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ONE_BLOCK_SUPPORTED',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'MULTIPLE_BLOCKS_SUPPORTED',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum block_support_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6939' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1614',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '845'
                                                         },
                                                  '1' => {
                                                           'name' => 'support',
                                                           'offset' => '4',
                                                           'type' => '6926'
                                                         },
                                                  '2' => {
                                                           'name' => 'num_supported_options',
                                                           'offset' => '8',
                                                           'type' => '52'
                                                         },
                                                  '3' => {
                                                           'name' => 'supported_options',
                                                           'offset' => '22',
                                                           'type' => '7015'
                                                         }
                                                },
                                      'Name' => 'struct supported_block_type',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '7010' => {
                                      'BaseType' => '6939',
                                      'Name' => 'struct supported_block_type const',
                                      'Size' => '24',
                                      'Type' => 'Const'
                                    },
                          '7015' => {
                                      'BaseType' => '6887',
                                      'Name' => 'struct supported_option_type const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7021' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1624',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'description',
                                                           'offset' => '0',
                                                           'type' => '90'
                                                         },
                                                  '1' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '90'
                                                         },
                                                  '2' => {
                                                           'name' => 'default_file_extension',
                                                           'offset' => '22',
                                                           'type' => '90'
                                                         },
                                                  '3' => {
                                                           'name' => 'additional_file_extensions',
                                                           'offset' => '36',
                                                           'type' => '90'
                                                         },
                                                  '4' => {
                                                           'name' => 'writing_must_seek',
                                                           'offset' => '50',
                                                           'type' => '298'
                                                         },
                                                  '5' => {
                                                           'name' => 'num_supported_blocks',
                                                           'offset' => '64',
                                                           'type' => '52'
                                                         },
                                                  '6' => {
                                                           'name' => 'supported_blocks',
                                                           'offset' => '72',
                                                           'type' => '7181'
                                                         },
                                                  '7' => {
                                                           'name' => 'can_write_encap',
                                                           'offset' => '86',
                                                           'type' => '7202'
                                                         },
                                                  '8' => {
                                                           'name' => 'dump_open',
                                                           'offset' => '100',
                                                           'type' => '7239'
                                                         },
                                                  '9' => {
                                                           'name' => 'wslua_info',
                                                           'offset' => '114',
                                                           'type' => '7245'
                                                         }
                                                },
                                      'Name' => 'struct file_type_subtype_info',
                                      'Size' => '80',
                                      'Type' => 'Struct'
                                    },
                          '71' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '7176' => {
                                      'BaseType' => '7021',
                                      'Name' => 'struct file_type_subtype_info const',
                                      'Size' => '80',
                                      'Type' => 'Const'
                                    },
                          '7181' => {
                                      'BaseType' => '7010',
                                      'Name' => 'struct supported_block_type const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7202' => {
                                      'Name' => 'int(*)(int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '78'
                                                          }
                                                 },
                                      'Return' => '78',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '723' => {
                                     'Header' => 'nstime.h',
                                     'Line' => '31',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'secs',
                                                          'offset' => '0',
                                                          'type' => '257'
                                                        },
                                                 '1' => {
                                                          'name' => 'nsecs',
                                                          'offset' => '8',
                                                          'type' => '78'
                                                        }
                                               },
                                     'Name' => 'struct nstime_t',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '7233' => {
                                      'BaseType' => '6365',
                                      'Name' => 'wtap_dumper*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7239' => {
                                      'Name' => 'int(*)(wtap_dumper*, int*, gchar**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7233'
                                                          },
                                                   '1' => {
                                                            'type' => '6791'
                                                          },
                                                   '2' => {
                                                            'type' => '578'
                                                          }
                                                 },
                                      'Return' => '78',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7245' => {
                                      'BaseType' => '6731',
                                      'Name' => 'wtap_wslua_file_info_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7251' => {
                                      'BaseType' => '7264',
                                      'Header' => 'wtap.h',
                                      'Line' => '1706',
                                      'Name' => 'wtap_new_ipv4_callback_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7264' => {
                                      'Name' => 'void(*)(guint const, gchar const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '322'
                                                          },
                                                   '1' => {
                                                            'type' => '360'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7286' => {
                                      'BaseType' => '7299',
                                      'Header' => 'wtap.h',
                                      'Line' => '1710',
                                      'Name' => 'wtap_new_ipv6_callback_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7299' => {
                                      'Name' => 'void(*)(void const*, gchar const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '353'
                                                          },
                                                   '1' => {
                                                            'type' => '360'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7321' => {
                                      'BaseType' => '7334',
                                      'Header' => 'wtap.h',
                                      'Line' => '1718',
                                      'Name' => 'wtap_new_secrets_callback_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7334' => {
                                      'Name' => 'void(*)(guint32, void const*, guint)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '189'
                                                          },
                                                   '1' => {
                                                            'type' => '353'
                                                          },
                                                   '2' => {
                                                            'type' => '310'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '735' => {
                                     'BaseType' => '747',
                                     'Header' => 'wtap_opttypes.h',
                                     'Line' => '142',
                                     'Name' => 'wtap_block_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '7401' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1781',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WTAP_UNCOMPRESSED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WTAP_GZIP_COMPRESSED',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'WTAP_ZSTD_COMPRESSED',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'WTAP_LZ4_COMPRESSED',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum wtap_compression_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7414' => {
                                      'BaseType' => '7426',
                                      'Header' => 'wtap-int.h',
                                      'Line' => '29',
                                      'Name' => 'subtype_read_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7426' => {
                                      'Name' => 'gboolean(*)(struct wtap*, wtap_rec*, Buffer*, int*, char**, gint64*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3994'
                                                          },
                                                   '1' => {
                                                            'type' => '7472'
                                                          },
                                                   '2' => {
                                                            'type' => '7478'
                                                          },
                                                   '3' => {
                                                            'type' => '6791'
                                                          },
                                                   '4' => {
                                                            'type' => '603'
                                                          },
                                                   '5' => {
                                                            'type' => '7484'
                                                          }
                                                 },
                                      'Return' => '298',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '747' => {
                                     'BaseType' => '753',
                                     'Name' => 'struct wtap_block*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '7472' => {
                                      'BaseType' => '6272',
                                      'Name' => 'wtap_rec*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7478' => {
                                      'BaseType' => '675',
                                      'Name' => 'Buffer*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7484' => {
                                      'BaseType' => '201',
                                      'Name' => 'gint64*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7490' => {
                                      'BaseType' => '7502',
                                      'Header' => 'wtap-int.h',
                                      'Line' => '31',
                                      'Name' => 'subtype_seek_read_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7502' => {
                                      'Name' => 'gboolean(*)(struct wtap*, gint64, wtap_rec*, Buffer*, int*, char**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '3994'
                                                          },
                                                   '1' => {
                                                            'type' => '201'
                                                          },
                                                   '2' => {
                                                            'type' => '7472'
                                                          },
                                                   '3' => {
                                                            'type' => '7478'
                                                          },
                                                   '4' => {
                                                            'type' => '6791'
                                                          },
                                                   '5' => {
                                                            'type' => '603'
                                                          }
