$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '11.2.0',
          'Headers' => {
                         'buffer.h' => 1,
                         'file_wrappers.h' => 1,
                         'garray.h' => 1,
                         'ghash.h' => 1,
                         'glibconfig.h' => 1,
                         'glist.h' => 1,
                         'gslist.h' => 1,
                         'gtypes.h' => 1,
                         'inet_ipv4.h' => 1,
                         'inet_ipv6.h' => 1,
                         'lz4frame.h' => 1,
                         'merge.h' => 1,
                         'nstime.h' => 1,
                         'pcap-encap.h' => 1,
                         'pcapng_module.h' => 1,
                         'stddef.h' => 1,
                         'struct_stat.h' => 1,
                         'struct_timespec.h' => 1,
                         'time_t.h' => 1,
                         'types.h' => 1,
                         'wtap-int.h' => 1,
                         'wtap.h' => 1,
                         'wtap_opttypes.h' => 1,
                         'zconf.h' => 1,
                         'zlib.h' => 1,
                         'zstd.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libwiretap.so.13.0.0',
          'LibraryVersion' => '13.0.0',
          'NameSpaces' => {},

                                                     'wtap_name_to_encap' => 1,
                                                     'wtap_name_to_file_type_subtype' => 1,
                                                     'wtap_open_offline' => 1,
                                                     'wtap_opttypes_cleanup' => 1,
                                                     'wtap_opttypes_initialize' => 1,
                                                     'wtap_packet_verdict_free' => 1,
                                                     'wtap_pcap_encap_to_wtap_encap' => 1,
                                                     'wtap_pcap_file_type_subtype' => 1,
                                                     'wtap_pcap_nsec_file_type_subtype' => 1,
                                                     'wtap_pcapng_file_type_subtype' => 1,
                                                     'wtap_plugins_supported' => 1,
                                                     'wtap_read' => 1,
                                                     'wtap_read_bytes' => 1,
                                                     'wtap_read_bytes_or_eof' => 1,
                                                     'wtap_read_packet_bytes' => 1,
                                                     'wtap_read_so_far' => 1,
                                                     'wtap_rec_cleanup' => 1,
                                                     'wtap_rec_init' => 1,
                                                     'wtap_rec_reset' => 1,
                                                     'wtap_register_encap_type' => 1,
                                                     'wtap_register_file_type_extension' => 1,
                                                     'wtap_register_file_type_subtype' => 1,
                                                     'wtap_register_open_info' => 1,
                                                     'wtap_register_plugin' => 1,
                                                     'wtap_seek_read' => 1,
                                                     'wtap_sequential_close' => 1,
                                                     'wtap_set_bytes_dumped' => 1,
                                                     'wtap_set_cb_new_ipv4' => 1,
                                                     'wtap_set_cb_new_ipv6' => 1,
                                                     'wtap_set_cb_new_secrets' => 1,
                                                     'wtap_snapshot_length' => 1,
                                                     'wtap_strerror' => 1,
                                                     'wtap_tsprec_string' => 1,
                                                     'wtap_uses_lua_filehandler' => 1,
                                                     'wtap_write_shb_comment' => 1
                                                   }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1006705' => {
                                         'BaseType' => '752',
                                         'Name' => 'wtap_block_t const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '1013324' => {
                                         'Header' => 'merge.h',
                                         'Line' => '25',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'RECORD_PRESENT',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'RECORD_NOT_PRESENT',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'AT_EOF',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'GOT_ERROR',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum in_file_state_e',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1013336' => {
                                         'Header' => 'merge.h',
                                         'Line' => '30',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'filename',
                                                              'offset' => '0',
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'name' => 'wth',
                                                              'offset' => '8',
                                                              'type' => '8760'
                                                            },
                                                     '2' => {
                                                              'name' => 'rec',
                                                              'offset' => '22',
                                                              'type' => '6304'
                                                            },
                                                     '3' => {
                                                              'name' => 'frame_buffer',
                                                              'offset' => '626',
                                                              'type' => '692'
                                                            },
                                                     '4' => {
                                                              'name' => 'state',
                                                              'offset' => '772',
                                                              'type' => '1013324'
                                                            },
                                                     '5' => {
                                                              'name' => 'packet_num',
                                                              'offset' => '776',
                                                              'type' => '223'
                                                            },
                                                     '6' => {
                                                              'name' => 'size',
                                                              'offset' => '786',
                                                              'type' => '235'
                                                            },
                                                     '7' => {
                                                              'name' => 'idb_index_map',
                                                              'offset' => '800',
                                                              'type' => '591'
                                                            },
                                                     '8' => {
                                                              'name' => 'dsbs_seen',
                                                              'offset' => '808',
                                                              'type' => '324'
                                                            }
                                                   },
                                         'Name' => 'struct merge_in_file_s',
                                         'Size' => '336',
                                         'Type' => 'Struct'
                                       },
                          '1013480' => {
                                         'BaseType' => '1013336',
                                         'Header' => 'merge.h',
                                         'Line' => '40',
                                         'Name' => 'merge_in_file_t',
                                         'Size' => '336',
                                         'Type' => 'Typedef'
                                       },
                          '1013492' => {
                                         'BaseType' => '1013480',
                                         'Name' => 'merge_in_file_t const',
                                         'Size' => '336',
                                         'Type' => 'Const'
                                       },
                          '1013566' => {
                                         'Header' => 'merge.h',
                                         'Line' => '54',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MERGE_OK',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MERGE_USER_ABORTED',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MERGE_ERR_CANT_OPEN_INFILE',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MERGE_ERR_CANT_OPEN_OUTFILE',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'MERGE_ERR_CANT_READ_INFILE',
                                                              'value' => '4'
                                                            },
                                                     '5' => {
                                                              'name' => 'MERGE_ERR_BAD_PHDR_INTERFACE_ID',
                                                              'value' => '5'
                                                            },
                                                     '6' => {
                                                              'name' => 'MERGE_ERR_CANT_WRITE_OUTFILE',
                                                              'value' => '6'
                                                            },
                                                     '7' => {
                                                              'name' => 'MERGE_ERR_CANT_CLOSE_OUTFILE',
                                                              'value' => '7'
                                                            },
                                                     '8' => {
                                                              'name' => 'MERGE_ERR_INVALID_OPTION',
                                                              'value' => '8'
                                                            }
                                                   },
                                         'Name' => 'enum merge_result',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1013623' => {
                                         'Header' => 'merge.h',
                                         'Line' => '64',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'MERGE_EVENT_INPUT_FILES_OPENED',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'MERGE_EVENT_FRAME_TYPE_SELECTED',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'MERGE_EVENT_READY_TO_MERGE',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'MERGE_EVENT_RECORD_WAS_READ',
                                                              'value' => '3'
                                                            },
                                                     '4' => {
                                                              'name' => 'MERGE_EVENT_DONE',
                                                              'value' => '4'
                                                            }
                                                   },
                                         'Name' => 'enum merge_event',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1013674' => {
                                         'Header' => 'merge.h',
                                         'Line' => '73',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'IDB_MERGE_MODE_NONE',
                                                              'value' => '0'
                                                            },
                                                     '1' => {
                                                              'name' => 'IDB_MERGE_MODE_ALL_SAME',
                                                              'value' => '1'
                                                            },
                                                     '2' => {
                                                              'name' => 'IDB_MERGE_MODE_ANY_SAME',
                                                              'value' => '2'
                                                            },
                                                     '3' => {
                                                              'name' => 'IDB_MERGE_MODE_MAX',
                                                              'value' => '3'
                                                            }
                                                   },
                                         'Name' => 'enum idb_merge_mode',
                                         'Size' => '4',
                                         'Type' => 'Enum'
                                       },
                          '1013686' => {
                                         'BaseType' => '1013674',
                                         'Name' => 'idb_merge_mode const',
                                         'Size' => '4',
                                         'Type' => 'Const'
                                       },
                          '1013762' => {
                                         'BaseType' => '1013492',
                                         'Name' => 'merge_in_file_t const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1013768' => {
                                         'Name' => 'gboolean(*)(merge_event, int, merge_in_file_t const*, guint const, void*)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '1013623'
                                                             },
                                                      '1' => {
                                                               'type' => '78'
                                                             },
                                                      '2' => {
                                                               'type' => '1013762'
                                                             },
                                                      '3' => {
                                                               'type' => '336'
                                                             },
                                                      '4' => {
                                                               'type' => '148'
                                                             }
                                                    },
                                         'Return' => '312',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1013774' => {
                                         'Header' => 'merge.h',
                                         'Line' => '113',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'callback_func',
                                                              'offset' => '0',
                                                              'type' => '1013768'
                                                            },
                                                     '1' => {
                                                              'name' => 'data',
                                                              'offset' => '8',
                                                              'type' => '148'
                                                            }
                                                   },
                                         'Name' => 'struct merge_progress_callback_t',
                                         'Size' => '16',
                                         'Type' => 'Struct'
                                       },
                          '1015868' => {
                                         'BaseType' => '98023',
                                         'Name' => 'char const*const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1015874' => {
                                         'BaseType' => '1013774',
                                         'Name' => 'merge_progress_callback_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '103' => {
                                     'BaseType' => '96',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '1038731' => {
                                         'Header' => 'wtap.h',
                                         'Line' => '2256',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'register_wtap_module',
                                                              'offset' => '0',
                                                              'type' => '954639'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_plugin',
                                         'Size' => '8',
                                         'Type' => 'Struct'
                                       },
                          '1038744' => {
                                         'BaseType' => '1038731',
                                         'Name' => 'wtap_plugin const',
                                         'Size' => '8',
                                         'Type' => 'Const'
                                       },
                          '1045967' => {
                                         'BaseType' => '961694',
                                         'Name' => 'wtap_dump_params*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1050782' => {
                                         'BaseType' => '1038744',
                                         'Name' => 'wtap_plugin const*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1054589' => {
                                         'BaseType' => '1054602',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '523',
                                         'Name' => 'wtap_block_create_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1054602' => {
                                         'Name' => 'void(*)(wtap_block_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '752'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1054619' => {
                                         'BaseType' => '1054602',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '524',
                                         'Name' => 'wtap_mand_free_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1054632' => {
                                         'BaseType' => '1054645',
                                         'Header' => 'wtap_opttypes.h',
                                         'Line' => '525',
                                         'Name' => 'wtap_mand_copy_func',
                                         'Size' => '8',
                                         'Type' => 'Typedef'
                                       },
                          '1054645' => {
                                         'Name' => 'void(*)(wtap_block_t, wtap_block_t)',
                                         'Param' => {
                                                      '0' => {
                                                               'type' => '752'
                                                             },
                                                      '1' => {
                                                               'type' => '752'
                                                             }
                                                    },
                                         'Return' => '1',
                                         'Size' => '8',
                                         'Type' => 'FuncPtr'
                                       },
                          '1054840' => {
                                         'Line' => '43',
                                         'Memb' => {
                                                     '0' => {
                                                              'name' => 'block_type',
                                                              'offset' => '0',
                                                              'type' => '862'
                                                            },
                                                     '1' => {
                                                              'name' => 'name',
                                                              'offset' => '8',
                                                              'type' => '90'
                                                            },
                                                     '2' => {
                                                              'name' => 'description',
                                                              'offset' => '22',
                                                              'type' => '90'
                                                            },
                                                     '3' => {
                                                              'name' => 'create',
                                                              'offset' => '36',
                                                              'type' => '1054589'
                                                            },
                                                     '4' => {
                                                              'name' => 'free_mand',
                                                              'offset' => '50',
                                                              'type' => '1054619'
                                                            },
                                                     '5' => {
                                                              'name' => 'copy_mand',
                                                              'offset' => '64',
                                                              'type' => '1054632'
                                                            },
                                                     '6' => {
                                                              'name' => 'options',
                                                              'offset' => '72',
                                                              'type' => '50307'
                                                            }
                                                   },
                                         'Name' => 'struct wtap_blocktype_t',
                                         'Size' => '56',
                                         'Source' => 'wtap_opttypes.c',
                                         'Type' => 'Struct'
                                       },
                          '1054931' => {
                                         'BaseType' => '1054840',
                                         'Name' => 'wtap_blocktype_t*',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '1063633' => {
                                         'BaseType' => '249544',
                                         'Name' => 'GBytes**',
                                         'Size' => '8',
                                         'Type' => 'Pointer'
                                       },
                          '108' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '115' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1174' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '484',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '199'
                                                         },
                                                  '1' => {
                                                           'name' => 'user',
                                                           'offset' => '2',
                                                           'type' => '874'
                                                         },
                                                  '2' => {
                                                           'name' => 'sess',
                                                           'offset' => '104',
                                                           'type' => '223'
                                                         },
                                                  '3' => {
                                                           'name' => 'call_num',
                                                           'offset' => '114',
                                                           'type' => '874'
                                                         },
                                                  '4' => {
                                                           'name' => 'chunk',
                                                           'offset' => '310',
                                                           'type' => '223'
                                                         },
                                                  '5' => {
                                                           'name' => 'task',
                                                           'offset' => '320',
                                                           'type' => '223'
                                                         }
                                                },
                                      'Name' => 'struct ascend_phdr',
                                      'Size' => '144',
                                      'Type' => 'Struct'
                                    },
                          '120845' => {
                                        'BaseType' => '247',
                                        'Name' => 'guint64*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1273' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '494',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '312'
                                                         }
                                                },
                                      'Name' => 'struct p2p_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '129' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1302' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '547',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_set',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_pattern',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_hop_index',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '3' => {
                                                           'name' => 'hop_set',
                                                           'offset' => '1',
                                                           'type' => '182'
                                                         },
                                                  '4' => {
                                                           'name' => 'hop_pattern',
                                                           'offset' => '2',
                                                           'type' => '182'
                                                         },
                                                  '5' => {
                                                           'name' => 'hop_index',
                                                           'offset' => '3',
                                                           'type' => '182'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11_fhss',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '136' => {
                                     'BaseType' => '129',
                                     'Header' => 'types.h',
                                     'Line' => '160',
                                     'Name' => '__time_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1410' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '560',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_preamble',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'name' => 'short_preamble',
                                                           'offset' => '4',
                                                           'type' => '312'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11b',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '1456' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '570',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_channel_type',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_turbo_type',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '2',
                                                           'name' => 'channel_type',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '2',
                                                           'name' => 'turbo_type',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11a',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '145920' => {
                                        'BaseType' => '223',
                                        'Name' => 'guint32*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '148' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '150' => {
                                     'BaseType' => '96',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1539' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '606',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mode',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'name' => 'mode',
                                                           'offset' => '4',
                                                           'type' => '223'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11g',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '1585' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '622',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bandwidth',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'greenfield',
                                                            'offset' => '8',
                                                            'type' => '324'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'fec',
                                                            'offset' => '8',
                                                            'type' => '324'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '2',
                                                            'name' => 'stbc_streams',
                                                            'offset' => '8',
                                                            'type' => '324'
                                                          },
                                                  '13' => {
                                                            'name' => 'ness',
                                                            'offset' => '18',
                                                            'type' => '324'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_greenfield',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_fec',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_stbc_streams',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_ness',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '7' => {
                                                           'name' => 'mcs_index',
                                                           'offset' => '2',
                                                           'type' => '199'
                                                         },
                                                  '8' => {
                                                           'name' => 'bandwidth',
                                                           'offset' => '4',
                                                           'type' => '324'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'short_gi',
                                                           'offset' => '8',
                                                           'type' => '324'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11n',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '170' => {
                                     'BaseType' => '115',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '42',
                                     'Name' => 'gint8',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '182' => {
                                     'BaseType' => '108',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '43',
                                     'Name' => 'guint8',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '1829' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '674',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_stbc',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_txop_ps_not_allowed',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'stbc',
                                                            'offset' => '0',
                                                            'type' => '324'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'txop_ps_not_allowed',
                                                            'offset' => '0',
                                                            'type' => '324'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'short_gi',
                                                            'offset' => '0',
                                                            'type' => '324'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'short_gi_nsym_disambig',
                                                            'offset' => '0',
                                                            'type' => '324'
                                                          },
                                                  '14' => {
                                                            'bitfield' => '1',
                                                            'name' => 'ldpc_extra_ofdm_symbol',
                                                            'offset' => '0',
                                                            'type' => '324'
                                                          },
                                                  '15' => {
                                                            'bitfield' => '1',
                                                            'name' => 'beamformed',
                                                            'offset' => '0',
                                                            'type' => '324'
                                                          },
                                                  '16' => {
                                                            'name' => 'bandwidth',
                                                            'offset' => '2',
                                                            'type' => '182'
                                                          },
                                                  '17' => {
                                                            'name' => 'mcs',
                                                            'offset' => '3',
                                                            'type' => '2200'
                                                          },
                                                  '18' => {
                                                            'name' => 'nss',
                                                            'offset' => '7',
                                                            'type' => '2200'
                                                          },
                                                  '19' => {
                                                            'name' => 'fec',
                                                            'offset' => '17',
                                                            'type' => '182'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '20' => {
                                                            'name' => 'group_id',
                                                            'offset' => '18',
                                                            'type' => '182'
                                                          },
                                                  '21' => {
                                                            'name' => 'partial_aid',
                                                            'offset' => '20',
                                                            'type' => '199'
                                                          },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_short_gi_nsym_disambig',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_ldpc_extra_ofdm_symbol',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_beamformed',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bandwidth',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '7' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_fec',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_group_id',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_partial_aid',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ac',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '194' => {
                                     'BaseType' => '182',
                                     'Name' => 'guint8 const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '199' => {
                                     'BaseType' => '71',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '46',
                                     'Name' => 'guint16',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '211' => {
                                     'BaseType' => '78',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '53',
                                     'Name' => 'gint32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2200' => {
                                      'BaseType' => '182',
                                      'Name' => 'guint8[4]',
                                      'Size' => '4',
                                      'Type' => 'Array'
                                    },
                          '2216' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '715',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'name' => 'mcs',
                                                           'offset' => '1',
                                                           'type' => '182'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ad',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '223' => {
                                     'BaseType' => '45',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '54',
                                     'Name' => 'guint32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '22460' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '145',
                                       'Name' => '__dev_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22472' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '146',
                                       'Name' => '__uid_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '22484' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '147',
                                       'Name' => '__gid_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '22496' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '148',
                                       'Name' => '__ino_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22508' => {
                                       'BaseType' => '45',
                                       'Header' => 'types.h',
                                       'Line' => '150',
                                       'Name' => '__mode_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '22520' => {
                                       'BaseType' => '64',
                                       'Header' => 'types.h',
                                       'Line' => '151',
                                       'Name' => '__nlink_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22532' => {
                                       'BaseType' => '129',
                                       'Header' => 'types.h',
                                       'Line' => '152',
                                       'Name' => '__off_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22558' => {
                                       'BaseType' => '129',
                                       'Header' => 'types.h',
                                       'Line' => '175',
                                       'Name' => '__blksize_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22570' => {
                                       'BaseType' => '129',
                                       'Header' => 'types.h',
                                       'Line' => '180',
                                       'Name' => '__blkcnt_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22582' => {
                                       'BaseType' => '129',
                                       'Header' => 'types.h',
                                       'Line' => '197',
                                       'Name' => '__syscall_slong_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '2262' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '725',
                                      'Memb' => {
                                                  '0' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_mcs_index',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_bwru',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_gi',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '3' => {
                                                           'bitfield' => '4',
                                                           'name' => 'nsts',
                                                           'offset' => '0',
                                                           'type' => '182'
                                                         },
                                                  '4' => {
                                                           'bitfield' => '4',
                                                           'name' => 'mcs',
                                                           'offset' => '1',
                                                           'type' => '182'
                                                         },
                                                  '5' => {
                                                           'bitfield' => '4',
                                                           'name' => 'bwru',
                                                           'offset' => '1',
                                                           'type' => '182'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '2',
                                                           'name' => 'gi',
                                                           'offset' => '2',
                                                           'type' => '182'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11ax',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '22757' => {
                                       'Header' => 'struct_timespec.h',
                                       'Line' => '11',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tv_sec',
                                                            'offset' => '0',
                                                            'type' => '136'
                                                          },
                                                   '1' => {
                                                            'name' => 'tv_nsec',
                                                            'offset' => '8',
                                                            'type' => '22582'
                                                          }
                                                 },
                                       'Name' => 'struct timespec',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '235' => {
                                     'BaseType' => '129',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '63',
                                     'Name' => 'gint64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '2395' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '737',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'info_11_fhss',
                                                           'offset' => '0',
                                                           'type' => '1302'
                                                         },
                                                  '1' => {
                                                           'name' => 'info_11b',
                                                           'offset' => '0',
                                                           'type' => '1410'
                                                         },
                                                  '2' => {
                                                           'name' => 'info_11a',
                                                           'offset' => '0',
                                                           'type' => '1456'
                                                         },
                                                  '3' => {
                                                           'name' => 'info_11g',
                                                           'offset' => '0',
                                                           'type' => '1539'
                                                         },
                                                  '4' => {
                                                           'name' => 'info_11n',
                                                           'offset' => '0',
                                                           'type' => '1585'
                                                         },
                                                  '5' => {
                                                           'name' => 'info_11ac',
                                                           'offset' => '0',
                                                           'type' => '1829'
                                                         },
                                                  '6' => {
                                                           'name' => 'info_11ad',
                                                           'offset' => '0',
                                                           'type' => '2216'
                                                         },
                                                  '7' => {
                                                           'name' => 'info_11ax',
                                                           'offset' => '0',
                                                           'type' => '2262'
                                                         }
                                                },
                                      'Name' => 'union ieee_802_11_phy_info',
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '247' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '64',
                                     'Name' => 'guint64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '249121' => {
                                        'BaseType' => '249133',
                                        'Header' => 'garray.h',
                                        'Line' => '36',
                                        'Name' => 'GBytes',
                                        'Type' => 'Typedef'
                                      },
                          '249133' => {
                                        'Name' => 'struct _GBytes',
                                        'Type' => 'Struct'
                                      },
                          '249195' => {
                                        'BaseType' => '249207',
                                        'Header' => 'garray.h',
                                        'Line' => '38',
                                        'Name' => 'GByteArray',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '249207' => {
                                        'Header' => 'garray.h',
                                        'Line' => '47',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'data',
                                                             'offset' => '0',
                                                             'type' => '495'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '324'
                                                           }
                                                  },
                                        'Name' => 'struct _GByteArray',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '249544' => {
                                        'BaseType' => '249121',
                                        'Name' => 'GBytes*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '249562' => {
                                        'BaseType' => '249195',
                                        'Name' => 'GByteArray*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '249729' => {
                                        'BaseType' => '223',
                                        'Header' => 'inet_ipv4.h',
                                        'Line' => '15',
                                        'Name' => 'ws_in4_addr',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '249741' => {
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '20',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bytes',
                                                             'offset' => '0',
                                                             'type' => '50480'
                                                           }
                                                  },
                                        'Name' => 'struct e_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '249784' => {
                                        'BaseType' => '249741',
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '22',
                                        'Name' => 'ws_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '250098' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '286',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT8',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT32',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'WTAP_OPTTYPE_UINT64',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'WTAP_OPTTYPE_STRING',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'WTAP_OPTTYPE_BYTES',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'WTAP_OPTTYPE_IPv4',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'WTAP_OPTTYPE_IPv6',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'WTAP_OPTTYPE_CUSTOM',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => 'WTAP_OPTTYPE_IF_FILTER',
                                                             'value' => '8'
                                                           },
                                                    '9' => {
                                                             'name' => 'WTAP_OPTTYPE_PACKET_VERDICT',
                                                             'value' => '9'
                                                           }
                                                  },
                                        'Name' => 'enum wtap_opttype_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '250182' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '309',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'custom_data_len',
                                                             'offset' => '0',
                                                             'type' => '259'
                                                           },
                                                    '1' => {
                                                             'name' => 'custom_data',
                                                             'offset' => '8',
                                                             'type' => '489'
                                                           }
                                                  },
                                        'Name' => 'struct generic_custom_opt_data',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '250225' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '313',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '223'
                                                           },
                                                    '1' => {
                                                             'name' => 'custom_data_len',
                                                             'offset' => '8',
                                                             'type' => '259'
                                                           },
                                                    '2' => {
                                                             'name' => 'custom_data',
                                                             'offset' => '22',
                                                             'type' => '489'
                                                           },
                                                    '3' => {
                                                             'name' => 'use_little_endian',
                                                             'offset' => '36',
                                                             'type' => '312'
                                                           }
                                                  },
                                        'Name' => 'struct nflx_custom_opt_data',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '250296' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '308',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'generic_data',
                                                             'offset' => '0',
                                                             'type' => '250182'
                                                           },
                                                    '1' => {
                                                             'name' => 'nflx_data',
                                                             'offset' => '0',
                                                             'type' => '250225'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-308',
                                        'Size' => '32',
                                        'Type' => 'Union'
                                      },
                          '250333' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '306',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pen',
                                                             'offset' => '0',
                                                             'type' => '223'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '250296'
                                                           }
                                                  },
                                        'Name' => 'struct custom_opt_s',
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '250376' => {
                                        'BaseType' => '250333',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '320',
                                        'Name' => 'custom_opt_t',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '250389' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '335',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'code',
                                                             'offset' => '0',
                                                             'type' => '199'
                                                           },
                                                    '1' => {
                                                             'name' => 'jt',
                                                             'offset' => '2',
                                                             'type' => '182'
                                                           },
                                                    '2' => {
                                                             'name' => 'jf',
                                                             'offset' => '3',
                                                             'type' => '182'
                                                           },
                                                    '3' => {
                                                             'name' => 'k',
                                                             'offset' => '4',
                                                             'type' => '223'
                                                           }
                                                  },
                                        'Name' => 'struct wtap_bpf_insn_s',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '250456' => {
                                        'BaseType' => '250389',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '340',
                                        'Name' => 'wtap_bpf_insn_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '250497' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '348',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'if_filter_pcap',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'if_filter_bpf',
                                                             'value' => '1'
                                                           }
                                                  },
                                        'Name' => 'enum if_filter_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '250510' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '354',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bpf_prog_len',
                                                             'offset' => '0',
                                                             'type' => '324'
                                                           },
                                                    '1' => {
                                                             'name' => 'bpf_prog',
                                                             'offset' => '8',
                                                             'type' => '250553'
                                                           }
                                                  },
                                        'Name' => 'struct wtap_bpf_insns',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '250553' => {
                                        'BaseType' => '250456',
                                        'Name' => 'wtap_bpf_insn_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '250559' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '352',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'filter_str',
                                                             'offset' => '0',
                                                             'type' => '489'
                                                           },
                                                    '1' => {
                                                             'name' => 'bpf_prog',
                                                             'offset' => '0',
                                                             'type' => '250510'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-352',
                                        'Size' => '16',
                                        'Type' => 'Union'
                                      },
                          '250596' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '350',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '250497'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '250559'
                                                           }
                                                  },
                                        'Name' => 'struct if_filter_opt_s',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '250639' => {
                                        'BaseType' => '250596',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '359',
                                        'Name' => 'if_filter_opt_t',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '250686' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '370',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'packet_verdict_hardware',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'packet_verdict_linux_ebpf_tc',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'packet_verdict_linux_ebpf_xdp',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum packet_verdict_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '250699' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '374',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'verdict_bytes',
                                                             'offset' => '0',
                                                             'type' => '249562'
                                                           },
                                                    '1' => {
                                                             'name' => 'verdict_linux_ebpf_tc',
                                                             'offset' => '0',
                                                             'type' => '247'
                                                           },
                                                    '2' => {
                                                             'name' => 'verdict_linux_ebpf_xdp',
                                                             'offset' => '0',
                                                             'type' => '247'
                                                           }
                                                  },
                                        'Name' => 'anon-union-wtap_opttypes.h-374',
                                        'Size' => '8',
                                        'Type' => 'Union'
                                      },
                          '250749' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '372',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '250686'
                                                           },
                                                    '1' => {
                                                             'name' => 'data',
                                                             'offset' => '8',
                                                             'type' => '250699'
                                                           }
                                                  },
                                        'Name' => 'struct packet_verdict_opt_s',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '250792' => {
                                        'BaseType' => '250749',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '379',
                                        'Name' => 'packet_verdict_opt_t',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '250946' => {
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '395',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'uint8val',
                                                             'offset' => '0',
                                                             'type' => '182'
                                                           },
                                                    '1' => {
                                                             'name' => 'uint32val',
                                                             'offset' => '0',
                                                             'type' => '223'
                                                           },
                                                    '2' => {
                                                             'name' => 'uint64val',
                                                             'offset' => '0',
                                                             'type' => '247'
                                                           },
                                                    '3' => {
                                                             'name' => 'ipv4val',
                                                             'offset' => '0',
                                                             'type' => '249729'
                                                           },
                                                    '4' => {
                                                             'name' => 'ipv6val',
                                                             'offset' => '0',
                                                             'type' => '249784'
                                                           },
                                                    '5' => {
                                                             'name' => 'stringval',
                                                             'offset' => '0',
                                                             'type' => '150'
                                                           },
                                                    '6' => {
                                                             'name' => 'byteval',
                                                             'offset' => '0',
                                                             'type' => '249544'
                                                           },
                                                    '7' => {
                                                             'name' => 'custom_opt',
                                                             'offset' => '0',
                                                             'type' => '250376'
                                                           },
                                                    '8' => {
                                                             'name' => 'if_filterval',
                                                             'offset' => '0',
                                                             'type' => '250639'
                                                           },
                                                    '9' => {
                                                             'name' => 'packet_verdictval',
                                                             'offset' => '0',
                                                             'type' => '250792'
                                                           }
                                                  },
                                        'Name' => 'union wtap_optval_t',
                                        'Size' => '40',
                                        'Type' => 'Union'
                                      },
                          '250975' => {
                                        'BaseType' => '250988',
                                        'Header' => 'wtap_opttypes.h',
                                        'Line' => '1090',
                                        'Name' => 'wtap_block_foreach_func',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '250988' => {
                                        'Name' => 'gboolean(*)(wtap_block_t, guint, wtap_opttype_e, wtap_optval_t*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '752'
                                                            },
                                                     '1' => {
                                                              'type' => '324'
                                                            },
                                                     '2' => {
                                                              'type' => '250098'
                                                            },
                                                     '3' => {
                                                              'type' => '251029'
                                                            },
                                                     '4' => {
                                                              'type' => '148'
                                                            }
                                                   },
                                        'Return' => '312',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '251029' => {
                                        'BaseType' => '250946',
                                        'Name' => 'wtap_optval_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2514' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '748',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fcs_len',
                                                           'offset' => '0',
                                                           'type' => '300'
                                                         },
                                                  '1' => {
                                                           'bitfield' => '1',
                                                           'name' => 'decrypted',
                                                           'offset' => '4',
                                                           'type' => '324'
                                                         },
                                                  '10' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_percent',
                                                            'offset' => '40',
                                                            'type' => '324'
                                                          },
                                                  '11' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_signal_dbm',
                                                            'offset' => '40',
                                                            'type' => '324'
                                                          },
                                                  '12' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_dbm',
                                                            'offset' => '40',
                                                            'type' => '324'
                                                          },
                                                  '13' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_signal_db',
                                                            'offset' => '40',
                                                            'type' => '324'
                                                          },
                                                  '14' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_noise_db',
                                                            'offset' => '40',
                                                            'type' => '324'
                                                          },
                                                  '15' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_tsf_timestamp',
                                                            'offset' => '40',
                                                            'type' => '324'
                                                          },
                                                  '16' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_aggregate_info',
                                                            'offset' => '40',
                                                            'type' => '324'
                                                          },
                                                  '17' => {
                                                            'bitfield' => '1',
                                                            'name' => 'has_zero_length_psdu_type',
                                                            'offset' => '40',
                                                            'type' => '324'
                                                          },
                                                  '18' => {
                                                            'name' => 'channel',
                                                            'offset' => '48',
                                                            'type' => '199'
                                                          },
                                                  '19' => {
                                                            'name' => 'frequency',
                                                            'offset' => '50',
                                                            'type' => '223'
                                                          },
                                                  '2' => {
                                                           'bitfield' => '1',
                                                           'name' => 'datapad',
                                                           'offset' => '4',
                                                           'type' => '324'
                                                         },
                                                  '20' => {
                                                            'name' => 'data_rate',
                                                            'offset' => '54',
                                                            'type' => '199'
                                                          },
                                                  '21' => {
                                                            'name' => 'signal_percent',
                                                            'offset' => '56',
                                                            'type' => '182'
                                                          },
                                                  '22' => {
                                                            'name' => 'noise_percent',
                                                            'offset' => '57',
                                                            'type' => '182'
                                                          },
                                                  '23' => {
                                                            'name' => 'signal_dbm',
                                                            'offset' => '64',
                                                            'type' => '170'
                                                          },
                                                  '24' => {
                                                            'name' => 'noise_dbm',
                                                            'offset' => '65',
                                                            'type' => '170'
                                                          },
                                                  '25' => {
                                                            'name' => 'signal_db',
                                                            'offset' => '66',
                                                            'type' => '182'
                                                          },
                                                  '26' => {
                                                            'name' => 'noise_db',
                                                            'offset' => '67',
                                                            'type' => '182'
                                                          },
                                                  '27' => {
                                                            'name' => 'tsf_timestamp',
                                                            'offset' => '72',
                                                            'type' => '247'
                                                          },
                                                  '28' => {
                                                            'name' => 'aggregate_flags',
                                                            'offset' => '86',
                                                            'type' => '223'
                                                          },
                                                  '29' => {
                                                            'name' => 'aggregate_id',
                                                            'offset' => '96',
                                                            'type' => '223'
                                                          },
                                                  '3' => {
                                                           'bitfield' => '1',
                                                           'name' => 'no_a_msdus',
                                                           'offset' => '4',
                                                           'type' => '324'
                                                         },
                                                  '30' => {
                                                            'name' => 'zero_length_psdu_type',
                                                            'offset' => '100',
                                                            'type' => '182'
                                                          },
                                                  '4' => {
                                                           'name' => 'phy',
                                                           'offset' => '8',
                                                           'type' => '324'
                                                         },
                                                  '5' => {
                                                           'name' => 'phy_info',
                                                           'offset' => '18',
                                                           'type' => '2395'
                                                         },
                                                  '6' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_channel',
                                                           'offset' => '40',
                                                           'type' => '324'
                                                         },
                                                  '7' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_frequency',
                                                           'offset' => '40',
                                                           'type' => '324'
                                                         },
                                                  '8' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_data_rate',
                                                           'offset' => '40',
                                                           'type' => '324'
                                                         },
                                                  '9' => {
                                                           'bitfield' => '1',
                                                           'name' => 'has_signal_percent',
                                                           'offset' => '40',
                                                           'type' => '324'
                                                         }
                                                },
                                      'Name' => 'struct ieee_802_11_phdr',
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '259' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '80',
                                     'Name' => 'gsize',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '259824' => {
                                        'BaseType' => '250639',
                                        'Name' => 'if_filter_opt_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '271' => {
                                     'BaseType' => '136',
                                     'Header' => 'time_t.h',
                                     'Line' => '10',
                                     'Name' => 'time_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '283' => {
                                     'BaseType' => '96',
                                     'Header' => 'gtypes.h',
                                     'Line' => '46',
                                     'Name' => 'gchar',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '295' => {
                                     'BaseType' => '283',
                                     'Name' => 'gchar const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '29943' => {
                                       'Header' => 'struct_stat.h',
                                       'Line' => '26',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'st_dev',
                                                            'offset' => '0',
                                                            'type' => '22460'
                                                          },
                                                   '1' => {
                                                            'name' => 'st_ino',
                                                            'offset' => '8',
                                                            'type' => '22496'
                                                          },
                                                   '10' => {
                                                             'name' => 'st_blocks',
                                                             'offset' => '100',
                                                             'type' => '22570'
                                                           },
                                                   '11' => {
                                                             'name' => 'st_atim',
                                                             'offset' => '114',
                                                             'type' => '22757'
                                                           },
                                                   '12' => {
                                                             'name' => 'st_mtim',
                                                             'offset' => '136',
                                                             'type' => '22757'
                                                           },
                                                   '13' => {
                                                             'name' => 'st_ctim',
                                                             'offset' => '260',
                                                             'type' => '22757'
                                                           },
                                                   '14' => {
                                                             'name' => '__glibc_reserved',
                                                             'offset' => '288',
                                                             'type' => '30152'
                                                           },
                                                   '2' => {
                                                            'name' => 'st_nlink',
                                                            'offset' => '22',
                                                            'type' => '22520'
                                                          },
                                                   '3' => {
                                                            'name' => 'st_mode',
                                                            'offset' => '36',
                                                            'type' => '22508'
                                                          },
                                                   '4' => {
                                                            'name' => 'st_uid',
                                                            'offset' => '40',
                                                            'type' => '22472'
                                                          },
                                                   '5' => {
                                                            'name' => 'st_gid',
                                                            'offset' => '50',
                                                            'type' => '22484'
                                                          },
                                                   '6' => {
                                                            'name' => '__pad0',
                                                            'offset' => '54',
                                                            'type' => '78'
                                                          },
                                                   '7' => {
                                                            'name' => 'st_rdev',
                                                            'offset' => '64',
                                                            'type' => '22460'
                                                          },
                                                   '8' => {
                                                            'name' => 'st_size',
                                                            'offset' => '72',
                                                            'type' => '22532'
                                                          },
                                                   '9' => {
                                                            'name' => 'st_blksize',
                                                            'offset' => '86',
                                                            'type' => '22558'
                                                          }
                                                 },
                                       'Name' => 'struct stat',
                                       'Size' => '144',
                                       'Type' => 'Struct'
                                     },
                          '300' => {
                                     'BaseType' => '78',
                                     'Header' => 'gtypes.h',
                                     'Line' => '49',
                                     'Name' => 'gint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '3008' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '816',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'encap',
                                                           'offset' => '0',
                                                           'type' => '182'
                                                         },
                                                  '1' => {
                                                           'name' => 'direction',
                                                           'offset' => '1',
                                                           'type' => '182'
                                                         },
                                                  '2' => {
                                                           'name' => 'if_name',
                                                           'offset' => '2',
                                                           'type' => '3134'
                                                         },
                                                  '3' => {
                                                           'name' => 'pro',
                                                           'offset' => '304',
                                                           'type' => '199'
                                                         },
                                                  '4' => {
                                                           'name' => 'off',
                                                           'offset' => '306',
                                                           'type' => '199'
                                                         },
                                                  '5' => {
                                                           'name' => 'pri',
                                                           'offset' => '308',
                                                           'type' => '199'
                                                         },
                                                  '6' => {
                                                           'name' => 'rm',
                                                           'offset' => '310',
                                                           'type' => '199'
                                                         },
                                                  '7' => {
                                                           'name' => 'err',
                                                           'offset' => '312',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct cosine_phdr',
                                      'Size' => '140',
                                      'Type' => 'Struct'
                                    },
                          '30152' => {
                                       'BaseType' => '22582',
                                       'Name' => '__syscall_slong_t[3]',
                                       'Size' => '24',
                                       'Type' => 'Array'
                                     },
                          '312' => {
                                     'BaseType' => '300',
                                     'Header' => 'gtypes.h',
                                     'Line' => '50',
                                     'Name' => 'gboolean',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '3134' => {
                                      'BaseType' => '96',
                                      'Name' => 'char[128]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '31362' => {
                                       'BaseType' => '29943',
                                       'Name' => 'struct stat*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3150' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '848',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pkttype',
                                                           'offset' => '0',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct irda_phdr',
                                      'Size' => '2',
                                      'Type' => 'Struct'
                                    },
                          '3179' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '854',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'subsys',
                                                           'offset' => '0',
                                                           'type' => '199'
                                                         },
                                                  '1' => {
                                                           'name' => 'devid',
                                                           'offset' => '4',
                                                           'type' => '223'
                                                         },
                                                  '2' => {
                                                           'name' => 'kind',
                                                           'offset' => '8',
                                                           'type' => '223'
                                                         },
                                                  '3' => {
                                                           'name' => 'pid',
                                                           'offset' => '18',
                                                           'type' => '211'
                                                         },
                                                  '4' => {
                                                           'name' => 'uid',
                                                           'offset' => '22',
                                                           'type' => '223'
                                                         }
                                                },
                                      'Name' => 'struct nettl_phdr',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '324' => {
                                     'BaseType' => '45',
                                     'Header' => 'gtypes.h',
                                     'Line' => '55',
                                     'Name' => 'guint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '3264' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '868',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '182'
                                                         },
                                                  '1' => {
                                                           'name' => 'annex_a_used',
                                                           'offset' => '1',
                                                           'type' => '182'
                                                         },
                                                  '2' => {
                                                           'name' => 'link_number',
                                                           'offset' => '2',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct mtp2_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '3321' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '877',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'vp',
                                                           'offset' => '0',
                                                           'type' => '199'
                                                         },
                                                  '1' => {
                                                           'name' => 'vc',
                                                           'offset' => '2',
                                                           'type' => '199'
                                                         },
                                                  '2' => {
                                                           'name' => 'cid',
                                                           'offset' => '4',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'anon-struct-wtap.h-877',
                                      'Size' => '6',
                                      'Type' => 'Struct'
                                    },
                          '336' => {
                                     'BaseType' => '324',
                                     'Name' => 'guint const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '3409' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '884',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '3321'
                                                         },
                                                  '1' => {
                                                           'name' => 'ds0mask',
                                                           'offset' => '0',
                                                           'type' => '223'
                                                         }
                                                },
                                      'Name' => 'union k12_input_info_t',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '3422' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '886',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'input',
                                                           'offset' => '0',
                                                           'type' => '223'
                                                         },
                                                  '1' => {
                                                           'name' => 'input_name',
                                                           'offset' => '8',
                                                           'type' => '374'
                                                         },
                                                  '2' => {
                                                           'name' => 'stack_file',
                                                           'offset' => '22',
                                                           'type' => '374'
                                                         },
                                                  '3' => {
                                                           'name' => 'input_type',
                                                           'offset' => '36',
                                                           'type' => '223'
                                                         },
                                                  '4' => {
                                                           'name' => 'input_info',
                                                           'offset' => '40',
                                                           'type' => '3409'
                                                         },
                                                  '5' => {
                                                           'name' => 'extra_info',
                                                           'offset' => '64',
                                                           'type' => '495'
                                                         },
                                                  '6' => {
                                                           'name' => 'extra_length',
                                                           'offset' => '72',
                                                           'type' => '223'
                                                         },
                                                  '7' => {
                                                           'name' => 'stuff',
                                                           'offset' => '86',
                                                           'type' => '148'
                                                         }
                                                },
                                      'Name' => 'struct k12_phdr',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '3549' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '901',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pkttype',
                                                           'offset' => '0',
                                                           'type' => '199'
                                                         },
                                                  '1' => {
                                                           'name' => 'we_network',
                                                           'offset' => '2',
                                                           'type' => '182'
                                                         }
                                                },
                                      'Name' => 'struct lapd_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '355' => {
                                     'BaseType' => '148',
                                     'Header' => 'gtypes.h',
                                     'Line' => '103',
                                     'Name' => 'gpointer',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '3592' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '909',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'isdn',
                                                           'offset' => '0',
                                                           'type' => '948'
                                                         },
                                                  '1' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '991'
                                                         },
                                                  '2' => {
                                                           'name' => 'p2p',
                                                           'offset' => '0',
                                                           'type' => '1273'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-909',
                                      'Size' => '28',
                                      'Type' => 'Union'
                                    },
                          '3642' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '907',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'inner_pseudo_header',
                                                           'offset' => '0',
                                                           'type' => '3592'
                                                         },
                                                  '1' => {
                                                           'name' => 'seek_off',
                                                           'offset' => '50',
                                                           'type' => '235'
                                                         },
                                                  '2' => {
                                                           'name' => 'wth',
                                                           'offset' => '64',
                                                           'type' => '4011'
                                                         }
                                                },
                                      'Name' => 'struct catapult_dct2000_phdr',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '367' => {
                                     'BaseType' => '373',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '3699' => {
                                      'Header' => 'wtap-int.h',
                                      'Line' => '36',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fh',
                                                           'offset' => '0',
                                                           'type' => '6670'
                                                         },
                                                  '1' => {
                                                           'name' => 'random_fh',
                                                           'offset' => '8',
                                                           'type' => '6670'
                                                         },
                                                  '10' => {
                                                            'name' => 'pathname',
                                                            'offset' => '114',
                                                            'type' => '150'
                                                          },
                                                  '11' => {
                                                            'name' => 'priv',
                                                            'offset' => '128',
                                                            'type' => '148'
                                                          },
                                                  '12' => {
                                                            'name' => 'wslua_data',
                                                            'offset' => '136',
                                                            'type' => '148'
                                                          },
                                                  '13' => {
                                                            'name' => 'subtype_read',
                                                            'offset' => '150',
                                                            'type' => '7452'
                                                          },
                                                  '14' => {
                                                            'name' => 'subtype_seek_read',
                                                            'offset' => '260',
                                                            'type' => '7528'
                                                          },
                                                  '15' => {
                                                            'name' => 'subtype_sequential_close',
                                                            'offset' => '274',
                                                            'type' => '7597'
                                                          },
                                                  '16' => {
                                                            'name' => 'subtype_close',
                                                            'offset' => '288',
                                                            'type' => '7597'
                                                          },
                                                  '17' => {
                                                            'name' => 'file_encap',
                                                            'offset' => '296',
                                                            'type' => '78'
                                                          },
                                                  '18' => {
                                                            'name' => 'file_tsprec',
                                                            'offset' => '306',
                                                            'type' => '78'
                                                          },
                                                  '19' => {
                                                            'name' => 'add_new_ipv4',
                                                            'offset' => '310',
                                                            'type' => '7289'
                                                          },
                                                  '2' => {
                                                           'name' => 'ispipe',
                                                           'offset' => '22',
                                                           'type' => '312'
                                                         },
                                                  '20' => {
                                                            'name' => 'add_new_ipv6',
                                                            'offset' => '324',
                                                            'type' => '7324'
                                                          },
                                                  '21' => {
                                                            'name' => 'add_new_secrets',
                                                            'offset' => '338',
                                                            'type' => '7359'
                                                          },
                                                  '22' => {
                                                            'name' => 'fast_seek',
                                                            'offset' => '352',
                                                            'type' => '597'
                                                          },
                                                  '3' => {
                                                           'name' => 'file_type_subtype',
                                                           'offset' => '32',
                                                           'type' => '78'
                                                         },
                                                  '4' => {
                                                           'name' => 'snapshot_length',
                                                           'offset' => '36',
                                                           'type' => '324'
                                                         },
                                                  '5' => {
                                                           'name' => 'shb_hdrs',
                                                           'offset' => '50',
                                                           'type' => '591'
                                                         },
                                                  '6' => {
                                                           'name' => 'interface_data',
                                                           'offset' => '64',
                                                           'type' => '591'
                                                         },
                                                  '7' => {
                                                           'name' => 'next_interface_data',
                                                           'offset' => '72',
                                                           'type' => '324'
                                                         },
                                                  '8' => {
                                                           'name' => 'nrb_hdrs',
                                                           'offset' => '86',
                                                           'type' => '591'
                                                         },
                                                  '9' => {
                                                           'name' => 'dsbs',
                                                           'offset' => '100',
                                                           'type' => '591'
                                                         }
                                                },
                                      'Name' => 'struct wtap',
                                      'Size' => '168',
                                      'Type' => 'Struct'
                                    },
                          '373' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '374' => {
                                     'BaseType' => '295',
                                     'Name' => 'gchar const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '380' => {
                                     'BaseType' => '397',
                                     'Header' => 'garray.h',
                                     'Line' => '37',
                                     'Name' => 'GArray',
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '392' => {
                                     'BaseType' => '380',
                                     'Name' => 'GArray const',
                                     'Size' => '16',
                                     'Type' => 'Const'
                                   },
                          '397' => {
                                     'Header' => 'garray.h',
                                     'Line' => '41',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '489'
                                                        },
                                                 '1' => {
                                                          'name' => 'len',
                                                          'offset' => '8',
                                                          'type' => '324'
                                                        }
                                               },
                                     'Name' => 'struct _GArray',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '4011' => {
                                      'BaseType' => '3699',
                                      'Name' => 'struct wtap*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4017' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '922',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ts',
                                                           'offset' => '0',
                                                           'type' => '247'
                                                         },
                                                  '1' => {
                                                           'name' => 'type',
                                                           'offset' => '8',
                                                           'type' => '182'
                                                         },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '9',
                                                           'type' => '182'
                                                         },
                                                  '3' => {
                                                           'name' => 'rlen',
                                                           'offset' => '16',
                                                           'type' => '199'
                                                         },
                                                  '4' => {
                                                           'name' => 'lctr',
                                                           'offset' => '18',
                                                           'type' => '199'
                                                         },
                                                  '5' => {
                                                           'name' => 'wlen',
                                                           'offset' => '20',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct erf_phdr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4115' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '931',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ehdr',
                                                           'offset' => '0',
                                                           'type' => '247'
                                                         }
                                                },
                                      'Name' => 'struct erf_ehdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4144' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '942',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'offset',
                                                           'offset' => '0',
                                                           'type' => '182'
                                                         },
                                                  '1' => {
                                                           'name' => 'pad',
                                                           'offset' => '1',
                                                           'type' => '182'
                                                         }
                                                },
                                      'Name' => 'struct wtap_erf_eth_hdr',
                                      'Size' => '2',
                                      'Type' => 'Struct'
                                    },
                          '4187' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '950',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'eth_hdr',
                                                           'offset' => '0',
                                                           'type' => '4144'
                                                         },
                                                  '1' => {
                                                           'name' => 'mc_hdr',
                                                           'offset' => '0',
                                                           'type' => '223'
                                                         },
                                                  '2' => {
                                                           'name' => 'aal2_hdr',
                                                           'offset' => '0',
                                                           'type' => '223'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-950',
                                      'Size' => '4',
                                      'Type' => 'Union'
                                    },
                          '4237' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '947',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'phdr',
                                                           'offset' => '0',
                                                           'type' => '4017'
                                                         },
                                                  '1' => {
                                                           'name' => 'ehdr_list',
                                                           'offset' => '22',
                                                           'type' => '4294'
                                                         },
                                                  '2' => {
                                                           'name' => 'subhdr',
                                                           'offset' => '324',
                                                           'type' => '4187'
                                                         }
                                                },
                                      'Name' => 'struct erf_mc_phdr',
                                      'Size' => '152',
                                      'Type' => 'Struct'
                                    },
                          '426061' => {
                                        'BaseType' => '312',
                                        'Name' => 'gboolean*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '4294' => {
                                      'BaseType' => '4115',
                                      'Name' => 'struct erf_ehdr[16]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '4310' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1013',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sita_flags',
                                                           'offset' => '0',
                                                           'type' => '182'
                                                         },
                                                  '1' => {
                                                           'name' => 'sita_signals',
                                                           'offset' => '1',
                                                           'type' => '182'
                                                         },
                                                  '2' => {
                                                           'name' => 'sita_errors1',
                                                           'offset' => '2',
                                                           'type' => '182'
                                                         },
                                                  '3' => {
                                                           'name' => 'sita_errors2',
                                                           'offset' => '3',
                                                           'type' => '182'
                                                         },
                                                  '4' => {
                                                           'name' => 'sita_proto',
                                                           'offset' => '4',
                                                           'type' => '182'
                                                         }
                                                },
                                      'Name' => 'struct sita_phdr',
                                      'Size' => '5',
                                      'Type' => 'Struct'
                                    },
                          '437' => {
                                     'BaseType' => '449',
                                     'Header' => 'garray.h',
                                     'Line' => '39',
                                     'Name' => 'GPtrArray',
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '4395' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1022',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sent',
                                                           'offset' => '0',
                                                           'type' => '312'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '4',
                                                           'type' => '223'
                                                         }
                                                },
                                      'Name' => 'struct bthci_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4438' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1034',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'adapter_id',
                                                           'offset' => '0',
                                                           'type' => '199'
                                                         },
                                                  '1' => {
                                                           'name' => 'opcode',
                                                           'offset' => '2',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct btmon_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '4481' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1040',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'uton',
                                                           'offset' => '0',
                                                           'type' => '312'
                                                         }
                                                },
                                      'Name' => 'struct l1event_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '449' => {
                                     'Header' => 'garray.h',
                                     'Line' => '53',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'pdata',
                                                          'offset' => '0',
                                                          'type' => '501'
                                                        },
                                                 '1' => {
                                                          'name' => 'len',
                                                          'offset' => '8',
                                                          'type' => '324'
                                                        }
                                               },
                                     'Name' => 'struct _GPtrArray',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '45' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '4510' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1045',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'is_event',
                                                           'offset' => '0',
                                                           'type' => '182'
                                                         },
                                                  '1' => {
                                                           'name' => 'bus',
                                                           'offset' => '1',
                                                           'type' => '182'
                                                         },
                                                  '2' => {
                                                           'name' => 'flags',
                                                           'offset' => '4',
                                                           'type' => '223'
                                                         }
                                                },
                                      'Name' => 'struct i2c_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '4567' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1052',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'uplink',
                                                           'offset' => '0',
                                                           'type' => '312'
                                                         },
                                                  '1' => {
                                                           'name' => 'channel',
                                                           'offset' => '4',
                                                           'type' => '182'
                                                         },
                                                  '2' => {
                                                           'name' => 'bsic',
                                                           'offset' => '5',
                                                           'type' => '182'
                                                         },
                                                  '3' => {
                                                           'name' => 'arfcn',
                                                           'offset' => '6',
                                                           'type' => '199'
                                                         },
                                                  '4' => {
                                                           'name' => 'tdma_frame',
                                                           'offset' => '8',
                                                           'type' => '223'
                                                         },
                                                  '5' => {
                                                           'name' => 'error',
                                                           'offset' => '18',
                                                           'type' => '182'
                                                         },
                                                  '6' => {
                                                           'name' => 'timeshift',
                                                           'offset' => '20',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct gsm_um_phdr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4680' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1074',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rec_offset',
                                                           'offset' => '0',
                                                           'type' => '235'
                                                         },
                                                  '1' => {
                                                           'name' => 'rec_len',
                                                           'offset' => '8',
                                                           'type' => '211'
                                                         },
                                                  '10' => {
                                                            'name' => 'vlantag_offset',
                                                            'offset' => '33',
                                                            'type' => '182'
                                                          },
                                                  '11' => {
                                                            'name' => 'coreid_offset',
                                                            'offset' => '34',
                                                            'type' => '182'
                                                          },
                                                  '12' => {
                                                            'name' => 'srcnodeid_offset',
                                                            'offset' => '35',
                                                            'type' => '182'
                                                          },
                                                  '13' => {
                                                            'name' => 'destnodeid_offset',
                                                            'offset' => '36',
                                                            'type' => '182'
                                                          },
                                                  '14' => {
                                                            'name' => 'clflags_offset',
                                                            'offset' => '37',
                                                            'type' => '182'
                                                          },
                                                  '15' => {
                                                            'name' => 'src_vmname_len_offset',
                                                            'offset' => '38',
                                                            'type' => '182'
                                                          },
                                                  '16' => {
                                                            'name' => 'dst_vmname_len_offset',
                                                            'offset' => '39',
                                                            'type' => '182'
                                                          },
                                                  '17' => {
                                                            'name' => 'ns_activity_offset',
                                                            'offset' => '40',
                                                            'type' => '182'
                                                          },
                                                  '18' => {
                                                            'name' => 'data_offset',
                                                            'offset' => '41',
                                                            'type' => '182'
                                                          },
                                                  '2' => {
                                                           'name' => 'nicno_offset',
                                                           'offset' => '18',
                                                           'type' => '182'
                                                         },
                                                  '3' => {
                                                           'name' => 'nicno_len',
                                                           'offset' => '19',
                                                           'type' => '182'
                                                         },
                                                  '4' => {
                                                           'name' => 'dir_offset',
                                                           'offset' => '20',
                                                           'type' => '182'
                                                         },
                                                  '5' => {
                                                           'name' => 'dir_len',
                                                           'offset' => '21',
                                                           'type' => '182'
                                                         },
                                                  '6' => {
                                                           'name' => 'eth_offset',
                                                           'offset' => '22',
                                                           'type' => '199'
                                                         },
                                                  '7' => {
                                                           'name' => 'pcb_offset',
                                                           'offset' => '24',
                                                           'type' => '182'
                                                         },
                                                  '8' => {
                                                           'name' => 'l_pcb_offset',
                                                           'offset' => '25',
                                                           'type' => '182'
                                                         },
                                                  '9' => {
                                                           'name' => 'rec_type',
                                                           'offset' => '32',
                                                           'type' => '182'
                                                         }
                                                },
                                      'Name' => 'struct nstr_phdr',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '489' => {
                                     'BaseType' => '283',
                                     'Name' => 'gchar*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '495' => {
                                     'BaseType' => '182',
                                     'Name' => 'guint8*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '4961' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1097',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'eth',
                                                           'offset' => '0',
                                                           'type' => '890'
                                                         },
                                                  '1' => {
                                                           'name' => 'stuff',
                                                           'offset' => '4',
                                                           'type' => '2200'
                                                         }
                                                },
                                      'Name' => 'struct nokia_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '5004' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1103',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'adapter',
                                                           'offset' => '0',
                                                           'type' => '182'
                                                         },
                                                  '1' => {
                                                           'name' => 'flags',
                                                           'offset' => '1',
                                                           'type' => '182'
                                                         }
                                                },
                                      'Name' => 'struct llcp_phdr',
                                      'Size' => '2',
                                      'Type' => 'Struct'
                                    },
                          '501' => {
                                     'BaseType' => '355',
                                     'Name' => 'gpointer*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '50284' => {
                                       'BaseType' => '50296',
                                       'Header' => 'ghash.h',
                                       'Line' => '37',
                                       'Name' => 'GHashTable',
                                       'Type' => 'Typedef'
                                     },
                          '50296' => {
                                       'Name' => 'struct _GHashTable',
                                       'Type' => 'Struct'
                                     },
                          '50307' => {
                                       'BaseType' => '50284',
                                       'Name' => 'GHashTable*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5047' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1109',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'version',
                                                           'offset' => '0',
                                                           'type' => '300'
                                                         }
                                                },
                                      'Name' => 'struct logcat_phdr',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '50480' => {
                                       'BaseType' => '182',
                                       'Name' => 'guint8[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '5076' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1120',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'eth',
                                                           'offset' => '0',
                                                           'type' => '890'
                                                         },
                                                  '1' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '991'
                                                         },
                                                  '2' => {
                                                           'name' => 'ieee_802_11',
                                                           'offset' => '0',
                                                           'type' => '2514'
                                                         }
                                                },
                                      'Name' => 'union sub_wtap_pseudo_header',
                                      'Size' => '72',
                                      'Type' => 'Union'
                                    },
                          '50780' => {
                                       'Header' => 'wtap_opttypes.h',
                                       'Line' => '296',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'WTAP_OPTTYPE_SUCCESS',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'WTAP_OPTTYPE_NO_SUCH_OPTION',
                                                            'value' => '18446744073709551615 (-1)'
                                                          },
                                                   '2' => {
                                                            'name' => 'WTAP_OPTTYPE_NOT_FOUND',
                                                            'value' => '18446744073709551614 (-2)'
                                                          },
                                                   '3' => {
                                                            'name' => 'WTAP_OPTTYPE_TYPE_MISMATCH',
                                                            'value' => '18446744073709551613 (-3)'
                                                          },
                                                   '4' => {
                                                            'name' => 'WTAP_OPTTYPE_NUMBER_MISMATCH',
                                                            'value' => '18446744073709551612 (-4)'
                                                          },
                                                   '5' => {
                                                            'name' => 'WTAP_OPTTYPE_ALREADY_EXISTS',
                                                            'value' => '18446744073709551611 (-5)'
                                                          },
                                                   '6' => {
                                                            'name' => 'WTAP_OPTTYPE_BAD_BLOCK',
                                                            'value' => '18446744073709551610 (-6)'
                                                          }
                                                 },
                                       'Name' => 'enum wtap_opttype_return_val',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '5130' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1115',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'title',
                                                           'offset' => '0',
                                                           'type' => '495'
                                                         },
                                                  '1' => {
                                                           'name' => 'descLength',
                                                           'offset' => '8',
                                                           'type' => '223'
                                                         },
                                                  '2' => {
                                                           'name' => 'description',
                                                           'offset' => '22',
                                                           'type' => '495'
                                                         },
                                                  '3' => {
                                                           'name' => 'sub_encap',
                                                           'offset' => '36',
                                                           'type' => '324'
                                                         },
                                                  '4' => {
                                                           'name' => 'subheader',
                                                           'offset' => '50',
                                                           'type' => '5076'
                                                         }
                                                },
                                      'Name' => 'struct netmon_phdr',
                                      'Size' => '104',
                                      'Type' => 'Struct'
                                    },
                          '514' => {
                                     'BaseType' => '526',
                                     'Header' => 'glist.h',
                                     'Line' => '37',
                                     'Name' => 'GList',
                                     'Size' => '24',
                                     'Type' => 'Typedef'
                                   },
                          '52' => {
                                    'BaseType' => '64',
                                    'Header' => 'stddef.h',
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '5215' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1128',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'pathname',
                                                           'offset' => '0',
                                                           'type' => '90'
                                                         }
                                                },
                                      'Name' => 'struct ber_phdr',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '5244' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1132',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'eth',
                                                           'offset' => '0',
                                                           'type' => '890'
                                                         },
                                                  '1' => {
                                                           'name' => 'dte_dce',
                                                           'offset' => '0',
                                                           'type' => '919'
                                                         },
                                                  '10' => {
                                                            'name' => 'mtp2',
                                                            'offset' => '0',
                                                            'type' => '3264'
                                                          },
                                                  '11' => {
                                                            'name' => 'k12',
                                                            'offset' => '0',
                                                            'type' => '3422'
                                                          },
                                                  '12' => {
                                                            'name' => 'lapd',
                                                            'offset' => '0',
                                                            'type' => '3549'
                                                          },
                                                  '13' => {
                                                            'name' => 'dct2000',
                                                            'offset' => '0',
                                                            'type' => '3642'
                                                          },
                                                  '14' => {
                                                            'name' => 'erf',
                                                            'offset' => '0',
                                                            'type' => '4237'
                                                          },
                                                  '15' => {
                                                            'name' => 'sita',
                                                            'offset' => '0',
                                                            'type' => '4310'
                                                          },
                                                  '16' => {
                                                            'name' => 'bthci',
                                                            'offset' => '0',
                                                            'type' => '4395'
                                                          },
                                                  '17' => {
                                                            'name' => 'btmon',
                                                            'offset' => '0',
                                                            'type' => '4438'
                                                          },
                                                  '18' => {
                                                            'name' => 'l1event',
                                                            'offset' => '0',
                                                            'type' => '4481'
                                                          },
                                                  '19' => {
                                                            'name' => 'i2c',
                                                            'offset' => '0',
                                                            'type' => '4510'
                                                          },
                                                  '2' => {
                                                           'name' => 'isdn',
                                                           'offset' => '0',
                                                           'type' => '948'
                                                         },
                                                  '20' => {
                                                            'name' => 'gsm_um',
                                                            'offset' => '0',
                                                            'type' => '4567'
                                                          },
                                                  '21' => {
                                                            'name' => 'nstr',
                                                            'offset' => '0',
                                                            'type' => '4680'
                                                          },
                                                  '22' => {
                                                            'name' => 'nokia',
                                                            'offset' => '0',
                                                            'type' => '4961'
                                                          },
                                                  '23' => {
                                                            'name' => 'llcp',
                                                            'offset' => '0',
                                                            'type' => '5004'
                                                          },
                                                  '24' => {
                                                            'name' => 'logcat',
                                                            'offset' => '0',
                                                            'type' => '5047'
                                                          },
                                                  '25' => {
                                                            'name' => 'netmon',
                                                            'offset' => '0',
                                                            'type' => '5130'
                                                          },
                                                  '26' => {
                                                            'name' => 'ber',
                                                            'offset' => '0',
                                                            'type' => '5215'
                                                          },
                                                  '3' => {
                                                           'name' => 'atm',
                                                           'offset' => '0',
                                                           'type' => '991'
                                                         },
                                                  '4' => {
                                                           'name' => 'ascend',
                                                           'offset' => '0',
                                                           'type' => '1174'
                                                         },
                                                  '5' => {
                                                           'name' => 'p2p',
                                                           'offset' => '0',
                                                           'type' => '1273'
                                                         },
                                                  '6' => {
                                                           'name' => 'ieee_802_11',
                                                           'offset' => '0',
                                                           'type' => '2514'
                                                         },
                                                  '7' => {
                                                           'name' => 'cosine',
                                                           'offset' => '0',
                                                           'type' => '3008'
                                                         },
                                                  '8' => {
                                                           'name' => 'irda',
                                                           'offset' => '0',
                                                           'type' => '3150'
                                                         },
                                                  '9' => {
                                                           'name' => 'nettl',
                                                           'offset' => '0',
                                                           'type' => '3179'
                                                         }
                                                },
                                      'Name' => 'union wtap_pseudo_header',
                                      'Size' => '152',
                                      'Type' => 'Union'
                                    },
                          '526' => {
                                     'Header' => 'glist.h',
                                     'Line' => '39',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '355'
                                                        },
                                                 '1' => {
                                                          'name' => 'next',
                                                          'offset' => '8',
                                                          'type' => '579'
                                                        },
                                                 '2' => {
                                                          'name' => 'prev',
                                                          'offset' => '22',
                                                          'type' => '579'
                                                        }
                                               },
                                     'Name' => 'struct _GList',
                                     'Size' => '24',
                                     'Type' => 'Struct'
                                   },
                          '5691' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1230',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'caplen',
                                                           'offset' => '0',
                                                           'type' => '223'
                                                         },
                                                  '1' => {
                                                           'name' => 'len',
                                                           'offset' => '4',
                                                           'type' => '223'
                                                         },
                                                  '2' => {
                                                           'name' => 'pkt_encap',
                                                           'offset' => '8',
                                                           'type' => '78'
                                                         },
                                                  '3' => {
                                                           'name' => 'interface_id',
                                                           'offset' => '18',
                                                           'type' => '223'
                                                         },
                                                  '4' => {
                                                           'name' => 'pseudo_header',
                                                           'offset' => '22',
                                                           'type' => '5244'
                                                         }
                                                },
                                      'Name' => 'struct wtap_packet_header',
                                      'Size' => '168',
                                      'Type' => 'Struct'
                                    },
                          '5743' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1306',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'record_type',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'name' => 'record_len',
                                                           'offset' => '4',
                                                           'type' => '223'
                                                         }
                                                },
                                      'Name' => 'struct wtap_ft_specific_header',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '579' => {
                                     'BaseType' => '514',
                                     'Name' => 'GList*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '585' => {
                                     'BaseType' => '489',
                                     'Name' => 'gchar**',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5893' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1320',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'record_type',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'name' => 'byte_order',
                                                           'offset' => '4',
                                                           'type' => '78'
                                                         },
                                                  '2' => {
                                                           'name' => 'timestamp',
                                                           'offset' => '8',
                                                           'type' => '247'
                                                         },
                                                  '3' => {
                                                           'name' => 'thread_id',
                                                           'offset' => '22',
                                                           'type' => '247'
                                                         },
                                                  '4' => {
                                                           'name' => 'event_len',
                                                           'offset' => '36',
                                                           'type' => '223'
                                                         },
                                                  '5' => {
                                                           'name' => 'event_filelen',
                                                           'offset' => '40',
                                                           'type' => '223'
                                                         },
                                                  '6' => {
                                                           'name' => 'event_type',
                                                           'offset' => '50',
                                                           'type' => '199'
                                                         },
                                                  '7' => {
                                                           'name' => 'nparams',
                                                           'offset' => '54',
                                                           'type' => '223'
                                                         },
                                                  '8' => {
                                                           'name' => 'cpu_id',
                                                           'offset' => '64',
                                                           'type' => '199'
                                                         }
                                                },
                                      'Name' => 'struct wtap_syscall_header',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '591' => {
                                     'BaseType' => '380',
                                     'Name' => 'GArray*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5931' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1324',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'record_len',
                                                           'offset' => '0',
                                                           'type' => '223'
                                                         }
                                                },
                                      'Name' => 'struct wtap_systemd_journal_export_header',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '5944' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1331',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '223'
                                                         },
                                                  '1' => {
                                                           'name' => 'skipped',
                                                           'offset' => '4',
                                                           'type' => '223'
                                                         }
                                                },
                                      'Name' => 'struct nflx',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '597' => {
                                     'BaseType' => '437',
                                     'Name' => 'GPtrArray*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '5987' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1330',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'nflx_custom_data_header',
                                                           'offset' => '0',
                                                           'type' => '5944'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-1330',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '60349' => {
                                       'BaseType' => '108',
                                       'Header' => 'zconf.h',
                                       'Line' => '391',
                                       'Name' => 'Byte',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '603537' => {
                                        'BaseType' => '249784',
                                        'Name' => 'ws_in6_addr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '60362' => {
                                       'BaseType' => '45',
                                       'Header' => 'zconf.h',
                                       'Line' => '393',
                                       'Name' => 'uInt',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '60375' => {
                                       'BaseType' => '64',
                                       'Header' => 'zconf.h',
                                       'Line' => '394',
                                       'Name' => 'uLong',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '60388' => {
                                       'BaseType' => '60349',
                                       'Header' => 'zconf.h',
                                       'Line' => '400',
                                       'Name' => 'Bytef',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '60401' => {
                                       'BaseType' => '60388',
                                       'Name' => 'Bytef const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '60406' => {
                                       'BaseType' => '148',
                                       'Header' => 'zconf.h',
                                       'Line' => '409',
                                       'Name' => 'voidpf',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '60419' => {
                                       'BaseType' => '60431',
                                       'Header' => 'zlib.h',
                                       'Line' => '81',
                                       'Name' => 'alloc_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '60431' => {
                                       'Name' => 'voidpf(*)(voidpf, uInt, uInt)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '60406'
                                                           },
                                                    '1' => {
                                                             'type' => '60362'
                                                           },
                                                    '2' => {
                                                             'type' => '60362'
                                                           }
                                                  },
                                       'Return' => '60406',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '60462' => {
                                       'BaseType' => '60474',
                                       'Header' => 'zlib.h',
                                       'Line' => '82',
                                       'Name' => 'free_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '60474' => {
                                       'Name' => 'void(*)(voidpf, voidpf)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '60406'
                                                           },
                                                    '1' => {
                                                             'type' => '60406'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '60496' => {
                                       'Header' => 'zlib.h',
                                       'Line' => '86',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next_in',
                                                            'offset' => '0',
                                                            'type' => '60692'
                                                          },
                                                   '1' => {
                                                            'name' => 'avail_in',
                                                            'offset' => '8',
                                                            'type' => '60362'
                                                          },
                                                   '10' => {
                                                             'name' => 'opaque',
                                                             'offset' => '128',
                                                             'type' => '60406'
                                                           },
                                                   '11' => {
                                                             'name' => 'data_type',
                                                             'offset' => '136',
                                                             'type' => '78'
                                                           },
                                                   '12' => {
                                                             'name' => 'adler',
                                                             'offset' => '150',
                                                             'type' => '60375'
                                                           },
                                                   '13' => {
                                                             'name' => 'reserved',
                                                             'offset' => '260',
                                                             'type' => '60375'
                                                           },
                                                   '2' => {
                                                            'name' => 'total_in',
                                                            'offset' => '22',
                                                            'type' => '60375'
                                                          },
                                                   '3' => {
                                                            'name' => 'next_out',
                                                            'offset' => '36',
                                                            'type' => '60698'
                                                          },
                                                   '4' => {
                                                            'name' => 'avail_out',
                                                            'offset' => '50',
                                                            'type' => '60362'
                                                          },
                                                   '5' => {
                                                            'name' => 'total_out',
                                                            'offset' => '64',
                                                            'type' => '60375'
                                                          },
                                                   '6' => {
                                                            'name' => 'msg',
                                                            'offset' => '72',
                                                            'type' => '90'
                                                          },
                                                   '7' => {
                                                            'name' => 'state',
                                                            'offset' => '86',
                                                            'type' => '60709'
                                                          },
                                                   '8' => {
                                                            'name' => 'zalloc',
                                                            'offset' => '100',
                                                            'type' => '60419'
                                                          },
                                                   '9' => {
                                                            'name' => 'zfree',
                                                            'offset' => '114',
                                                            'type' => '60462'
                                                          }
                                                 },
                                       'Name' => 'struct z_stream_s',
                                       'Size' => '112',
                                       'Type' => 'Struct'
                                     },
                          '60692' => {
                                       'BaseType' => '60401',
                                       'Name' => 'Bytef const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60698' => {
                                       'BaseType' => '60388',
                                       'Name' => 'Bytef*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60704' => {
                                       'Name' => 'struct internal_state',
                                       'Type' => 'Struct'
                                     },
                          '60709' => {
                                       'BaseType' => '60704',
                                       'Name' => 'struct internal_state*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '60715' => {
                                       'BaseType' => '60496',
                                       'Header' => 'zlib.h',
                                       'Line' => '106',
                                       'Name' => 'z_stream',
                                       'Size' => '112',
                                       'Type' => 'Typedef'
                                     },
                          '6078' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1336',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'length',
                                                           'offset' => '0',
                                                           'type' => '223'
                                                         },
                                                  '1' => {
                                                           'name' => 'pen',
                                                           'offset' => '4',
                                                           'type' => '223'
                                                         },
                                                  '2' => {
                                                           'name' => 'copy_allowed',
                                                           'offset' => '8',
                                                           'type' => '312'
                                                         },
                                                  '3' => {
                                                           'name' => 'custom_data_header',
                                                           'offset' => '18',
                                                           'type' => '5987'
                                                         }
                                                },
                                      'Name' => 'struct wtap_custom_block_header',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '6091' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1347',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'packet_header',
                                                           'offset' => '0',
                                                           'type' => '5691'
                                                         },
                                                  '1' => {
                                                           'name' => 'ft_specific_header',
                                                           'offset' => '0',
                                                           'type' => '5743'
                                                         },
                                                  '2' => {
                                                           'name' => 'syscall_header',
                                                           'offset' => '0',
                                                           'type' => '5893'
                                                         },
                                                  '3' => {
                                                           'name' => 'systemd_journal_export_header',
                                                           'offset' => '0',
                                                           'type' => '5931'
                                                         },
                                                  '4' => {
                                                           'name' => 'custom_block_header',
                                                           'offset' => '0',
                                                           'type' => '6078'
                                                         }
                                                },
                                      'Name' => 'anon-union-wtap.h-1347',
                                      'Size' => '168',
                                      'Type' => 'Union'
                                    },
                          '626' => {
                                     'Header' => 'buffer.h',
                                     'Line' => '21',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'data',
                                                          'offset' => '0',
                                                          'type' => '495'
                                                        },
                                                 '1' => {
                                                          'name' => 'allocated',
                                                          'offset' => '8',
                                                          'type' => '259'
                                                        },
                                                 '2' => {
                                                          'name' => 'start',
                                                          'offset' => '22',
                                                          'type' => '259'
                                                        },
                                                 '3' => {
                                                          'name' => 'first_free',
                                                          'offset' => '36',
                                                          'type' => '259'
                                                        }
                                               },
                                     'Name' => 'struct Buffer',
                                     'Size' => '32',
                                     'Type' => 'Struct'
                                   },
                          '6304' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1363',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'rec_type',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'name' => 'presence_flags',
                                                           'offset' => '4',
                                                           'type' => '223'
                                                         },
                                                  '2' => {
                                                           'name' => 'section_number',
                                                           'offset' => '8',
                                                           'type' => '324'
                                                         },
                                                  '3' => {
                                                           'name' => 'ts',
                                                           'offset' => '22',
                                                           'type' => '740'
                                                         },
                                                  '4' => {
                                                           'name' => 'tsprec',
                                                           'offset' => '50',
                                                           'type' => '78'
                                                         },
                                                  '5' => {
                                                           'name' => 'rec_header',
                                                           'offset' => '64',
                                                           'type' => '6091'
                                                         },
                                                  '6' => {
                                                           'name' => 'block',
                                                           'offset' => '520',
                                                           'type' => '752'
                                                         },
                                                  '7' => {
                                                           'name' => 'block_was_modified',
                                                           'offset' => '534',
                                                           'type' => '312'
                                                         },
                                                  '8' => {
                                                           'name' => 'options_buf',
                                                           'offset' => '548',
                                                           'type' => '692'
                                                         }
                                                },
                                      'Name' => 'struct wtap_rec',
                                      'Size' => '256',
                                      'Type' => 'Struct'
                                    },
                          '6317' => {
                                      'BaseType' => '6304',
                                      'Name' => 'wtap_rec const',
                                      'Size' => '256',
                                      'Type' => 'Const'
                                    },
                          '6322' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1413',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ipv4_addr_list',
                                                           'offset' => '0',
                                                           'type' => '579'
                                                         },
                                                  '1' => {
                                                           'name' => 'ipv6_addr_list',
                                                           'offset' => '8',
                                                           'type' => '579'
                                                         }
                                                },
                                      'Name' => 'struct addrinfo_lists',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6365' => {
                                      'BaseType' => '6322',
                                      'Header' => 'wtap.h',
                                      'Line' => '1416',
                                      'Name' => 'addrinfo_lists_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '6378' => {
                                      'BaseType' => '392',
                                      'Name' => 'GArray const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6384' => {
                                      'BaseType' => '3699',
                                      'Header' => 'wtap.h',
                                      'Line' => '1451',
                                      'Name' => 'wtap',
                                      'Size' => '168',
                                      'Type' => 'Typedef'
                                    },
                          '6397' => {
                                      'BaseType' => '6410',
                                      'Header' => 'wtap.h',
                                      'Line' => '1452',
                                      'Name' => 'wtap_dumper',
                                      'Size' => '136',
                                      'Type' => 'Typedef'
                                    },
                          '64' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '6410' => {
                                      'Header' => 'wtap-int.h',
                                      'Line' => '94',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fh',
                                                           'offset' => '0',
                                                           'type' => '7603'
                                                         },
                                                  '1' => {
                                                           'name' => 'file_type_subtype',
                                                           'offset' => '8',
                                                           'type' => '78'
                                                         },
                                                  '10' => {
                                                            'name' => 'subtype_write',
                                                            'offset' => '100',
                                                            'type' => '7669'
                                                          },
                                                  '11' => {
                                                            'name' => 'subtype_finish',
                                                            'offset' => '114',
                                                            'type' => '7734'
                                                          },
                                                  '12' => {
                                                            'name' => 'addrinfo_lists',
                                                            'offset' => '128',
                                                            'type' => '7777'
                                                          },
                                                  '13' => {
                                                            'name' => 'shb_hdrs',
                                                            'offset' => '136',
                                                            'type' => '591'
                                                          },
                                                  '14' => {
                                                            'name' => 'nrb_hdrs',
                                                            'offset' => '150',
                                                            'type' => '591'
                                                          },
                                                  '15' => {
                                                            'name' => 'interface_data',
                                                            'offset' => '260',
                                                            'type' => '591'
                                                          },
                                                  '16' => {
                                                            'name' => 'dsbs_initial',
                                                            'offset' => '274',
                                                            'type' => '591'
                                                          },
                                                  '17' => {
                                                            'name' => 'dsbs_growing',
                                                            'offset' => '288',
                                                            'type' => '6378'
                                                          },
                                                  '18' => {
                                                            'name' => 'dsbs_growing_written',
                                                            'offset' => '296',
                                                            'type' => '324'
                                                          },
                                                  '2' => {
                                                           'name' => 'snaplen',
                                                           'offset' => '18',
                                                           'type' => '78'
                                                         },
                                                  '3' => {
                                                           'name' => 'encap',
                                                           'offset' => '22',
                                                           'type' => '78'
                                                         },
                                                  '4' => {
                                                           'name' => 'compression_type',
                                                           'offset' => '32',
                                                           'type' => '7439'
                                                         },
                                                  '5' => {
                                                           'name' => 'needs_reload',
                                                           'offset' => '36',
                                                           'type' => '312'
                                                         },
                                                  '6' => {
                                                           'name' => 'bytes_dumped',
                                                           'offset' => '50',
                                                           'type' => '235'
                                                         },
                                                  '7' => {
                                                           'name' => 'priv',
                                                           'offset' => '64',
                                                           'type' => '148'
                                                         },
                                                  '8' => {
                                                           'name' => 'wslua_data',
                                                           'offset' => '72',
                                                           'type' => '148'
                                                         },
                                                  '9' => {
                                                           'name' => 'subtype_add_idb',
                                                           'offset' => '86',
                                                           'type' => '7615'
                                                         }
                                                },
                                      'Name' => 'struct wtap_dumper',
                                      'Size' => '136',
                                      'Type' => 'Struct'
                                    },
                          '649355' => {
                                        'BaseType' => '324',
                                        'Name' => 'guint*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '6670' => {
                                      'BaseType' => '6683',
                                      'Header' => 'wtap.h',
                                      'Line' => '1454',
                                      'Name' => 'FILE_T',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6683' => {
                                      'BaseType' => '6689',
                                      'Name' => 'struct wtap_reader*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6689' => {
                                      'Line' => '168',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fd',
                                                           'offset' => '0',
                                                           'type' => '78'
                                                         },
                                                  '1' => {
                                                           'name' => 'raw_pos',
                                                           'offset' => '8',
                                                           'type' => '235'
                                                         },
                                                  '10' => {
                                                            'name' => 'last_compression',
                                                            'offset' => '264',
                                                            'type' => '992476'
                                                          },
                                                  '11' => {
                                                            'name' => 'is_compressed',
                                                            'offset' => '274',
                                                            'type' => '312'
                                                          },
                                                  '12' => {
                                                            'name' => 'skip',
                                                            'offset' => '288',
                                                            'type' => '235'
                                                          },
                                                  '13' => {
                                                            'name' => 'seek_pending',
                                                            'offset' => '296',
                                                            'type' => '312'
                                                          },
                                                  '14' => {
                                                            'name' => 'err',
                                                            'offset' => '306',
                                                            'type' => '78'
                                                          },
                                                  '15' => {
                                                            'name' => 'err_info',
                                                            'offset' => '310',
                                                            'type' => '90'
                                                          },
                                                  '16' => {
                                                            'name' => 'strm',
                                                            'offset' => '324',
                                                            'type' => '60715'
                                                          },
                                                  '17' => {
                                                            'name' => 'dont_check_crc',
                                                            'offset' => '598',
                                                            'type' => '312'
                                                          },
                                                  '18' => {
                                                            'name' => 'fast_seek',
                                                            'offset' => '612',
                                                            'type' => '597'
                                                          },
                                                  '19' => {
                                                            'name' => 'fast_seek_cur',
                                                            'offset' => '626',
                                                            'type' => '148'
                                                          },
                                                  '2' => {
                                                           'name' => 'pos',
                                                           'offset' => '22',
                                                           'type' => '235'
                                                         },
                                                  '20' => {
                                                            'name' => 'zstd_dctx',
                                                            'offset' => '640',
                                                            'type' => '992541'
                                                          },
                                                  '21' => {
                                                            'name' => 'lz4_dctx',
                                                            'offset' => '648',
                                                            'type' => '992271'
                                                          },
                                                  '3' => {
                                                           'name' => 'size',
                                                           'offset' => '36',
                                                           'type' => '324'
                                                         },
                                                  '4' => {
                                                           'name' => 'in',
                                                           'offset' => '50',
                                                           'type' => '992488'
                                                         },
                                                  '5' => {
                                                           'name' => 'out',
                                                           'offset' => '86',
                                                           'type' => '992488'
                                                         },
                                                  '6' => {
                                                           'name' => 'eof',
                                                           'offset' => '128',
                                                           'type' => '312'
                                                         },
                                                  '7' => {
                                                           'name' => 'start',
                                                           'offset' => '136',
                                                           'type' => '235'
                                                         },
                                                  '8' => {
                                                           'name' => 'raw',
                                                           'offset' => '150',
                                                           'type' => '235'
                                                         },
                                                  '9' => {
                                                           'name' => 'compression',
                                                           'offset' => '260',
                                                           'type' => '992476'
                                                         }
                                                },
                                      'Name' => 'struct wtap_reader',
                                      'Size' => '296',
                                      'Source' => 'file_wrappers.c',
                                      'Type' => 'Struct'
                                    },
                          '6694' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1467',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'wslua_can_write_encap',
                                                           'offset' => '0',
                                                           'type' => '6757'
                                                         },
                                                  '1' => {
                                                           'name' => 'wslua_data',
                                                           'offset' => '8',
                                                           'type' => '148'
                                                         }
                                                },
                                      'Name' => 'struct wtap_wslua_file_info',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '6757' => {
                                      'Name' => 'int(*)(int, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '78'
                                                          },
                                                   '1' => {
                                                            'type' => '148'
                                                          }
                                                 },
                                      'Return' => '78',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6763' => {
                                      'BaseType' => '6694',
                                      'Header' => 'wtap.h',
                                      'Line' => '1470',
                                      'Name' => 'wtap_wslua_file_info_t',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '6810' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1531',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WTAP_OPEN_NOT_MINE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WTAP_OPEN_MINE',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'WTAP_OPEN_ERROR',
                                                           'value' => '18446744073709551615 (-1)'
                                                         }
                                                },
                                      'Name' => 'enum wtap_open_return_val',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6823' => {
                                      'BaseType' => '78',
                                      'Name' => 'int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6829' => {
                                      'BaseType' => '150',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6869' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1590',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'OPTION_NOT_SUPPORTED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ONE_OPTION_SUPPORTED',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'MULTIPLE_OPTIONS_SUPPORTED',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum option_support_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6882' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1595',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'opt',
                                                           'offset' => '0',
                                                           'type' => '324'
                                                         },
                                                  '1' => {
                                                           'name' => 'support',
                                                           'offset' => '4',
                                                           'type' => '6869'
                                                         }
                                                },
                                      'Name' => 'struct supported_option_type',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '692' => {
                                     'BaseType' => '626',
                                     'Header' => 'buffer.h',
                                     'Line' => '26',
                                     'Name' => 'Buffer',
                                     'Size' => '32',
                                     'Type' => 'Typedef'
                                   },
                          '6925' => {
                                      'BaseType' => '6882',
                                      'Name' => 'struct supported_option_type const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '6964' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1614',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'BLOCK_NOT_SUPPORTED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ONE_BLOCK_SUPPORTED',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'MULTIPLE_BLOCKS_SUPPORTED',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum block_support_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '6977' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1619',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '862'
                                                         },
                                                  '1' => {
                                                           'name' => 'support',
                                                           'offset' => '4',
                                                           'type' => '6964'
                                                         },
                                                  '2' => {
                                                           'name' => 'num_supported_options',
                                                           'offset' => '8',
                                                           'type' => '52'
                                                         },
                                                  '3' => {
                                                           'name' => 'supported_options',
                                                           'offset' => '22',
                                                           'type' => '7053'
                                                         }
                                                },
                                      'Name' => 'struct supported_block_type',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '7048' => {
                                      'BaseType' => '6977',
                                      'Name' => 'struct supported_block_type const',
                                      'Size' => '24',
                                      'Type' => 'Const'
                                    },
                          '7053' => {
                                      'BaseType' => '6925',
                                      'Name' => 'struct supported_option_type const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7059' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1629',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'description',
                                                           'offset' => '0',
                                                           'type' => '90'
                                                         },
                                                  '1' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '90'
                                                         },
                                                  '2' => {
                                                           'name' => 'default_file_extension',
                                                           'offset' => '22',
                                                           'type' => '90'
                                                         },
                                                  '3' => {
                                                           'name' => 'additional_file_extensions',
                                                           'offset' => '36',
                                                           'type' => '90'
                                                         },
                                                  '4' => {
                                                           'name' => 'writing_must_seek',
                                                           'offset' => '50',
                                                           'type' => '312'
                                                         },
                                                  '5' => {
                                                           'name' => 'num_supported_blocks',
                                                           'offset' => '64',
                                                           'type' => '52'
                                                         },
                                                  '6' => {
                                                           'name' => 'supported_blocks',
                                                           'offset' => '72',
                                                           'type' => '7219'
                                                         },
                                                  '7' => {
                                                           'name' => 'can_write_encap',
                                                           'offset' => '86',
                                                           'type' => '7240'
                                                         },
                                                  '8' => {
                                                           'name' => 'dump_open',
                                                           'offset' => '100',
                                                           'type' => '7277'
                                                         },
                                                  '9' => {
                                                           'name' => 'wslua_info',
                                                           'offset' => '114',
                                                           'type' => '7283'
                                                         }
                                                },
                                      'Name' => 'struct file_type_subtype_info',
                                      'Size' => '80',
                                      'Type' => 'Struct'
                                    },
                          '71' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '7214' => {
                                      'BaseType' => '7059',
                                      'Name' => 'struct file_type_subtype_info const',
                                      'Size' => '80',
                                      'Type' => 'Const'
                                    },
                          '7219' => {
                                      'BaseType' => '7048',
                                      'Name' => 'struct supported_block_type const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7240' => {
                                      'Name' => 'int(*)(int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '78'
                                                          }
                                                 },
                                      'Return' => '78',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7271' => {
                                      'BaseType' => '6397',
                                      'Name' => 'wtap_dumper*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7277' => {
                                      'Name' => 'int(*)(wtap_dumper*, int*, gchar**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '7271'
                                                          },
                                                   '1' => {
                                                            'type' => '6823'
                                                          },
                                                   '2' => {
                                                            'type' => '585'
                                                          }
                                                 },
                                      'Return' => '78',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7283' => {
                                      'BaseType' => '6763',
                                      'Name' => 'wtap_wslua_file_info_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7289' => {
                                      'BaseType' => '7302',
                                      'Header' => 'wtap.h',
                                      'Line' => '1727',
                                      'Name' => 'wtap_new_ipv4_callback_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7302' => {
                                      'Name' => 'void(*)(guint const, gchar const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '336'
                                                          },
                                                   '1' => {
                                                            'type' => '374'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7324' => {
                                      'BaseType' => '7337',
                                      'Header' => 'wtap.h',
                                      'Line' => '1731',
                                      'Name' => 'wtap_new_ipv6_callback_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7337' => {
                                      'Name' => 'void(*)(void const*, gchar const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '367'
                                                          },
                                                   '1' => {
                                                            'type' => '374'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7359' => {
                                      'BaseType' => '7372',
                                      'Header' => 'wtap.h',
                                      'Line' => '1739',
                                      'Name' => 'wtap_new_secrets_callback_t',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7372' => {
                                      'Name' => 'void(*)(guint32, void const*, guint)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '223'
                                                          },
                                                   '1' => {
                                                            'type' => '367'
                                                          },
                                                   '2' => {
                                                            'type' => '324'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '740' => {
                                     'Header' => 'nstime.h',
                                     'Line' => '31',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'secs',
                                                          'offset' => '0',
                                                          'type' => '271'
                                                        },
                                                 '1' => {
                                                          'name' => 'nsecs',
                                                          'offset' => '8',
                                                          'type' => '78'
                                                        }
                                               },
                                     'Name' => 'struct nstime_t',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '7439' => {
                                      'Header' => 'wtap.h',
                                      'Line' => '1802',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WTAP_UNCOMPRESSED',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WTAP_GZIP_COMPRESSED',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'WTAP_ZSTD_COMPRESSED',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'WTAP_LZ4_COMPRESSED',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum wtap_compression_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '7452' => {
                                      'BaseType' => '7464',
                                      'Header' => 'wtap-int.h',
                                      'Line' => '28',
                                      'Name' => 'subtype_read_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7464' => {
                                      'Name' => 'gboolean(*)(struct wtap*, wtap_rec*, Buffer*, int*, char**, gint64*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4011'
                                                          },
                                                   '1' => {
                                                            'type' => '7510'
                                                          },
                                                   '2' => {
                                                            'type' => '7516'
                                                          },
                                                   '3' => {
                                                            'type' => '6823'
                                                          },
                                                   '4' => {
                                                            'type' => '6829'
                                                          },
                                                   '5' => {
                                                            'type' => '7522'
                                                          }
                                                 },
                                      'Return' => '312',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '7510' => {
                                      'BaseType' => '6304',
                                      'Name' => 'wtap_rec*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7516' => {
                                      'BaseType' => '692',
                                      'Name' => 'Buffer*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '752' => {
                                     'BaseType' => '764',
                                     'Header' => 'wtap_opttypes.h',
                                     'Line' => '142',
                                     'Name' => 'wtap_block_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '7522' => {
                                      'BaseType' => '235',
                                      'Name' => 'gint64*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '7528' => {
                                      'BaseType' => '7540',
                                      'Header' => 'wtap-int.h',
                                      'Line' => '30',
                                      'Name' => 'subtype_seek_read_func',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '7540' => {
                                      'Name' => 'gboolean(*)(struct wtap*, gint64, wtap_rec*, Buffer*, int*, char**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4011'
                                                          },
                                                   '1' => {
                                                            'type' => '235'
                                                          },
                                                   '2' => {
