$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '9.4.0',
          'Headers' => {
                         '<built-in>' => 1,
                         'FILE.h' => 1,
                         'buffer.h' => 1,
                         'codecs.h' => 1,
                         'crc16-plain.h' => 1,
                         'crc32.h' => 1,
                         'eax.h' => 1,
                         'emmintrin.h' => 1,
                         'feature_list.h' => 1,
                         'filesystem.h' => 1,
                         'garray.h' => 1,
                         'gconvert.h' => 1,
                         'gcrypt.h' => 1,
                         'gerror.h' => 1,
                         'ghash.h' => 1,
                         'giochannel.h' => 1,
                         'glibconfig.h' => 1,
                         'glist.h' => 1,
                         'gmain.h' => 1,
                         'gnutls.h' => 1,
                         'gpg-error.h' => 1,
                         'gquark.h' => 1,
                         'gslist.h' => 1,
                         'gstring.h' => 1,
                         'gtypes.h' => 1,
                         'gunicode.h' => 1,
                         'inet_addr.h' => 1,
                         'inet_ipv4.h' => 1,
                         'inet_ipv6.h' => 1,
                         'jsmn.h' => 1,

                                                    'ws_logv_full' => 1,
                                                    'ws_memmem' => 1,
                                                    'ws_mempbrk_compile' => 1,
                                                    'ws_mempbrk_exec' => 1,
                                                    'ws_optarg' => -8,
                                                    'ws_opterr' => -4,
                                                    'ws_optind' => -4,
                                                    'ws_optopt' => -4,
                                                    'ws_optpos' => -4,
                                                    'ws_optreset' => -4,
                                                    'ws_pipe_data_available' => 1,
                                                    'ws_pipe_init' => 1,
                                                    'ws_pipe_spawn_async' => 1,
                                                    'ws_pipe_spawn_sync' => 1,
                                                    'ws_regex_compile' => 1,
                                                    'ws_regex_compile_ex' => 1,
                                                    'ws_regex_free' => 1,
                                                    'ws_regex_matches' => 1,
                                                    'ws_regex_matches_length' => 1,
                                                    'ws_regex_matches_pos' => 1,
                                                    'ws_regex_pattern' => 1,
                                                    'ws_socket_ptoa' => 1,
                                                    'ws_strcasestr' => 1,
                                                    'ws_strdup_underline' => 1,
                                                    'ws_strerrorname_r' => 1,
                                                    'ws_strptime' => 1,
                                                    'ws_strtoi' => 1,
                                                    'ws_strtoi16' => 1,
                                                    'ws_strtoi32' => 1,
                                                    'ws_strtoi64' => 1,
                                                    'ws_strtoi8' => 1,
                                                    'ws_strtou' => 1,
                                                    'ws_strtou16' => 1,
                                                    'ws_strtou32' => 1,
                                                    'ws_strtou64' => 1,
                                                    'ws_strtou8' => 1,
                                                    'ws_utf8_char_len' => 1,
                                                    'ws_vadd_crash_info' => 1,
                                                    'ws_xton' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '103' => {
                                     'BaseType' => '96',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '10654' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '152',
                                       'Name' => '__off_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10666' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '153',
                                       'Name' => '__off64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10696' => {
                                       'Header' => 'struct_FILE.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_flags',
                                                            'offset' => '0',
                                                            'type' => '78'
                                                          },
                                                   '1' => {
                                                            'name' => '_IO_read_ptr',
                                                            'offset' => '8',
                                                            'type' => '150'
                                                          },
                                                   '10' => {
                                                             'name' => '_IO_backup_base',
                                                             'offset' => '80',
                                                             'type' => '150'
                                                           },
                                                   '11' => {
                                                             'name' => '_IO_save_end',
                                                             'offset' => '88',
                                                             'type' => '150'
                                                           },
                                                   '12' => {
                                                             'name' => '_markers',
                                                             'offset' => '96',
                                                             'type' => '11112'
                                                           },
                                                   '13' => {
                                                             'name' => '_chain',
                                                             'offset' => '104',
                                                             'type' => '11118'
                                                           },
                                                   '14' => {
                                                             'name' => '_fileno',
                                                             'offset' => '112',
                                                             'type' => '78'
                                                           },
                                                   '15' => {
                                                             'name' => '_flags2',
                                                             'offset' => '116',
                                                             'type' => '78'
                                                           },
                                                   '16' => {
                                                             'name' => '_old_offset',
                                                             'offset' => '120',
                                                             'type' => '10654'
                                                           },
                                                   '17' => {
                                                             'name' => '_cur_column',
                                                             'offset' => '128',
                                                             'type' => '71'
                                                           },
                                                   '18' => {
                                                             'name' => '_vtable_offset',
                                                             'offset' => '130',
                                                             'type' => '129'
                                                           },
                                                   '19' => {
                                                             'name' => '_shortbuf',
                                                             'offset' => '131',
                                                             'type' => '11124'
                                                           },
                                                   '2' => {
                                                            'name' => '_IO_read_end',
                                                            'offset' => '16',
                                                            'type' => '150'
                                                          },
                                                   '20' => {
                                                             'name' => '_lock',
                                                             'offset' => '136',
                                                             'type' => '11140'
                                                           },
                                                   '21' => {
                                                             'name' => '_offset',
                                                             'offset' => '144',
                                                             'type' => '10666'
                                                           },
                                                   '22' => {
                                                             'name' => '_codecvt',
                                                             'offset' => '152',
                                                             'type' => '11151'
                                                           },
                                                   '23' => {
                                                             'name' => '_wide_data',
                                                             'offset' => '160',
                                                             'type' => '11162'
                                                           },
                                                   '24' => {
                                                             'name' => '_freeres_list',
                                                             'offset' => '168',
                                                             'type' => '11118'
                                                           },
                                                   '25' => {
                                                             'name' => '_freeres_buf',
                                                             'offset' => '176',
                                                             'type' => '143'
                                                           },
                                                   '26' => {
                                                             'name' => '__pad5',
                                                             'offset' => '184',
                                                             'type' => '52'
                                                           },
                                                   '27' => {
                                                             'name' => '_mode',
                                                             'offset' => '192',
                                                             'type' => '78'
                                                           },
                                                   '28' => {
                                                             'name' => '_unused2',
                                                             'offset' => '196',
                                                             'type' => '11168'
                                                           },
                                                   '3' => {
                                                            'name' => '_IO_read_base',
                                                            'offset' => '24',
                                                            'type' => '150'
                                                          },
                                                   '4' => {
                                                            'name' => '_IO_write_base',
                                                            'offset' => '32',
                                                            'type' => '150'
                                                          },
                                                   '5' => {
                                                            'name' => '_IO_write_ptr',
                                                            'offset' => '40',
                                                            'type' => '150'
                                                          },
                                                   '6' => {
                                                            'name' => '_IO_write_end',
                                                            'offset' => '48',
                                                            'type' => '150'
                                                          },
                                                   '7' => {
                                                            'name' => '_IO_buf_base',
                                                            'offset' => '56',
                                                            'type' => '150'
                                                          },
                                                   '8' => {
                                                            'name' => '_IO_buf_end',
                                                            'offset' => '64',
                                                            'type' => '150'
                                                          },
                                                   '9' => {
                                                            'name' => '_IO_save_base',
                                                            'offset' => '72',
                                                            'type' => '150'
                                                          }
                                                 },
                                       'Name' => 'struct _IO_FILE',
                                       'Size' => '216',
                                       'Type' => 'Struct'
                                     },
                          '107217' => {
                                        'Header' => 'ws_log_defs.h',
                                        'Line' => '49',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'LOG_LEVEL_NONE',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'LOG_LEVEL_NOISY',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'LOG_LEVEL_DEBUG',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'LOG_LEVEL_INFO',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'LOG_LEVEL_MESSAGE',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'LOG_LEVEL_WARNING',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'LOG_LEVEL_CRITICAL',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'LOG_LEVEL_ERROR',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => 'LOG_LEVEL_ECHO',
                                                             'value' => '8'
                                                           },
                                                    '9' => {
                                                             'name' => '_LOG_LEVEL_LAST',
                                                             'value' => '9'
                                                           }
                                                  },
                                        'Name' => 'enum ws_log_level',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '107814' => {
                                        'BaseType' => '107826',
                                        'Header' => 'garray.h',
                                        'Line' => '39',
                                        'Name' => 'GPtrArray',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '107826' => {
                                        'Header' => 'garray.h',
                                        'Line' => '53',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pdata',
                                                             'offset' => '0',
                                                             'type' => '582'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '431'
                                                           }
                                                  },
                                        'Name' => 'struct _GPtrArray',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '108' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '110187' => {
                                        'BaseType' => '107814',
                                        'Name' => 'GPtrArray*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '110193' => {
                                        'Header' => 'buffer.h',
                                        'Line' => '21',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'data',
                                                             'offset' => '0',
                                                             'type' => '576'
                                                           },
                                                    '1' => {
                                                             'name' => 'allocated',
                                                             'offset' => '8',
                                                             'type' => '261'
                                                           },
                                                    '2' => {
                                                             'name' => 'start',
                                                             'offset' => '16',
                                                             'type' => '261'
                                                           },
                                                    '3' => {
                                                             'name' => 'first_free',
                                                             'offset' => '24',
                                                             'type' => '261'
                                                           }
                                                  },
                                        'Name' => 'struct Buffer',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '110259' => {
                                        'BaseType' => '110193',
                                        'Header' => 'buffer.h',
                                        'Line' => '26',
                                        'Name' => 'Buffer',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '11087' => {
                                       'BaseType' => '10696',
                                       'Header' => 'FILE.h',
                                       'Line' => '7',
                                       'Name' => 'FILE',
                                       'Size' => '216',
                                       'Type' => 'Typedef'
                                     },
                          '11099' => {
                                       'BaseType' => '1',
                                       'Header' => 'struct_FILE.h',
                                       'Line' => '43',
                                       'Name' => '_IO_lock_t',
                                       'Type' => 'Typedef'
                                     },
                          '11107' => {
                                       'Name' => 'struct _IO_marker',
                                       'Type' => 'Struct'
                                     },
                          '11112' => {
                                       'BaseType' => '11107',
                                       'Name' => 'struct _IO_marker*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '111174' => {
                                        'BaseType' => '110259',
                                        'Name' => 'Buffer*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11118' => {
                                       'BaseType' => '10696',
                                       'Name' => 'struct _IO_FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11124' => {
                                       'BaseType' => '96',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '11140' => {
                                       'BaseType' => '11099',
                                       'Name' => '_IO_lock_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11146' => {
                                       'Name' => 'struct _IO_codecvt',
                                       'Type' => 'Struct'
                                     },
                          '11151' => {
                                       'BaseType' => '11146',
                                       'Name' => 'struct _IO_codecvt*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11157' => {
                                       'Name' => 'struct _IO_wide_data',
                                       'Type' => 'Struct'
                                     },
                          '11162' => {
                                       'BaseType' => '11157',
                                       'Name' => 'struct _IO_wide_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11168' => {
                                       'BaseType' => '96',
                                       'Name' => 'char[20]',
                                       'Size' => '20',
                                       'Type' => 'Array'
                                     },
                          '11196' => {
                                       'BaseType' => '11087',
                                       'Name' => 'FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '113888' => {
                                        'BaseType' => '113900',
                                        'Header' => 'ghash.h',
                                        'Line' => '37',
                                        'Name' => 'GHashTable',
                                        'Type' => 'Typedef'
                                      },
                          '113900' => {
                                        'Name' => 'struct _GHashTable',
                                        'Type' => 'Struct'
                                      },
                          '115' => {
                                     'Name' => 'long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '115685' => {
                                        'Header' => 'codecs.h',
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'register_codec_module',
                                                             'offset' => '0',
                                                             'type' => '665'
                                                           }
                                                  },
                                        'Name' => 'struct codecs_plugin',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '115697' => {
                                        'BaseType' => '115685',
                                        'Name' => 'codecs_plugin const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '1157' => {
                                      'Name' => 'gboolean(*)(gpointer)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '462'
                                                          }
                                                 },
                                      'Return' => '407',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '115702' => {
                                        'BaseType' => '115714',
                                        'Header' => 'codecs.h',
                                        'Line' => '42',
                                        'Name' => 'codec_handle_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '115714' => {
                                        'BaseType' => '115720',
                                        'Name' => 'struct codec_handle*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '115720' => {
                                        'Line' => '75',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '85'
                                                           },
                                                    '1' => {
                                                             'name' => 'init_fn',
                                                             'offset' => '8',
                                                             'type' => '115812'
                                                           },
                                                    '2' => {
                                                             'name' => 'release_fn',
                                                             'offset' => '16',
                                                             'type' => '115835'
                                                           },
                                                    '3' => {
                                                             'name' => 'channels_fn',
                                                             'offset' => '24',
                                                             'type' => '115847'
                                                           },
                                                    '4' => {
                                                             'name' => 'frequency_fn',
                                                             'offset' => '32',
                                                             'type' => '115880'
                                                           },
                                                    '5' => {
                                                             'name' => 'decode_fn',
                                                             'offset' => '40',
                                                             'type' => '115892'
                                                           }
                                                  },
                                        'Name' => 'struct codec_handle',
                                        'Size' => '48',
                                        'Source' => 'codecs.c',
                                        'Type' => 'Struct'
                                      },
                          '115812' => {
                                        'BaseType' => '115824',
                                        'Header' => 'codecs.h',
                                        'Line' => '58',
                                        'Name' => 'codec_init_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '115824' => {
                                        'Name' => 'void*(*)()',
                                        'Return' => '143',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '115835' => {
                                        'BaseType' => '7842',
                                        'Header' => 'codecs.h',
                                        'Line' => '64',
                                        'Name' => 'codec_release_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '115847' => {
                                        'BaseType' => '115859',
                                        'Header' => 'codecs.h',
                                        'Line' => '72',
                                        'Name' => 'codec_get_channels_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '115859' => {
                                        'Name' => 'unsigned int(*)(void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '143'
                                                            }
                                                   },
                                        'Return' => '45',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '115880' => {
                                        'BaseType' => '115859',
                                        'Header' => 'codecs.h',
                                        'Line' => '80',
                                        'Name' => 'codec_get_frequency_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '115892' => {
                                        'BaseType' => '115904',
                                        'Header' => 'codecs.h',
                                        'Line' => '102',
                                        'Name' => 'codec_decode_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '115904' => {
                                        'Name' => 'size_t(*)(void*, void const*, size_t, void*, size_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '143'
                                                            },
                                                     '1' => {
                                                              'type' => '189'
                                                            },
                                                     '2' => {
                                                              'type' => '52'
                                                            },
                                                     '3' => {
                                                              'type' => '143'
                                                            },
                                                     '4' => {
                                                              'type' => '115945'
                                                            }
                                                   },
                                        'Return' => '52',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '115945' => {
                                        'BaseType' => '52',
                                        'Name' => 'size_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '116521' => {
                                        'BaseType' => '1',
                                        'Header' => 'plugins.h',
                                        'Line' => '23',
                                        'Name' => 'plugins_t',
                                        'Type' => 'Typedef'
                                      },
                          '116584' => {
                                        'BaseType' => '116521',
                                        'Name' => 'plugins_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1178' => {
                                      'BaseType' => '1190',
                                      'Header' => 'gslist.h',
                                      'Line' => '37',
                                      'Name' => 'GSList',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '118040' => {
                                        'BaseType' => '115697',
                                        'Name' => 'codecs_plugin const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1190' => {
                                      'Header' => 'gslist.h',
                                      'Line' => '39',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '462'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '1230'
                                                         }
                                                },
                                      'Name' => 'struct _GSList',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '122' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1230' => {
                                      'BaseType' => '1178',
                                      'Name' => 'GSList*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1236' => {
                                      'BaseType' => '1248',
                                      'Header' => 'gmain.h',
                                      'Line' => '48',
                                      'Name' => 'GMainContext',
                                      'Type' => 'Typedef'
                                    },
                          '1248' => {
                                      'Name' => 'struct _GMainContext',
                                      'Type' => 'Struct'
                                    },
                          '1253' => {
                                      'BaseType' => '1265',
                                      'Header' => 'gmain.h',
                                      'Line' => '64',
                                      'Name' => 'GSource',
                                      'Size' => '96',
                                      'Type' => 'Typedef'
                                    },
                          '1265' => {
                                      'Header' => 'gmain.h',
                                      'Line' => '221',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'callback_data',
                                                           'offset' => '0',
                                                           'type' => '462'
                                                         },
                                                  '1' => {
                                                           'name' => 'callback_funcs',
                                                           'offset' => '8',
                                                           'type' => '1681'
                                                         },
                                                  '10' => {
                                                            'name' => 'next',
                                                            'offset' => '72',
                                                            'type' => '1675'
                                                          },
                                                  '11' => {
                                                            'name' => 'name',
                                                            'offset' => '80',
                                                            'type' => '150'
                                                          },
                                                  '12' => {
                                                            'name' => 'priv',
                                                            'offset' => '88',
                                                            'type' => '1699'
                                                          },
                                                  '2' => {
                                                           'name' => 'source_funcs',
                                                           'offset' => '16',
                                                           'type' => '1687'
                                                         },
                                                  '3' => {
                                                           'name' => 'ref_count',
                                                           'offset' => '24',
                                                           'type' => '431'
                                                         },
                                                  '4' => {
                                                           'name' => 'context',
                                                           'offset' => '32',
                                                           'type' => '1693'
                                                         },
                                                  '5' => {
                                                           'name' => 'priority',
                                                           'offset' => '40',
                                                           'type' => '395'
                                                         },
                                                  '6' => {
                                                           'name' => 'flags',
                                                           'offset' => '44',
                                                           'type' => '431'
                                                         },
                                                  '7' => {
                                                           'name' => 'source_id',
                                                           'offset' => '48',
                                                           'type' => '431'
                                                         },
                                                  '8' => {
                                                           'name' => 'poll_fds',
                                                           'offset' => '56',
                                                           'type' => '1230'
                                                         },
                                                  '9' => {
                                                           'name' => 'prev',
                                                           'offset' => '64',
                                                           'type' => '1675'
                                                         }
                                                },
                                      'Name' => 'struct _GSource',
                                      'Size' => '96',
                                      'Type' => 'Struct'
                                    },
                          '129' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '129816' => {
                                        'BaseType' => '122',
                                        'Name' => 'unsigned char const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '132540' => {
                                        'BaseType' => '220',
                                        'Header' => 'crc16-plain.h',
                                        'Line' => '52',
                                        'Name' => 'crc16_plain_t',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '132879' => {
                                        'BaseType' => '129816',
                                        'Name' => 'unsigned char const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133351' => {
                                        'BaseType' => '122',
                                        'Header' => 'gtypes.h',
                                        'Line' => '52',
                                        'Name' => 'guchar',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '136' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '143' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1448' => {
                                      'BaseType' => '1460',
                                      'Header' => 'gmain.h',
                                      'Line' => '65',
                                      'Name' => 'GSourcePrivate',
                                      'Type' => 'Typedef'
                                    },
                          '1460' => {
                                      'Name' => 'struct _GSourcePrivate',
                                      'Type' => 'Struct'
                                    },
                          '1465' => {
                                      'BaseType' => '1477',
                                      'Header' => 'gmain.h',
                                      'Line' => '77',
                                      'Name' => 'GSourceCallbackFuncs',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '1477' => {
                                      'Header' => 'gmain.h',
                                      'Line' => '246',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ref',
                                                           'offset' => '0',
                                                           'type' => '486'
                                                         },
                                                  '1' => {
                                                           'name' => 'unref',
                                                           'offset' => '8',
                                                           'type' => '486'
                                                         },
                                                  '2' => {
                                                           'name' => 'get',
                                                           'offset' => '16',
                                                           'type' => '1737'
                                                         }
                                                },
                                      'Name' => 'struct _GSourceCallbackFuncs',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '150' => {
                                     'BaseType' => '96',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1530' => {
                                      'BaseType' => '1547',
                                      'Header' => 'gmain.h',
                                      'Line' => '133',
                                      'Name' => 'GSourceFuncs',
                                      'Size' => '48',
                                      'Type' => 'Typedef'
                                    },
                          '1542' => {
                                      'BaseType' => '1530',
                                      'Name' => 'GSourceFuncs const',
                                      'Size' => '48',
                                      'Type' => 'Const'
                                    },
                          '1547' => {
                                      'Header' => 'gmain.h',
                                      'Line' => '264',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'prepare',
                                                           'offset' => '0',
                                                           'type' => '1782'
                                                         },
                                                  '1' => {
                                                           'name' => 'check',
                                                           'offset' => '8',
                                                           'type' => '1803'
                                                         },
                                                  '2' => {
                                                           'name' => 'dispatch',
                                                           'offset' => '16',
                                                           'type' => '1834'
                                                         },
                                                  '3' => {
                                                           'name' => 'finalize',
                                                           'offset' => '24',
                                                           'type' => '1658'
                                                         },
                                                  '4' => {
                                                           'name' => 'closure_callback',
                                                           'offset' => '32',
                                                           'type' => '1646'
                                                         },
                                                  '5' => {
                                                           'name' => 'closure_marshal',
                                                           'offset' => '40',
                                                           'type' => '1743'
                                                         }
                                                },
                                      'Name' => 'struct _GSourceFuncs',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '155999' => {
                                        'BaseType' => '122',
                                        'Name' => 'unsigned char*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '158212' => {
                                        'BaseType' => '133351',
                                        'Name' => 'guchar const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '161067' => {
                                        'BaseType' => '158212',
                                        'Name' => 'guchar const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '161073' => {
                                        'BaseType' => '133351',
                                        'Name' => 'guchar*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '161095' => {
                                        'BaseType' => '208',
                                        'Name' => 'guint8[4]',
                                        'Size' => '4',
                                        'Type' => 'Array'
                                      },
                          '163' => {
                                     'Name' => 'int(*)(void const*, void const*)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '189'
                                                         },
                                                  '1' => {
                                                           'type' => '189'
                                                         }
                                                },
                                     'Return' => '78',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '1646' => {
                                      'BaseType' => '1157',
                                      'Header' => 'gmain.h',
                                      'Line' => '173',
                                      'Name' => 'GSourceFunc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '164924' => {
                                        'Header' => 'eax.h',
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'Mac',
                                                             'offset' => '0',
                                                             'type' => '161095'
                                                           }
                                                  },
                                        'Name' => 'struct tagMAC_T',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '164967' => {
                                        'BaseType' => '164924',
                                        'Header' => 'eax.h',
                                        'Line' => '21',
                                        'Name' => 'MAC_T',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '165022' => {
                                        'BaseType' => '208',
                                        'Name' => 'guint8[16]',
                                        'Size' => '16',
                                        'Type' => 'Array'
                                      },
                          '1658' => {
                                      'Name' => 'void(*)(GSource*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1675'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1675' => {
                                      'BaseType' => '1253',
                                      'Name' => 'GSource*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '167640' => {
                                        'BaseType' => '164967',
                                        'Name' => 'MAC_T*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1681' => {
                                      'BaseType' => '1465',
                                      'Name' => 'GSourceCallbackFuncs*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1687' => {
                                      'BaseType' => '1542',
                                      'Name' => 'GSourceFuncs const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '169043' => {
                                        'BaseType' => '169055',
                                        'Header' => 'glist.h',
                                        'Line' => '37',
                                        'Name' => 'GList',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '169055' => {
                                        'Header' => 'glist.h',
                                        'Line' => '39',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'data',
                                                             'offset' => '0',
                                                             'type' => '462'
                                                           },
                                                    '1' => {
                                                             'name' => 'next',
                                                             'offset' => '8',
                                                             'type' => '169108'
                                                           },
                                                    '2' => {
                                                             'name' => 'prev',
                                                             'offset' => '16',
                                                             'type' => '169108'
                                                           }
                                                  },
                                        'Name' => 'struct _GList',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '169108' => {
                                        'BaseType' => '169043',
                                        'Name' => 'GList*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1693' => {
                                      'BaseType' => '1236',
                                      'Name' => 'GMainContext*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '169875' => {
                                        'BaseType' => '169887',
                                        'Header' => 'gstring.h',
                                        'Line' => '39',
                                        'Name' => 'GString',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '169887' => {
                                        'Header' => 'gstring.h',
                                        'Line' => '41',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'str',
                                                             'offset' => '0',
                                                             'type' => '570'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '261'
                                                           },
                                                    '2' => {
                                                             'name' => 'allocated_len',
                                                             'offset' => '16',
                                                             'type' => '261'
                                                           }
                                                  },
                                        'Name' => 'struct _GString',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '1699' => {
                                      'BaseType' => '1448',
                                      'Name' => 'GSourcePrivate*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '169940' => {
                                        'BaseType' => '169875',
                                        'Name' => 'GString*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '170919' => {
                                        'BaseType' => '170931',
                                        'Header' => 'feature_list.h',
                                        'Line' => '28',
                                        'Name' => 'feature_list',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '170931' => {
                                        'BaseType' => '169108',
                                        'Name' => 'GList**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '172004' => {
                                        'BaseType' => '108',
                                        'Header' => 'types.h',
                                        'Line' => '160',
                                        'Name' => '__time_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '172047' => {
                                        'BaseType' => '108',
                                        'Header' => 'types.h',
                                        'Line' => '193',
                                        'Name' => '__ssize_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '172059' => {
                                        'BaseType' => '108',
                                        'Header' => 'types.h',
                                        'Line' => '196',
                                        'Name' => '__syscall_slong_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '172206' => {
                                        'Header' => 'struct_timespec.h',
                                        'Line' => '10',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tv_sec',
                                                             'offset' => '0',
                                                             'type' => '172004'
                                                           },
                                                    '1' => {
                                                             'name' => 'tv_nsec',
                                                             'offset' => '8',
                                                             'type' => '172059'
                                                           }
                                                  },
                                        'Name' => 'struct timespec',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '172664' => {
                                        'BaseType' => '172047',
                                        'Header' => 'types.h',
                                        'Line' => '108',
                                        'Name' => 'ssize_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '1731' => {
                                      'BaseType' => '1646',
                                      'Name' => 'GSourceFunc*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '173313' => {
                                        'BaseType' => '113888',
                                        'Name' => 'GHashTable const',
                                        'Type' => 'Const'
                                      },
                          '1737' => {
                                      'Name' => 'void(*)(gpointer, GSource*, GSourceFunc*, gpointer*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '462'
                                                          },
                                                   '1' => {
                                                            'type' => '1675'
                                                          },
                                                   '2' => {
                                                            'type' => '1731'
                                                          },
                                                   '3' => {
                                                            'type' => '582'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '174222' => {
                                        'BaseType' => '570',
                                        'Name' => 'gchar**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1743' => {
                                      'BaseType' => '665',
                                      'Header' => 'gmain.h',
                                      'Line' => '262',
                                      'Name' => 'GSourceDummyMarshal',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '176492' => {
                                        'BaseType' => '78',
                                        'Name' => 'int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1776' => {
                                      'BaseType' => '395',
                                      'Name' => 'gint*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1782' => {
                                      'Name' => 'gboolean(*)(GSource*, gint*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1675'
                                                          },
                                                   '1' => {
                                                            'type' => '1776'
                                                          }
                                                 },
                                      'Return' => '407',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1803' => {
                                      'Name' => 'gboolean(*)(GSource*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1675'
                                                          }
                                                 },
                                      'Return' => '407',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '181945' => {
                                        'BaseType' => '173313',
                                        'Name' => 'GHashTable const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1834' => {
                                      'Name' => 'gboolean(*)(GSource*, GSourceFunc, gpointer)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1675'
                                                          },
                                                   '1' => {
                                                            'type' => '1646'
                                                          },
                                                   '2' => {
                                                            'type' => '462'
                                                          }
                                                 },
                                      'Return' => '407',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '189' => {
                                     'BaseType' => '200',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '189099' => {
                                        'Name' => '_Bool',
                                        'Size' => '1',
                                        'Type' => 'Intrinsic'
                                      },
                          '1918' => {
                                      'BaseType' => '1924',
                                      'Name' => 'GError**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '192389' => {
                                        'BaseType' => '122',
                                        'Header' => 'types.h',
                                        'Line' => '38',
                                        'Name' => '__uint8_t',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '1924' => {
                                      'BaseType' => '600',
                                      'Name' => 'GError*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '192408' => {
                                        'BaseType' => '71',
                                        'Header' => 'types.h',
                                        'Line' => '40',
                                        'Name' => '__uint16_t',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '192490' => {
                                        'BaseType' => '192389',
                                        'Header' => 'stdint-uintn.h',
                                        'Line' => '24',
                                        'Name' => 'uint8_t',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '192502' => {
                                        'BaseType' => '192408',
                                        'Header' => 'stdint-uintn.h',
                                        'Line' => '25',
                                        'Name' => 'uint16_t',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '195819' => {
                                        'BaseType' => '237',
                                        'Header' => 'inet_ipv4.h',
                                        'Line' => '15',
                                        'Name' => 'ws_in4_addr',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '195831' => {
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '20',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bytes',
                                                             'offset' => '0',
                                                             'type' => '165022'
                                                           }
                                                  },
                                        'Name' => 'struct e_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '195874' => {
                                        'BaseType' => '195831',
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '22',
                                        'Name' => 'ws_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '196472' => {
                                        'BaseType' => '195874',
                                        'Name' => 'ws_in6_addr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '197376' => {
                                        'BaseType' => '195819',
                                        'Name' => 'ws_in4_addr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '200' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '201724' => {
                                        'BaseType' => '71',
                                        'Header' => 'sockaddr.h',
                                        'Line' => '28',
                                        'Name' => 'sa_family_t',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '203210' => {
                                        'Header' => 'jsmn.h',
                                        'Line' => '46',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'JSMN_UNDEFINED',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'JSMN_OBJECT',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'JSMN_ARRAY',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'JSMN_STRING',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'JSMN_PRIMITIVE',
                                                             'value' => '4'
                                                           }
                                                  },
                                        'Name' => 'enum jsmntype_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '203321' => {
                                        'Header' => 'jsmn.h',
                                        'Line' => '71',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '203210'
                                                           },
                                                    '1' => {
                                                             'name' => 'start',
                                                             'offset' => '4',
                                                             'type' => '78'
                                                           },
                                                    '2' => {
                                                             'name' => 'end',
                                                             'offset' => '8',
                                                             'type' => '78'
                                                           },
                                                    '3' => {
                                                             'name' => 'size',
                                                             'offset' => '12',
                                                             'type' => '78'
                                                           }
                                                  },
                                        'Name' => 'struct jsmntok_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '203900' => {
                                        'BaseType' => '203321',
                                        'Name' => 'jsmntok_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '208' => {
                                     'BaseType' => '122',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '41',
                                     'Name' => 'guint8',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '208274' => {
                                        'Header' => 'json_dumper.h',
                                        'Line' => '53',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'output_file',
                                                             'offset' => '0',
                                                             'type' => '11196'
                                                           },
                                                    '1' => {
                                                             'name' => 'output_string',
                                                             'offset' => '8',
                                                             'type' => '169940'
                                                           },
                                                    '2' => {
                                                             'name' => 'flags',
                                                             'offset' => '16',
                                                             'type' => '78'
                                                           },
                                                    '3' => {
                                                             'name' => 'current_depth',
                                                             'offset' => '20',
                                                             'type' => '78'
                                                           },
                                                    '4' => {
                                                             'name' => 'base64_state',
                                                             'offset' => '24',
                                                             'type' => '395'
                                                           },
                                                    '5' => {
                                                             'name' => 'base64_save',
                                                             'offset' => '28',
                                                             'type' => '395'
                                                           },
                                                    '6' => {
                                                             'name' => 'state',
                                                             'offset' => '32',
                                                             'type' => '208380'
                                                           }
                                                  },
                                        'Name' => 'struct json_dumper',
                                        'Size' => '1136',
                                        'Type' => 'Struct'
                                      },
                          '208380' => {
                                        'BaseType' => '208',
                                        'Name' => 'guint8[1100]',
                                        'Size' => '1100',
                                        'Type' => 'Array'
                                      },
                          '208397' => {
                                        'BaseType' => '208274',
                                        'Header' => 'json_dumper.h',
                                        'Line' => '64',
                                        'Name' => 'json_dumper',
                                        'Size' => '1136',
                                        'Type' => 'Typedef'
                                      },
                          '208854' => {
                                        'BaseType' => '208397',
                                        'Name' => 'json_dumper*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '213406' => {
                                        'BaseType' => '78',
                                        'Name' => 'int const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '216163' => {
                                        'Header' => 'mpeg-audio.h',
                                        'Line' => '17',
                                        'Memb' => {
                                                    '0' => {
                                                             'bitfield' => '2',
                                                             'name' => 'emphasis',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '1' => {
                                                             'bitfield' => '1',
                                                             'name' => 'original',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '10' => {
                                                              'bitfield' => '2',
                                                              'name' => 'layer',
                                                              'offset' => '0',
                                                              'type' => '45'
                                                            },
                                                    '11' => {
                                                              'bitfield' => '2',
                                                              'name' => 'version',
                                                              'offset' => '0',
                                                              'type' => '45'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '11',
                                                              'name' => 'sync',
                                                              'offset' => '0',
                                                              'type' => '45'
                                                            },
                                                    '2' => {
                                                             'bitfield' => '1',
                                                             'name' => 'copyright',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '3' => {
                                                             'bitfield' => '2',
                                                             'name' => 'modeext',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '4' => {
                                                             'bitfield' => '2',
                                                             'name' => 'mode',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '5' => {
                                                             'bitfield' => '1',
                                                             'name' => 'priv',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '6' => {
                                                             'bitfield' => '1',
                                                             'name' => 'padding',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '7' => {
                                                             'bitfield' => '2',
                                                             'name' => 'frequency',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '8' => {
                                                             'bitfield' => '4',
                                                             'name' => 'bitrate',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '9' => {
                                                             'bitfield' => '1',
                                                             'name' => 'protection',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           }
                                                  },
                                        'Name' => 'struct mpa',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '216385' => {
                                        'BaseType' => '216163',
                                        'Name' => 'struct mpa const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '216775' => {
                                        'BaseType' => '216385',
                                        'Name' => 'struct mpa const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '217862' => {
                                        'BaseType' => '108',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '61',
                                        'Name' => 'gint64',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '217898' => {
                                        'BaseType' => '172004',
                                        'Header' => 'time_t.h',
                                        'Line' => '7',
                                        'Name' => 'time_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '217910' => {
                                        'Header' => 'struct_tm.h',
                                        'Line' => '7',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tm_sec',
                                                             'offset' => '0',
                                                             'type' => '78'
                                                           },
                                                    '1' => {
                                                             'name' => 'tm_min',
                                                             'offset' => '4',
                                                             'type' => '78'
                                                           },
                                                    '10' => {
                                                              'name' => 'tm_zone',
                                                              'offset' => '48',
                                                              'type' => '85'
                                                            },
                                                    '2' => {
                                                             'name' => 'tm_hour',
                                                             'offset' => '8',
                                                             'type' => '78'
                                                           },
                                                    '3' => {
                                                             'name' => 'tm_mday',
                                                             'offset' => '12',
                                                             'type' => '78'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_mon',
                                                             'offset' => '16',
                                                             'type' => '78'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_year',
                                                             'offset' => '20',
                                                             'type' => '78'
                                                           },
                                                    '6' => {
                                                             'name' => 'tm_wday',
                                                             'offset' => '24',
                                                             'type' => '78'
                                                           },
                                                    '7' => {
                                                             'name' => 'tm_yday',
                                                             'offset' => '28',
                                                             'type' => '78'
                                                           },
                                                    '8' => {
                                                             'name' => 'tm_isdst',
                                                             'offset' => '32',
                                                             'type' => '78'
                                                           },
                                                    '9' => {
                                                             'name' => 'tm_gmtoff',
                                                             'offset' => '40',
                                                             'type' => '108'
                                                           }
                                                  },
                                        'Name' => 'struct tm',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '220' => {
                                     'BaseType' => '71',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '44',
                                     'Name' => 'guint16',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '22053' => {
                                       'BaseType' => '78',
                                       'Header' => 'glibconfig.h',
                                       'Line' => '51',
                                       'Name' => 'gint32',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '220812' => {
                                        'Header' => 'nstime.h',
                                        'Line' => '31',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'secs',
                                                             'offset' => '0',
                                                             'type' => '217898'
                                                           },
                                                    '1' => {
                                                             'name' => 'nsecs',
                                                             'offset' => '8',
                                                             'type' => '78'
                                                           }
                                                  },
                                        'Name' => 'struct nstime_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '220824' => {
                                        'BaseType' => '220812',
                                        'Name' => 'nstime_t const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '220862' => {
                                        'Header' => 'nstime.h',
                                        'Line' => '130',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ISO8601_DATETIME',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ISO8601_DATETIME_BASIC',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'ISO8601_DATETIME_AUTO',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum iso8601_fmt_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '221299' => {
                                        'BaseType' => '220812',
                                        'Name' => 'nstime_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '222655' => {
                                        'BaseType' => '220824',
                                        'Name' => 'nstime_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '237' => {
                                     'BaseType' => '45',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '52',
                                     'Name' => 'guint32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '241468' => {
                                        'BaseType' => '241485',
                                        'Header' => 'regex.h',
                                        'Line' => '20',
                                        'Name' => 'ws_regex_t',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '241480' => {
                                        'BaseType' => '241468',
                                        'Name' => 'ws_regex_t const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '241485' => {
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'code',
                                                             'offset' => '0',
                                                             'type' => '241604'
                                                           },
                                                    '1' => {
                                                             'name' => 'pattern',
                                                             'offset' => '8',
                                                             'type' => '150'
                                                           }
                                                  },
                                        'Name' => 'struct _ws_regex',
                                        'Size' => '16',
                                        'Source' => 'regex.c',
                                        'Type' => 'Struct'
                                      },
                          '241562' => {
                                        'BaseType' => '241575',
                                        'Header' => 'pcre2.h',
                                        'Line' => '929',
                                        'Name' => 'pcre2_code_8',
                                        'Type' => 'Typedef'
                                      },
                          '241575' => {
                                        'Name' => 'struct pcre2_real_code_8',
                                        'Type' => 'Struct'
                                      },
                          '241604' => {
                                        'BaseType' => '241562',
                                        'Name' => 'pcre2_code_8*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '241658' => {
                                        'BaseType' => '241480',
                                        'Name' => 'ws_regex_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '241760' => {
                                        'BaseType' => '241468',
                                        'Name' => 'ws_regex_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '247996' => {
                                        'BaseType' => '45',
                                        'Header' => 'gpg-error.h',
                                        'Line' => '737',
                                        'Name' => 'gpg_error_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '248021' => {
                                        'BaseType' => '247996',
                                        'Header' => 'gcrypt.h',
                                        'Line' => '135',
                                        'Name' => 'gcry_error_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '248056' => {
                                        'BaseType' => '248069',
                                        'Header' => 'gcrypt.h',
                                        'Line' => '347',
                                        'Name' => 'gcry_sexp_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '248069' => {
                                        'BaseType' => '248075',
                                        'Name' => 'struct gcry_sexp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '248075' => {
                                        'Name' => 'struct gcry_sexp',
                                        'Type' => 'Struct'
                                      },
                          '248317' => {
                                        'BaseType' => '248323',
                                        'Name' => 'struct gnutls_x509_privkey_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '248323' => {
                                        'Name' => 'struct gnutls_x509_privkey_int',
                                        'Type' => 'Struct'
                                      },
                          '248385' => {
                                        'BaseType' => '248317',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1962',
                                        'Name' => 'gnutls_x509_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '249' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '62',
                                     'Name' => 'guint64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '253776' => {
                                        'Header' => 'sober128.h',
                                        'Line' => '29',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'R',
                                                             'offset' => '0',
                                                             'type' => '253885'
                                                           },
                                                    '1' => {
                                                             'name' => 'initR',
                                                             'offset' => '136',
                                                             'type' => '253885'
                                                           },
                                                    '2' => {
                                                             'name' => 'konst',
                                                             'offset' => '272',
                                                             'type' => '64'
                                                           },
                                                    '3' => {
                                                             'name' => 'sbuf',
                                                             'offset' => '280',
                                                             'type' => '64'
                                                           },
                                                    '4' => {
                                                             'name' => 'nbuf',
                                                             'offset' => '288',
                                                             'type' => '78'
                                                           },
                                                    '5' => {
                                                             'name' => 'flag',
                                                             'offset' => '292',
                                                             'type' => '78'
                                                           },
                                                    '6' => {
                                                             'name' => 'set',
                                                             'offset' => '296',
                                                             'type' => '78'
                                                           }
                                                  },
                                        'Name' => 'struct _sober128_prng',
                                        'Size' => '304',
                                        'Type' => 'Struct'
                                      },
                          '253885' => {
                                        'BaseType' => '64',
                                        'Name' => 'unsigned long[17]',
                                        'Size' => '136',
                                        'Type' => 'Array'
                                      },
                          '253915' => {
                                        'BaseType' => '253776',
                                        'Header' => 'sober128.h',
                                        'Line' => '39',
                                        'Name' => 'sober128_prng',
                                        'Size' => '304',
                                        'Type' => 'Typedef'
                                      },
                          '254696' => {
                                        'BaseType' => '253915',
                                        'Name' => 'sober128_prng*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '259461' => {
                                        'Header' => 'socket.h',
                                        'Line' => '191',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ss_family',
                                                             'offset' => '0',
                                                             'type' => '201724'
                                                           },
                                                    '1' => {
                                                             'name' => '__ss_padding',
                                                             'offset' => '2',
                                                             'type' => '259514'
                                                           },
                                                    '2' => {
                                                             'name' => '__ss_align',
                                                             'offset' => '120',
                                                             'type' => '64'
                                                           }
                                                  },
                                        'Name' => 'struct sockaddr_storage',
                                        'Size' => '128',
                                        'Type' => 'Struct'
                                      },
                          '259514' => {
                                        'BaseType' => '96',
                                        'Name' => 'char[118]',
                                        'Size' => '118',
                                        'Type' => 'Array'
                                      },
                          '261' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '78',
                                     'Name' => 'gsize',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '261095' => {
                                        'BaseType' => '259461',
                                        'Name' => 'struct sockaddr_storage*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '264332' => {
                                        'BaseType' => '96',
                                        'Header' => 'strnatcmp.h',
                                        'Line' => '24',
                                        'Name' => 'nat_char',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '264344' => {
                                        'BaseType' => '264332',
                                        'Name' => 'nat_char const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '264453' => {
                                        'BaseType' => '264344',
                                        'Name' => 'nat_char const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '265690' => {
                                        'BaseType' => '108',
                                        'Header' => 'types.h',
                                        'Line' => '44',
                                        'Name' => '__int64_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '265770' => {
                                        'BaseType' => '265690',
                                        'Header' => 'stdint-intn.h',
                                        'Line' => '27',
                                        'Name' => 'int64_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '265877' => {
                                        'BaseType' => '108',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '77',
                                        'Name' => 'gssize',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '269522' => {
                                        'Header' => 'str_util.h',
                                        'Line' => '186',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_NONE',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_BYTES',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_BITS',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_BITS_S',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_BYTES_S',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_PACKETS',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_PACKETS_S',
                                                             'value' => '6'
                                                           }
                                                  },
                                        'Name' => 'enum format_size_units_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '273' => {
                                     'BaseType' => '261',
                                     'Name' => 'gsize const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '275360' => {
                                        'BaseType' => '129',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '40',
                                        'Name' => 'gint8',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '275398' => {
                                        'BaseType' => '136',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '43',
                                        'Name' => 'gint16',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '277228' => {
                                        'BaseType' => '503',
                                        'Name' => 'gchar const**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '279869' => {
                                        'BaseType' => '220',
                                        'Name' => 'guint16*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '280849' => {
                                        'BaseType' => '249',
                                        'Name' => 'guint64*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '281749' => {
                                        'BaseType' => '275360',
                                        'Name' => 'gint8*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '281955' => {
                                        'BaseType' => '275398',
                                        'Name' => 'gint16*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '282161' => {
                                        'BaseType' => '22053',
                                        'Name' => 'gint32*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '282470' => {
                                        'BaseType' => '217862',
                                        'Name' => 'gint64*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '285479' => {
                                        'Header' => 'report_message.h',
                                        'Line' => '32',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'vreport_failure',
                                                             'offset' => '0',
                                                             'type' => '285650'
                                                           },
                                                    '1' => {
                                                             'name' => 'vreport_warning',
                                                             'offset' => '8',
                                                             'type' => '285650'
                                                           },
                                                    '2' => {
                                                             'name' => 'report_open_failure',
                                                             'offset' => '16',
                                                             'type' => '285677'
                                                           },
                                                    '3' => {
                                                             'name' => 'report_read_failure',
                                                             'offset' => '24',
                                                             'type' => '285699'
                                                           },
                                                    '4' => {
                                                             'name' => 'report_write_failure',
                                                             'offset' => '32',
                                                             'type' => '285699'
                                                           },
                                                    '5' => {
                                                             'name' => 'report_cfile_open_failure',
                                                             'offset' => '40',
                                                             'type' => '285726'
                                                           },
                                                    '6' => {
                                                             'name' => 'report_cfile_dump_open_failure',
                                                             'offset' => '48',
                                                             'type' => '285758'
                                                           },
                                                    '7' => {
                                                             'name' => 'report_cfile_read_failure',
                                                             'offset' => '56',
                                                             'type' => '285726'
                                                           },
                                                    '8' => {
                                                             'name' => 'report_cfile_write_failure',
                                                             'offset' => '64',
                                                             'type' => '285800'
                                                           },
                                                    '9' => {
                                                             'name' => 'report_cfile_close_failure',
                                                             'offset' => '72',
                                                             'type' => '285726'
                                                           }
                                                  },
                                        'Name' => 'struct report_message_routines',
                                        'Size' => '80',
                                        'Type' => 'Struct'
                                      },
                          '285623' => {
                                        'BaseType' => '285479',
                                        'Name' => 'struct report_message_routines const',
                                        'Size' => '80',
                                        'Type' => 'Const'
                                      },
                          '285650' => {
                                        'Name' => 'void(*)(char const*, struct __va_list_tag*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '71066'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '285677' => {
                                        'Name' => 'void(*)(char const*, int, gboolean)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '78'
                                                            },
                                                     '2' => {
                                                              'type' => '407'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '285699' => {
                                        'Name' => 'void(*)(char const*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '78'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '285726' => {
                                        'Name' => 'void(*)(char const*, int, gchar*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '78'
                                                            },
                                                     '2' => {
                                                              'type' => '570'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '285758' => {
                                        'Name' => 'void(*)(char const*, int, gchar*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '78'
                                                            },
                                                     '2' => {
                                                              'type' => '570'
                                                            },
                                                     '3' => {
                                                              'type' => '78'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '285800' => {
                                        'Name' => 'void(*)(char const*, char const*, int, gchar*, guint32, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '85'
                                                            },
                                                     '2' => {
                                                              'type' => '78'
                                                            },
                                                     '3' => {
                                                              'type' => '570'
                                                            },
                                                     '4' => {
                                                              'type' => '237'
                                                            },
                                                     '5' => {
                                                              'type' => '78'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '285850' => {
                                        'BaseType' => '285623',
                                        'Name' => 'struct report_message_routines const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2891' => {
                                      'BaseType' => '2903',
                                      'Header' => 'wmem_core.h',
                                      'Line' => '41',
                                      'Name' => 'wmem_allocator_t',
                                      'Type' => 'Typedef'
                                    },
                          '2903' => {
                                      'Header' => 'wmem_allocator.h',
                                      'Line' => '27',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'walloc',
                                                           'offset' => '0',
                                                           'type' => '8133'
                                                         },
                                                  '1' => {
                                                           'name' => 'wfree',
                                                           'offset' => '8',
                                                           'type' => '8155'
                                                         },
                                                  '2' => {
                                                           'name' => 'wrealloc',
                                                           'offset' => '16',
                                                           'type' => '8186'
                                                         },
                                                  '3' => {
                                                           'name' => 'free_all',
                                                           'offset' => '24',
                                                           'type' => '7842'
                                                         },
                                                  '4' => {
                                                           'name' => 'gc',
                                                           'offset' => '32',
                                                           'type' => '7842'
                                                         },
                                                  '5' => {
                                                           'name' => 'cleanup',
                                                           'offset' => '40',
                                                           'type' => '7842'
                                                         },
                                                  '6' => {
                                                           'name' => 'callbacks',
                                                           'offset' => '48',
                                                           'type' => '8197'
                                                         },
                                                  '7' => {
                                                           'name' => 'private_data',
                                                           'offset' => '56',
                                                           'type' => '143'
                                                         },
                                                  '8' => {
                                                           'name' => 'type',
                                                           'offset' => '64',
                                                           'type' => '8016'
                                                         },
                                                  '9' => {
                                                           'name' => 'in_scope',
                                                           'offset' => '68',
                                                           'type' => '407'
                                                         }
                                                },
                                      'Name' => 'struct _wmem_allocator_t',
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '2908' => {
                                      'BaseType' => '2920',
                                      'Header' => 'wmem_array.h',
                                      'Line' => '35',
                                      'Name' => 'wmem_array_t',
                                      'Size' => '40',
                                      'Type' => 'Typedef'
                                    },
                          '2920' => {
                                      'Line' => '27',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'allocator',
                                                           'offset' => '0',
                                                           'type' => '3012'
                                                         },
                                                  '1' => {
                                                           'name' => 'buf',
                                                           'offset' => '8',
                                                           'type' => '576'
                                                         },
                                                  '2' => {
                                                           'name' => 'elem_size',
                                                           'offset' => '16',
                                                           'type' => '261'
                                                         },
                                                  '3' => {
                                                           'name' => 'elem_count',
                                                           'offset' => '24',
                                                           'type' => '431'
                                                         },
                                                  '4' => {
                                                           'name' => 'alloc_count',
                                                           'offset' => '28',
                                                           'type' => '431'
                                                         },
                                                  '5' => {
                                                           'name' => 'null_terminated',
                                                           'offset' => '32',
                                                           'type' => '407'
                                                         }
                                                },
                                      'Name' => 'struct _wmem_array_t',
                                      'Size' => '40',
                                      'Source' => 'wmem_array.c',
                                      'Type' => 'Struct'
                                    },
                          '296780' => {
                                        'BaseType' => '217910',
                                        'Name' => 'struct tm*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '296786' => {
                                        'BaseType' => '296780',
                                        'Name' => 'struct tm*restrict',
                                        'Size' => '8',
                                        'Type' => 'Restrict'
                                      },
                          '296931' => {
                                        'BaseType' => '172206',
                                        'Name' => 'struct timespec*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '297615' => {
                                        'BaseType' => '455',
                                        'Name' => 'double*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '29783' => {
                                       'BaseType' => '143',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3012' => {
                                      'BaseType' => '2891',
                                      'Name' => 'wmem_allocator_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '301606' => {
                                        'BaseType' => '195874',
                                        'Name' => 'ws_in6_addr const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '302323' => {
                                        'BaseType' => '301606',
                                        'Name' => 'ws_in6_addr const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '309231' => {
                                        'BaseType' => '455',
                                        'Header' => 'gtypes.h',
                                        'Line' => '58',
                                        'Name' => 'gdouble',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '3102' => {
                                      'BaseType' => '2908',
                                      'Name' => 'wmem_array_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '315441' => {
                                        'BaseType' => '150',
                                        'Name' => 'char*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '316118' => {
                                        'Header' => 'ws_getopt.h',
                                        'Line' => '42',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '85'
                                                           },
                                                    '1' => {
                                                             'name' => 'has_arg',
                                                             'offset' => '8',
                                                             'type' => '78'
                                                           },
                                                    '2' => {
                                                             'name' => 'flag',
                                                             'offset' => '16',
                                                             'type' => '176492'
                                                           },
                                                    '3' => {
                                                             'name' => 'val',
                                                             'offset' => '24',
                                                             'type' => '78'
                                                           }
                                                  },
                                        'Name' => 'struct ws_option',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '316184' => {
                                        'BaseType' => '316118',
                                        'Name' => 'struct ws_option const',
                                        'Size' => '32',
                                        'Type' => 'Const'
                                      },
                          '316498' => {
                                        'BaseType' => '315441',
                                        'Name' => 'char*const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '316504' => {
                                        'BaseType' => '316184',
                                        'Name' => 'struct ws_option const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '321284' => {
                                        'BaseType' => '321296',
                                        'Header' => 'emmintrin.h',
                                        'Line' => '53',
                                        'Name' => '__m128i',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '321296' => {
                                        'BaseType' => '115',
                                        'Name' => 'long long[2]',
                                        'Size' => '16',
                                        'Type' => 'Array'
                                      },
                          '321360' => {
                                        'BaseType' => '366',
                                        'Name' => 'gchar[256]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '321376' => {
                                        'Header' => 'ws_mempbrk.h',
                                        'Line' => '27',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'patt',
                                                             'offset' => '0',
                                                             'type' => '321360'
                                                           },
                                                    '1' => {
                                                             'name' => 'use_sse42',
                                                             'offset' => '256',
                                                             'type' => '407'
                                                           },
                                                    '2' => {
                                                             'name' => 'mask',
                                                             'offset' => '272',
                                                             'type' => '321284'
                                                           }
                                                  },
                                        'Name' => 'struct ws_mempbrk_pattern',
                                        'Size' => '288',
                                        'Type' => 'Struct'
                                      },
                          '321388' => {
                                        'BaseType' => '321376',
                                        'Name' => 'ws_mempbrk_pattern const',
                                        'Size' => '288',
                                        'Type' => 'Const'
                                      },
                          '321540' => {
                                        'BaseType' => '321388',
                                        'Name' => 'ws_mempbrk_pattern const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '321777' => {
                                        'BaseType' => '321376',
                                        'Name' => 'ws_mempbrk_pattern*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '322915' => {
                                        'BaseType' => '78',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '198',
                                        'Name' => 'GPid',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '323648' => {
                                        'BaseType' => '323660',
                                        'Header' => 'gconvert.h',
                                        'Line' => '83',
                                        'Name' => 'GIConv',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '323660' => {
                                        'BaseType' => '323666',
                                        'Name' => 'struct _GIConv*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '323666' => {
                                        'Name' => 'struct _GIConv',
                                        'Type' => 'Struct'
                                      },
                          '324017' => {
                                        'Header' => 'gmain.h',
                                        'Line' => '39',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'G_IO_IN',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'G_IO_OUT',
                                                             'value' => '4'
                                                           },
                                                    '2' => {
                                                             'name' => 'G_IO_PRI',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'G_IO_ERR',
                                                             'value' => '8'
                                                           },
                                                    '4' => {
                                                             'name' => 'G_IO_HUP',
                                                             'value' => '16'
                                                           },
                                                    '5' => {
                                                             'name' => 'G_IO_NVAL',
                                                             'value' => '32'
                                                           }
                                                  },
                                        'Name' => 'enum GIOCondition',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '324776' => {
                                        'BaseType' => '324788',
                                        'Header' => 'giochannel.h',
                                        'Line' => '41',
                                        'Name' => 'GIOChannel',
                                        'Size' => '112',
                                        'Type' => 'Typedef'
                                      },
                          '324788' => {
                                        'Header' => 'giochannel.h',
                                        'Line' => '97',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ref_count',
                                                             'offset' => '0',
                                                             'type' => '395'
                                                           },
                                                    '1' => {
                                                             'name' => 'funcs',
                                                             'offset' => '8',
                                                             'type' => '325387'
                                                           },
                                                    '10' => {
                                                              'name' => 'write_buf',
                                                              'offset' => '80',
                                                              'type' => '169940'
                                                            },
                                                    '11' => {
                                                              'name' => 'partial_write_buf',
                                                              'offset' => '88',
                                                              'type' => '66847'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '1',
                                                              'name' => 'use_buffer',
                                                              'offset' => '92',
                                                              'type' => '431'
                                                            },
                                                    '13' => {
                                                              'bitfield' => '1',
                                                              'name' => 'do_encode',
                                                              'offset' => '92',
                                                              'type' => '431'
                                                            },
                                                    '14' => {
                                                              'bitfield' => '1',
                                                              'name' => 'close_on_unref',
                                                              'offset' => '92',
                                                              'type' => '431'
                                                            },
                                                    '15' => {
                                                              'bitfield' => '1',
                                                              'name' => 'is_readable',
                                                              'offset' => '92',
                                                              'type' => '431'
                                                            },
                                                    '16' => {
                                                              'bitfield' => '1',
                                                              'name' => 'is_writeable',
                                                              'offset' => '92',
                                                              'type' => '431'
                                                            },
                                                    '17' => {
                                                              'bitfield' => '1',
                                                              'name' => 'is_seekable',
                                                              'offset' => '92',
                                                              'type' => '431'
                                                            },
                                                    '18' => {
                                                              'name' => 'reserved1',
                                                              'offset' => '96',
                                                              'type' => '462'
                                                            },
                                                    '19' => {
                                                              'name' => 'reserved2',
                                                              'offset' => '104',
                                                              'type' => '462'
                                                            },
                                                    '2' => {
                                                             'name' => 'encoding',
                                                             'offset' => '16',
                                                             'type' => '570'
                                                           },
                                                    '3' => {
                                                             'name' => 'read_cd',
                                                             'offset' => '24',
                                                             'type' => '323648'
                                                           },
                                                    '4' => {
                                                             'name' => 'write_cd',
                                                             'offset' => '32',
                                                             'type' => '323648'
                                                           },
                                                    '5' => {
                                                             'name' => 'line_term',
                                                             'offset' => '40',
                                                             'type' => '570'
                                                           },
                                                    '6' => {
                                                             'name' => 'line_term_len',
                                                             'offset' => '48',
                                                             'type' => '431'
                                                           },
                                                    '7' => {
                                                             'name' => 'buf_size',
                                                             'offset' => '56',
                                                             'type' => '261'
                                                           },
                                                    '8' => {
                                                             'name' => 'read_buf',
                                                             'offset' => '64',
                                                             'type' => '169940'
                                                           },
                                                    '9' => {
                                                             'name' => 'encoded_read_buf',
                                                             'offset' => '72',
                                                             'type' => '169940'
                                                           }
                                                  },
                                        'Name' => 'struct _GIOChannel',
                                        'Size' => '112',
                                        'Type' => 'Struct'
                                      },
                          '325080' => {
                                        'BaseType' => '325092',
                                        'Header' => 'giochannel.h',
                                        'Line' => '42',
                                        'Name' => 'GIOFuncs',
                                        'Size' => '64',
                                        'Type' => 'Typedef'
                                      },
                          '325092' => {
                                        'Header' => 'giochannel.h',
                                        'Line' => '131',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'io_read',
                                                             'offset' => '0',
                                                             'type' => '325474'
                                                           },
                                                    '1' => {
                                                             'name' => 'io_write',
                                                             'offset' => '8',
                                                             'type' => '325515'
                                                           },
                                                    '2' => {
                                                             'name' => 'io_seek',
                                                             'offset' => '16',
                                                             'type' => '325551'
                                                           },
                                                    '3' => {
                                                             'name' => 'io_close',
                                                             'offset' => '24',
                                                             'type' => '325577'
                                                           },
                                                    '4' => {
                                                             'name' => 'io_create_watch',
                                                             'offset' => '32',
                                                             'type' => '325603'
                                                           },
                                                    '5' => {
                                                             'name' => 'io_free',
                                                             'offset' => '40',
                                                             'type' => '325620'
                                                           },
                                                    '6' => {
                                                             'name' => 'io_set_flags',
                                                             'offset' => '48',
                                                             'type' => '325651'
                                                           },
                                                    '7' => {
                                                             'name' => 'io_get_flags',
                                                             'offset' => '56',
                                                             'type' => '325672'
                                                           }
                                                  },
                                        'Name' => 'struct _GIOFuncs',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '325249' => {
                                        'Header' => 'giochannel.h',
                                        'Line' => '75',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'G_IO_STATUS_ERROR',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'G_IO_STATUS_NORMAL',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'G_IO_STATUS_EOF',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'G_IO_STATUS_AGAIN',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum GIOStatus',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '325294' => {
                                        'Header' => 'giochannel.h',
                                        'Line' => '82',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'G_SEEK_CUR',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'G_SEEK_SET',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'G_SEEK_END',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum GSeekType',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '325375' => {
                                        'Header' => 'giochannel.h',
                                        'Line' => '95',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'G_IO_FLAG_APPEND',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'G_IO_FLAG_NONBLOCK',
                                                             'value' => '2'
                                                           },
                                                    '2' => {
                                                             'name' => 'G_IO_FLAG_IS_READABLE',
                                                             'value' => '4'
                                                           },
                                                    '3' => {
                                                             'name' => 'G_IO_FLAG_IS_WRITABLE',
                                                             'value' => '8'
                                                           },
                                                    '4' => {
                                                             'name' => 'G_IO_FLAG_IS_WRITEABLE',
                                                             'value' => '8'
                                                           },
                                                    '5' => {
                                                             'name' => 'G_IO_FLAG_IS_SEEKABLE',
                                                             'value' => '16'
                                                           },
                                                    '6' => {
                                                             'name' => 'G_IO_FLAG_MASK',
                                                             'value' => '31'
                                                           },
                                                    '7' => {
                                                             'name' => 'G_IO_FLAG_GET_MASK',
                                                             'value' => '31'
                                                           },
                                                    '8' => {
                                                             'name' => 'G_IO_FLAG_SET_MASK',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum GIOFlags',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '325387' => {
                                        'BaseType' => '325080',
                                        'Name' => 'GIOFuncs*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '325415' => {
                                        'BaseType' => '324776',
                                        'Name' => 'GIOChannel*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '325456' => {
                                        'BaseType' => '261',
                                        'Name' => 'gsize*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '325474' => {
                                        'Name' => 'GIOStatus(*)(GIOChannel*, gchar*, gsize, gsize*, GError**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '325415'
                                                            },
                                                     '1' => {
                                                              'type' => '570'
                                                            },
                                                     '2' => {
                                                              'type' => '261'
                                                            },
                                                     '3' => {
                                                              'type' => '325456'
                                                            },
                                                     '4' => {
                                                              'type' => '1918'
                                                            }
                                                   },
                                        'Return' => '325249',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '325515' => {
                                        'Name' => 'GIOStatus(*)(GIOChannel*, gchar const*, gsize, gsize*, GError**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '325415'
                                                            },
                                                     '1' => {
                                                              'type' => '503'
                                                            },
                                                     '2' => {
                                                              'type' => '261'
                                                            },
                                                     '3' => {
                                                              'type' => '325456'
                                                            },
                                                     '4' => {
                                                              'type' => '1918'
                                                            }
                                                   },
                                        'Return' => '325249',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '325551' => {
                                        'Name' => 'GIOStatus(*)(GIOChannel*, gint64, GSeekType, GError**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '325415'
                                                            },
                                                     '1' => {
                                                              'type' => '217862'
                                                            },
                                                     '2' => {
                                                              'type' => '325294'
                                                            },
                                                     '3' => {
                                                              'type' => '1918'
                                                            }
                                                   },
                                        'Return' => '325249',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '325577' => {
                                        'Name' => 'GIOStatus(*)(GIOChannel*, GError**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '325415'
                                                            },
                                                     '1' => {
                                                              'type' => '1918'
                                                            }
                                                   },
                                        'Return' => '325249',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '325603' => {
                                        'Name' => 'GSource*(*)(GIOChannel*, GIOCondition)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '325415'
                                                            },
                                                     '1' => {
                                                              'type' => '324017'
                                                            }
                                                   },
                                        'Return' => '1675',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '325620' => {
                                        'Name' => 'void(*)(GIOChannel*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '325415'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '325651' => {
                                        'Name' => 'GIOStatus(*)(GIOChannel*, GIOFlags, GError**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '325415'
                                                            },
                                                     '1' => {
                                                              'type' => '325375'
                                                            },
                                                     '2' => {
                                                              'type' => '1918'
                                                            }
                                                   },
                                        'Return' => '325249',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '325672' => {
                                        'Name' => 'GIOFlags(*)(GIOChannel*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '325415'
                                                            }
                                                   },
                                        'Return' => '325375',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '326835' => {
                                        'Header' => 'ws_pipe.h',
                                        'Line' => '30',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pid',
                                                             'offset' => '0',
                                                             'type' => '322915'
                                                           },
                                                    '1' => {
                                                             'name' => 'stdin_io',
                                                             'offset' => '8',
                                                             'type' => '325415'
                                                           },
                                                    '2' => {
                                                             'name' => 'stdout_io',
                                                             'offset' => '16',
                                                             'type' => '325415'
                                                           },
                                                    '3' => {
                                                             'name' => 'stderr_io',
                                                             'offset' => '24',
                                                             'type' => '325415'
                                                           }
                                                  },
                                        'Name' => 'struct _ws_pipe_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '326901' => {
                                        'BaseType' => '326835',
                                        'Header' => 'ws_pipe.h',
                                        'Line' => '35',
                                        'Name' => 'ws_pipe_t',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '328170' => {
                                        'BaseType' => '326901',
                                        'Name' => 'ws_pipe_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '346849' => {
                                        'BaseType' => '309231',
                                        'Name' => 'gdouble*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '349225' => {
                                        'BaseType' => '192490',
                                        'Name' => 'uint8_t const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '353001' => {
                                        'BaseType' => '353013',
                                        'Header' => 'wslog.h',
                                        'Line' => '50',
                                        'Name' => 'ws_log_writer_cb',
                                        'Type' => 'Typedef'
                                      },
                          '353013' => {
                                        'Name' => 'void(char const*, enum ws_log_level, struct timespec, char const*, long, char const*, char const*, struct __va_list_tag*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '107217'
                                                            },
                                                     '2' => {
                                                              'type' => '172206'
                                                            },
                                                     '3' => {
                                                              'type' => '85'
                                                            },
                                                     '4' => {
                                                              'type' => '108'
                                                            },
                                                     '5' => {
                                                              'type' => '85'
                                                            },
                                                     '6' => {
                                                              'type' => '85'
                                                            },
                                                     '7' => {
                                                              'type' => '71066'
                                                            },
                                                     '8' => {
                                                              'type' => '143'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Type' => 'Func'
                                      },
                          '353070' => {
                                        'BaseType' => '7831',
                                        'Header' => 'wslog.h',
                                        'Line' => '58',
                                        'Name' => 'ws_log_writer_free_data_cb',
                                        'Type' => 'Typedef'
                                      },
                          '353421' => {
                                        'BaseType' => '353001',
                                        'Name' => 'ws_log_writer_cb*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '353471' => {
                                        'BaseType' => '353070',
                                        'Name' => 'ws_log_writer_free_data_cb*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '355927' => {
                                        'BaseType' => '349225',
                                        'Name' => 'uint8_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '36499' => {
                                       'BaseType' => '85',
                                       'Name' => 'char const*restrict',
                                       'Size' => '8',
                                       'Type' => 'Restrict'
                                     },
                          '366' => {
                                     'BaseType' => '96',
                                     'Header' => 'gtypes.h',
                                     'Line' => '46',
                                     'Name' => 'gchar',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '369307' => {
                                        'BaseType' => '56348',
                                        'Name' => 'guint32 const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '37129' => {
                                       'BaseType' => '249',
                                       'Name' => 'guint64 const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '373659' => {
                                        'Header' => 'plugins.h',
                                        'Line' => '29',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'WS_PLUGIN_EPAN',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'WS_PLUGIN_WIRETAP',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'WS_PLUGIN_CODEC',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum plugin_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '373671' => {
                                        'BaseType' => '373683',
                                        'Header' => 'plugins.h',
                                        'Line' => '33',
                                        'Name' => 'plugin_description_callback',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '373683' => {
                                        'Name' => 'void(*)(char const*, char const*, char const*, char const*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '85'
                                                            },
                                                     '2' => {
                                                              'type' => '85'
                                                            },
                                                     '3' => {
                                                              'type' => '85'
                                                            },
                                                     '4' => {
                                                              'type' => '143'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '378' => {
                                     'BaseType' => '366',
                                     'Name' => 'gchar const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '395' => {
                                     'BaseType' => '78',
                                     'Header' => 'gtypes.h',
                                     'Line' => '49',
                                     'Name' => 'gint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '39810' => {
                                       'BaseType' => '39822',
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_tree_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '39822' => {
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'metadata_allocator',
                                                            'offset' => '0',
                                                            'type' => '3012'
                                                          },
                                                   '1' => {
                                                            'name' => 'data_allocator',
                                                            'offset' => '8',
                                                            'type' => '3012'
                                                          },
                                                   '2' => {
                                                            'name' => 'root',
                                                            'offset' => '16',
                                                            'type' => '40099'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata_scope_cb_id',
                                                            'offset' => '24',
                                                            'type' => '431'
                                                          },
                                                   '4' => {
                                                            'name' => 'data_scope_cb_id',
                                                            'offset' => '28',
                                                            'type' => '431'
                                                          },
                                                   '5' => {
                                                            'name' => 'post_rotation_cb',
                                                            'offset' => '32',
                                                            'type' => '40116'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_tree_t',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '39914' => {
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '22',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'WMEM_NODE_COLOR_RED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'WMEM_NODE_COLOR_BLACK',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum _wmem_node_color_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '39945' => {
                                       'BaseType' => '39914',
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '25',
                                       'Name' => 'wmem_node_color_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '39957' => {
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '28',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent',
                                                            'offset' => '0',
                                                            'type' => '40075'
                                                          },
                                                   '1' => {
                                                            'name' => 'left',
                                                            'offset' => '8',
                                                            'type' => '40075'
                                                          },
                                                   '2' => {
                                                            'name' => 'right',
                                                            'offset' => '16',
                                                            'type' => '40075'
                                                          },
                                                   '3' => {
                                                            'name' => 'key',
                                                            'offset' => '24',
                                                            'type' => '189'
                                                          },
                                                   '4' => {
                                                            'name' => 'data',
                                                            'offset' => '32',
                                                            'type' => '143'
                                                          },
                                                   '5' => {
                                                            'name' => 'color',
                                                            'offset' => '40',
                                                            'type' => '39945'
                                                          },
                                                   '6' => {
                                                            'name' => 'is_subtree',
                                                            'offset' => '44',
                                                            'type' => '407'
                                                          },
                                                   '7' => {
                                                            'name' => 'is_removed',
                                                            'offset' => '48',
                                                            'type' => '407'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_tree_node_t',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '40075' => {
                                       'BaseType' => '39957',
                                       'Name' => 'struct _wmem_tree_node_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40081' => {
                                       'BaseType' => '39957',
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '43',
                                       'Name' => 'wmem_tree_node_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '40099' => {
                                       'BaseType' => '40081',
                                       'Name' => 'wmem_tree_node_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40116' => {
                                       'Name' => 'void(*)(wmem_tree_node_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '40099'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '40204' => {
                                       'BaseType' => '40216',
                                       'Header' => 'wmem_list.h',
                                       'Line' => '36',
                                       'Name' => 'wmem_list_t',
                                       'Type' => 'Typedef'
                                     },
                          '40216' => {
                                       'Line' => '23',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'count',
                                                            'offset' => '0',
                                                            'type' => '431'
                                                          },
                                                   '1' => {
                                                            'name' => 'head',
                                                            'offset' => '8',
                                                            'type' => '44996'
                                                          },
                                                   '2' => {
                                                            'name' => 'tail',
                                                            'offset' => '16',
                                                            'type' => '44996'
                                                          },
                                                   '3' => {
                                                            'name' => 'allocator',
                                                            'offset' => '24',
                                                            'type' => '3012'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_list_t',
                                       'Size' => '32',
                                       'Source' => 'wmem_list.c',
                                       'Type' => 'Struct'
                                     },
                          '40221' => {
                                       'BaseType' => '39822',
                                       'Header' => 'wmem_interval_tree.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_itree_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '40323' => {
                                       'BaseType' => '39810',
                                       'Name' => 'wmem_tree_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40524' => {
                                       'BaseType' => '40204',
                                       'Name' => 'wmem_list_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40530' => {
                                       'BaseType' => '40221',
                                       'Name' => 'wmem_itree_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '407' => {
                                     'BaseType' => '395',
                                     'Header' => 'gtypes.h',
                                     'Line' => '50',
                                     'Name' => 'gboolean',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '42311' => {
                                       'BaseType' => '189',
                                       'Header' => 'gtypes.h',
                                       'Line' => '104',
                                       'Name' => 'gconstpointer',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42330' => {
                                       'BaseType' => '42342',
                                       'Header' => 'gtypes.h',
                                       'Line' => '106',
                                       'Name' => 'GCompareFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42342' => {
                                       'Name' => 'gint(*)(gconstpointer, gconstpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '42311'
                                                           },
                                                    '1' => {
                                                             'type' => '42311'
                                                           }
                                                  },
                                       'Return' => '395',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '42397' => {
                                       'BaseType' => '42409',
                                       'Header' => 'gtypes.h',
                                       'Line' => '114',
                                       'Name' => 'GFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42409' => {
                                       'Name' => 'void(*)(gpointer, gpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '462'
                                                           },
                                                    '1' => {
                                                             'type' => '462'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '431' => {
                                     'BaseType' => '45',
                                     'Header' => 'gtypes.h',
                                     'Line' => '55',
                                     'Name' => 'guint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '443' => {
                                     'BaseType' => '431',
                                     'Name' => 'guint const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '44849' => {
                                       'BaseType' => '40204',
                                       'Name' => 'wmem_list_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '44920' => {
                                       'BaseType' => '44937',
                                       'Header' => 'wmem_list.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_list_frame_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '44932' => {
                                       'BaseType' => '44920',
                                       'Name' => 'wmem_list_frame_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '44937' => {
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '44990'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '44990'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '16',
                                                            'type' => '143'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_list_frame_t',
                                       'Size' => '24',
                                       'Source' => 'wmem_list.c',
                                       'Type' => 'Struct'
                                     },
                          '44990' => {
                                       'BaseType' => '44937',
                                       'Name' => 'struct _wmem_list_frame_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44996' => {
                                       'BaseType' => '44920',
                                       'Name' => 'wmem_list_frame_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '455' => {
                                     'Name' => 'double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '462' => {
                                     'BaseType' => '143',
                                     'Header' => 'gtypes.h',
                                     'Line' => '103',
                                     'Name' => 'gpointer',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '46250' => {
                                       'BaseType' => '44932',
                                       'Name' => 'wmem_list_frame_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46403' => {
                                       'BaseType' => '44849',
                                       'Name' => 'wmem_list_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46655' => {
                                       'BaseType' => '208',
                                       'Name' => 'guint8 const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '46980' => {
                                       'BaseType' => '46992',
                                       'Header' => 'gtypes.h',
                                       'Line' => '111',
                                       'Name' => 'GEqualFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46992' => {
                                       'Name' => 'gboolean(*)(gconstpointer, gconstpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '42311'
                                                           },
                                                    '1' => {
                                                             'type' => '42311'
                                                           }
                                                  },
                                       'Return' => '407',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '47047' => {
                                       'BaseType' => '47059',
                                       'Header' => 'gtypes.h',
                                       'Line' => '116',
                                       'Name' => 'GHashFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '47059' => {
                                       'Name' => 'guint(*)(gconstpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '42311'
                                                           }
                                                  },
                                       'Return' => '431',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '47080' => {
                                       'BaseType' => '47092',
                                       'Header' => 'gtypes.h',
                                       'Line' => '117',
                                       'Name' => 'GHFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '47092' => {
                                       'Name' => 'void(*)(gpointer, gpointer, gpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '462'
                                                           },
                                                    '1' => {
                                                             'type' => '462'
                                                           },
                                                    '2' => {
                                                             'type' => '462'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '486' => {
                                     'Name' => 'void(*)(gpointer)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '462'
                                                         }
                                                },
                                     'Return' => '1',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '49542' => {
                                       'BaseType' => '49554',
                                       'Header' => 'wmem_map.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_map_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '49554' => {
                                       'Line' => '44',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'count',
                                                            'offset' => '0',
                                                            'type' => '431'
                                                          },
                                                   '1' => {
                                                            'name' => 'capacity',
                                                            'offset' => '8',
                                                            'type' => '52'
                                                          },
                                                   '2' => {
                                                            'name' => 'table',
                                                            'offset' => '16',
                                                            'type' => '49869'
                                                          },
                                                   '3' => {
                                                            'name' => 'hash_func',
                                                            'offset' => '24',
                                                            'type' => '47047'
                                                          },
                                                   '4' => {
                                                            'name' => 'eql_func',
                                                            'offset' => '32',
                                                            'type' => '46980'
                                                          },
                                                   '5' => {
                                                            'name' => 'metadata_scope_cb_id',
                                                            'offset' => '40',
                                                            'type' => '431'
                                                          },
                                                   '6' => {
                                                            'name' => 'data_scope_cb_id',
                                                            'offset' => '44',
                                                            'type' => '431'
                                                          },
                                                   '7' => {
                                                            'name' => 'metadata_allocator',
                                                            'offset' => '48',
                                                            'type' => '3012'
                                                          },
                                                   '8' => {
                                                            'name' => 'data_allocator',
                                                            'offset' => '56',
                                                            'type' => '3012'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_map_t',
                                       'Size' => '64',
                                       'Source' => 'wmem_map.c',
                                       'Type' => 'Struct'
                                     },
                          '49716' => {
                                       'BaseType' => '8076',
                                       'Header' => 'wmem_user_cb.h',
                                       'Line' => '34',
                                       'Name' => 'wmem_cb_event_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '49798' => {
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'key',
                                                            'offset' => '0',
                                                            'type' => '189'
                                                          },
                                                   '1' => {
                                                            'name' => 'value',
                                                            'offset' => '8',
                                                            'type' => '143'
                                                          },
                                                   '2' => {
                                                            'name' => 'next',
                                                            'offset' => '16',
                                                            'type' => '49851'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_map_item_t',
                                       'Size' => '24',
                                       'Source' => 'wmem_map.c',
                                       'Type' => 'Struct'
                                     },
                          '49851' => {
                                       'BaseType' => '49798',
                                       'Name' => 'struct _wmem_map_item_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '49857' => {
                                       'BaseType' => '49798',
                                       'Line' => '42',
                                       'Name' => 'wmem_map_item_t',
                                       'Size' => '24',
                                       'Source' => 'wmem_map.c',
                                       'Type' => 'Typedef'
                                     },
                          '49869' => {
                                       'BaseType' => '49875',
                                       'Name' => 'wmem_map_item_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '49875' => {
                                       'BaseType' => '49857',
                                       'Name' => 'wmem_map_item_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5002' => {
                                      'BaseType' => '52',
                                      'Name' => 'size_t const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '50245' => {
                                       'BaseType' => '46655',
                                       'Name' => 'guint8 const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '503' => {
                                     'BaseType' => '378',
                                     'Name' => 'gchar const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '50307' => {
                                       'BaseType' => '49542',
                                       'Name' => 'wmem_map_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51202' => {
                                       'BaseType' => '189',
                                       'Name' => 'void const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52' => {
                                    'BaseType' => '64',
                                    'Header' => 'stddef.h',
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '56348' => {
                                       'BaseType' => '237',
                                       'Name' => 'guint32 const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '570' => {
                                     'BaseType' => '366',
                                     'Name' => 'gchar*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '576' => {
                                     'BaseType' => '208',
                                     'Name' => 'guint8*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '582' => {
                                     'BaseType' => '462',
                                     'Name' => 'gpointer*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '588' => {
                                     'BaseType' => '237',
                                     'Header' => 'gquark.h',
                                     'Line' => '36',
                                     'Name' => 'GQuark',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '59163' => {
                                       'BaseType' => '59175',
                                       'Header' => 'wmem_multimap.h',
                                       'Line' => '49',
                                       'Name' => 'wmem_multimap_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '59175' => {
                                       'Line' => '23',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'map',
                                                            'offset' => '0',
                                                            'type' => '50307'
                                                          },
                                                   '1' => {
                                                            'name' => 'metadata_scope_cb_id',
                                                            'offset' => '8',
                                                            'type' => '431'
                                                          },
                                                   '2' => {
                                                            'name' => 'data_scope_cb_id',
                                                            'offset' => '12',
                                                            'type' => '431'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata_allocator',
                                                            'offset' => '16',
                                                            'type' => '3012'
                                                          },
                                                   '4' => {
                                                            'name' => 'data_allocator',
                                                            'offset' => '24',
                                                            'type' => '3012'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_multimap_t',
                                       'Size' => '32',
                                       'Source' => 'wmem_multimap.c',
                                       'Type' => 'Struct'
                                     },
                          '59486' => {
                                       'BaseType' => '59163',
                                       'Name' => 'wmem_multimap_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '600' => {
                                     'BaseType' => '612',
                                     'Header' => 'gerror.h',
                                     'Line' => '41',
                                     'Name' => 'GError',
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '60457' => {
                                       'BaseType' => '431',
                                       'Name' => 'guint*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '612' => {
                                     'Header' => 'gerror.h',
                                     'Line' => '43',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'domain',
                                                          'offset' => '0',
                                                          'type' => '588'
                                                        },
                                                 '1' => {
                                                          'name' => 'code',
                                                          'offset' => '4',
                                                          'type' => '395'
                                                        },
                                                 '2' => {
                                                          'name' => 'message',
                                                          'offset' => '8',
                                                          'type' => '570'
                                                        }
                                               },
                                     'Name' => 'struct _GError',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '64' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '64356' => {
                                       'BaseType' => '40204',
                                       'Header' => 'wmem_stack.h',
                                       'Line' => '35',
                                       'Name' => 'wmem_stack_t',
                                       'Type' => 'Typedef'
                                     },
                          '64368' => {
                                       'BaseType' => '64356',
                                       'Name' => 'wmem_stack_t const',
                                       'Type' => 'Const'
                                     },
                          '64498' => {
                                       'BaseType' => '64356',
                                       'Name' => 'wmem_stack_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '64729' => {
                                       'BaseType' => '64368',
                                       'Name' => 'wmem_stack_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '65420' => {
                                       'Header' => '<built-in>',
                                       'Line' => '0',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'gp_offset',
                                                            'offset' => '0',
                                                            'type' => '45'
                                                          },
                                                   '1' => {
                                                            'name' => 'fp_offset',
                                                            'offset' => '4',
                                                            'type' => '45'
                                                          },
                                                   '2' => {
                                                            'name' => 'overflow_arg_area',
                                                            'offset' => '8',
                                                            'type' => '143'
                                                          },
                                                   '3' => {
                                                            'name' => 'reg_save_area',
                                                            'offset' => '16',
                                                            'type' => '143'
                                                          }
                                                 },
                                       'Name' => 'struct __va_list_tag',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '665' => {
                                     'Name' => 'void(*)()',
                                     'Return' => '1',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '66817' => {
                                       'BaseType' => '237',
                                       'Header' => 'gunicode.h',
                                       'Line' => '59',
                                       'Name' => 'gunichar',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '66829' => {
                                       'BaseType' => '66817',
                                       'Name' => 'gunichar const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '66847' => {
                                       'BaseType' => '366',
                                       'Name' => 'gchar[6]',
                                       'Size' => '6',
                                       'Type' => 'Array'
                                     },
                          '67922' => {
                                       'Header' => 'wmem_strbuf.h',
                                       'Line' => '43',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'allocator',
                                                            'offset' => '0',
                                                            'type' => '3012'
                                                          },
                                                   '1' => {
                                                            'name' => 'str',
                                                            'offset' => '8',
                                                            'type' => '570'
                                                          },
                                                   '2' => {
                                                            'name' => 'len',
                                                            'offset' => '16',
                                                            'type' => '261'
                                                          },
                                                   '3' => {
                                                            'name' => 'alloc_len',
                                                            'offset' => '24',
                                                            'type' => '261'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_len',
                                                            'offset' => '32',
                                                            'type' => '261'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_strbuf_t',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '68007' => {
                                       'BaseType' => '67922',
                                       'Header' => 'wmem_strbuf.h',
                                       'Line' => '54',
                                       'Name' => 'wmem_strbuf_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '68019' => {
                                       'BaseType' => '68007',
                                       'Name' => 'wmem_strbuf_t const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '68680' => {
                                       'BaseType' => '68007',
                                       'Name' => 'wmem_strbuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68888' => {
                                       'BaseType' => '68019',
                                       'Name' => 'wmem_strbuf_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '71066' => {
                                       'BaseType' => '65420',
                                       'Name' => 'struct __va_list_tag*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '78' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '7831' => {
                                      'Name' => 'void(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Type' => 'Func'
                                    },
                          '7842' => {
                                      'Name' => 'void(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '78561' => {
                                       'BaseType' => '150',
                                       'Name' => 'char**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '8016' => {
                                      'Header' => 'wmem_core.h',
                                      'Line' => '44',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WMEM_ALLOCATOR_SIMPLE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WMEM_ALLOCATOR_BLOCK',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'WMEM_ALLOCATOR_STRICT',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'WMEM_ALLOCATOR_BLOCK_FAST',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum _wmem_allocator_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8059' => {
                                      'BaseType' => '8016',
                                      'Header' => 'wmem_core.h',
                                      'Line' => '62',
                                      'Name' => 'wmem_allocator_type_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8071' => {
                                      'BaseType' => '8059',
                                      'Name' => 'wmem_allocator_type_t const',
                                      'Size' => '4',
                                      'Type' => 'Const'
                                    },
                          '8076' => {
                                      'Header' => 'wmem_user_cb.h',
                                      'Line' => '31',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WMEM_CB_FREE_EVENT',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WMEM_CB_DESTROY_EVENT',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum _wmem_cb_event_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8133' => {
                                      'Name' => 'void*(*)(void*, size_t const)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          },
                                                   '1' => {
                                                            'type' => '5002'
                                                          }
                                                 },
                                      'Return' => '143',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8155' => {
                                      'Name' => 'void(*)(void*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          },
                                                   '1' => {
                                                            'type' => '143'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8186' => {
                                      'Name' => 'void*(*)(void*, void*, size_t const)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          },
                                                   '1' => {
                                                            'type' => '143'
                                                          },
                                                   '2' => {
                                                            'type' => '5002'
                                                          }
                                                 },
                                      'Return' => '143',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8192' => {
                                      'Line' => '18',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cb',
                                                           'offset' => '0',
                                                           'type' => '93503'
                                                         },
                                                  '1' => {
                                                           'name' => 'user_data',
                                                           'offset' => '8',
                                                           'type' => '143'
                                                         },
                                                  '2' => {
                                                           'name' => 'next',
                                                           'offset' => '16',
                                                           'type' => '8197'
                                                         },
                                                  '3' => {
                                                           'name' => 'id',
                                                           'offset' => '24',
                                                           'type' => '431'
                                                         }
                                                },
                                      'Name' => 'struct _wmem_user_cb_container_t',
                                      'Size' => '32',
                                      'Source' => 'wmem_user_cb.c',
                                      'Type' => 'Struct'
                                    },
                          '8197' => {
                                      'BaseType' => '8192',
                                      'Name' => 'struct _wmem_user_cb_container_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '82363' => {
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '144',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '237'
                                                          },
                                                   '1' => {
                                                            'name' => 'key',
                                                            'offset' => '8',
                                                            'type' => '82403'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_tree_key_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '82403' => {
                                       'BaseType' => '237',
                                       'Name' => 'guint32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '82409' => {
                                       'BaseType' => '82363',
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '147',
                                       'Name' => 'wmem_tree_key_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '82421' => {
                                       'BaseType' => '82433',
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '213',
                                       'Name' => 'wmem_foreach_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '82433' => {
                                       'Name' => 'gboolean(*)(void const*, void*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '189'
                                                           },
                                                    '1' => {
                                                             'type' => '143'
                                                           },
                                                    '2' => {
                                                             'type' => '143'
                                                           }
                                                  },
                                       'Return' => '407',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '82464' => {
                                       'BaseType' => '82476',
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '217',
                                       'Name' => 'wmem_printer_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '82476' => {
                                       'Name' => 'void(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '189'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '84385' => {
                                       'BaseType' => '82409',
                                       'Name' => 'wmem_tree_key_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '85' => {
                                    'BaseType' => '103',
                                    'Name' => 'char const*',
                                    'Size' => '8',
                                    'Type' => 'Pointer'
                                  },
                          '93503' => {
                                       'BaseType' => '93515',
                                       'Header' => 'wmem_user_cb.h',
                                       'Line' => '44',
                                       'Name' => 'wmem_user_cb_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '93515' => {
                                       'Name' => 'gboolean(*)(wmem_allocator_t*, wmem_cb_event_t, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3012'
                                                           },
                                                    '1' => {
                                                             'type' => '49716'
                                                           },
                                                    '2' => {
                                                             'type' => '143'
                                                           }
                                                  },
                                       'Return' => '407',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '96' => {
                                    'Name' => 'char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libwsutil.so.14.0.0' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '__assert_fail@GLIBC_2.2.5' => 0,
                                                             '__cxa_atexit@GLIBC_2.2.5' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__errno_location@GLIBC_2.2.5' => 0,
                                                             '__fdelt_chk@GLIBC_2.15' => 0,
                                                             '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__fxstat@GLIBC_2.2.5' => 0,
                                                             '__gmon_start__' => 0,
                                                             '__isoc99_sscanf@GLIBC_2.7' => 0,
                                                             '__memcpy_chk@GLIBC_2.3.4' => 0,
                                                             '__printf_chk@GLIBC_2.3.4' => 0,
                                                             '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__stack_chk_fail@GLIBC_2.4' => 0,
                                                             '__uflow@GLIBC_2.2.5' => 0,
                                                             '__vasprintf_chk@GLIBC_2.8' => 0,
                                                             '__vfprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__vsnprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__xstat@GLIBC_2.2.5' => 0,
                                                             '_gcry_mpi_get_const@GCRYPT_1.6' => 0,
                                                             'abort@GLIBC_2.2.5' => 0,
                                                             'access@GLIBC_2.2.5' => 0,
                                                             'clock_gettime@GLIBC_2.17' => 0,
                                                             'close@GLIBC_2.2.5' => 0,
                                                             'endgrent@GLIBC_2.2.5' => 0,
                                                             'endpwent@GLIBC_2.2.5' => 0,
                                                             'exit@GLIBC_2.2.5' => 0,
                                                             'fclose@GLIBC_2.2.5' => 0,
                                                             'fcntl@GLIBC_2.2.5' => 0,
                                                             'feof@GLIBC_2.2.5' => 0,
                                                             'ferror@GLIBC_2.2.5' => 0,
                                                             'fflush@GLIBC_2.2.5' => 0,
                                                             'fileno@GLIBC_2.2.5' => 0,
                                                             'fopen@GLIBC_2.2.5' => 0,
                                                             'fputc@GLIBC_2.2.5' => 0,
                                                             'fputs@GLIBC_2.2.5' => 0,
                                                             'fread@GLIBC_2.2.5' => 0,
                                                             'free@GLIBC_2.2.5' => 0,
                                                             'freeifaddrs@GLIBC_2.3' => 0,
                                                             'fwrite@GLIBC_2.2.5' => 0,
                                                             'g_ascii_dtostr' => 0,
                                                             'g_ascii_strcasecmp' => 0,
                                                             'g_ascii_strtod' => 0,
                                                             'g_ascii_strtoll' => 0,
                                                             'g_ascii_strtoull' => 0,
                                                             'g_ascii_table' => 0,
                                                             'g_ascii_tolower' => 0,
                                                             'g_ascii_toupper' => 0,
                                                             'g_assertion_message' => 0,
                                                             'g_assertion_message_expr' => 0,
                                                             'g_base64_encode_close' => 0,
                                                             'g_base64_encode_step' => 0,
                                                             'g_build_filename' => 0,
                                                             'g_dir_close' => 0,
                                                             'g_dir_open' => 0,
                                                             'g_dir_read_name' => 0,
                                                             'g_file_error_from_errno' => 0,
                                                             'g_file_error_quark' => 0,
                                                             'g_file_open_tmp' => 0,
                                                             'g_file_test' => 0,
                                                             'g_filename_to_uri' => 0,
                                                             'g_free' => 0,
                                                             'g_get_home_dir' => 0,
                                                             'g_get_monotonic_time' => 0,
                                                             'g_get_user_config_dir' => 0,
                                                             'g_getenv' => 0,
                                                             'g_hash_table_destroy' => 0,
                                                             'g_hash_table_get_keys' => 0,
                                                             'g_hash_table_insert' => 0,
                                                             'g_hash_table_iter_init' => 0,
                                                             'g_hash_table_iter_next' => 0,
                                                             'g_hash_table_lookup' => 0,
                                                             'g_hash_table_lookup_extended' => 0,
                                                             'g_hash_table_new' => 0,
                                                             'g_hash_table_new_full' => 0,
                                                             'g_hash_table_remove' => 0,
                                                             'g_hash_table_replace' => 0,
                                                             'g_hash_table_size' => 0,
                                                             'g_io_channel_set_buffered' => 0,
                                                             'g_io_channel_set_close_on_unref' => 0,
                                                             'g_io_channel_set_encoding' => 0,
                                                             'g_io_channel_unix_new' => 0,
                                                             'g_list_first' => 0,
                                                             'g_list_free' => 0,
                                                             'g_list_free_full' => 0,
                                                             'g_list_prepend' => 0,
                                                             'g_list_sort' => 0,
                                                             'g_log' => 0,
                                                             'g_log_set_handler' => 0,
                                                             'g_log_writer_supports_color' => 0,
                                                             'g_malloc' => 0,
                                                             'g_malloc0' => 0,
                                                             'g_malloc_n' => 0,
                                                             'g_mkdir_with_parents' => 0,
                                                             'g_module_close' => 0,
                                                             'g_module_error' => 0,
                                                             'g_module_name' => 0,
                                                             'g_module_open' => 0,
                                                             'g_module_supported' => 0,
                                                             'g_module_symbol' => 0,
                                                             'g_path_is_absolute' => 0,
                                                             'g_ptr_array_add' => 0,
                                                             'g_ptr_array_free' => 0,
                                                             'g_ptr_array_new' => 0,
                                                             'g_ptr_array_new_with_free_func' => 0,
                                                             'g_ptr_array_remove_index' => 0,
                                                             'g_ptr_array_set_free_func' => 0,
                                                             'g_ptr_array_sized_new' => 0,
                                                             'g_ptr_array_sort' => 0,
                                                             'g_random_int' => 0,
                                                             'g_random_int_range' => 0,
                                                             'g_realloc' => 0,
                                                             'g_return_if_fail_warning' => 0,
                                                             'g_set_error_literal' => 0,
                                                             'g_set_prgname' => 0,
                                                             'g_shell_quote' => 0,
                                                             'g_slist_foreach' => 0,
                                                             'g_slist_free' => 0,
                                                             'g_slist_prepend' => 0,
                                                             'g_slist_remove' => 0,
                                                             'g_spawn_async_with_pipes' => 0,
                                                             'g_spawn_sync' => 0,
                                                             'g_stpcpy' => 0,
                                                             'g_str_equal' => 0,
                                                             'g_str_has_prefix' => 0,
                                                             'g_str_has_suffix' => 0,
                                                             'g_str_hash' => 0,
                                                             'g_strchomp' => 0,
                                                             'g_strcmp0' => 0,
                                                             'g_strdelimit' => 0,
                                                             'g_strdup' => 0,
                                                             'g_strerror' => 0,
                                                             'g_strfreev' => 0,
                                                             'g_string_append' => 0,
                                                             'g_string_append_len' => 0,
                                                             'g_string_append_printf' => 0,
                                                             'g_string_append_vprintf' => 0,
                                                             'g_string_free' => 0,
                                                             'g_string_insert_c' => 0,
                                                             'g_string_new' => 0,
                                                             'g_string_sized_new' => 0,
                                                             'g_strlcat' => 0,
                                                             'g_strlcpy' => 0,
                                                             'g_tree_destroy' => 0,
                                                             'g_tree_foreach' => 0,
                                                             'g_tree_insert' => 0,
                                                             'g_tree_new_full' => 0,
                                                             'g_tree_nnodes' => 0,
                                                             'g_unichar_isprint' => 0,
                                                             'g_unichar_to_utf8' => 0,
                                                             'g_unichar_validate' => 0,
                                                             'g_utf8_get_char' => 0,
                                                             'g_utf8_skip' => 0,
                                                             'g_utf8_validate' => 0,
                                                             'gcry_cipher_close@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_encrypt@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_open@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_setctr@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_setiv@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_setkey@GCRYPT_1.6' => 0,
                                                             'gcry_ctx_release@GCRYPT_1.6' => 0,
                                                             'gcry_mac_close@GCRYPT_1.6' => 0,
                                                             'gcry_mac_open@GCRYPT_1.6' => 0,
                                                             'gcry_mac_read@GCRYPT_1.6' => 0,
                                                             'gcry_mac_setkey@GCRYPT_1.6' => 0,
                                                             'gcry_mac_write@GCRYPT_1.6' => 0,
                                                             'gcry_md_close@GCRYPT_1.6' => 0,
                                                             'gcry_md_get_algo_dlen@GCRYPT_1.6' => 0,
                                                             'gcry_md_open@GCRYPT_1.6' => 0,
                                                             'gcry_md_read@GCRYPT_1.6' => 0,
                                                             'gcry_md_reset@GCRYPT_1.6' => 0,
                                                             'gcry_md_setkey@GCRYPT_1.6' => 0,
                                                             'gcry_md_write@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_cmp@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_ec_get_affine@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_ec_mul@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_ec_new@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_invm@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_point_new@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_point_release@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_point_set@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_print@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_release@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_scan@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_set_ui@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_swap@GCRYPT_1.6' => 0,
                                                             'gcry_pk_decrypt@GCRYPT_1.6' => 0,
                                                             'gcry_sexp_build@GCRYPT_1.6' => 0,
                                                             'gcry_sexp_nth_mpi@GCRYPT_1.6' => 0,
                                                             'gcry_sexp_release@GCRYPT_1.6' => 0,
                                                             'gcry_strerror@GCRYPT_1.6' => 0,
                                                             'getcwd@GLIBC_2.2.5' => 0,
                                                             'getdtablesize@GLIBC_2.2.5' => 0,
                                                             'getegid@GLIBC_2.2.5' => 0,
                                                             'getenv@GLIBC_2.2.5' => 0,
                                                             'geteuid@GLIBC_2.2.5' => 0,
                                                             'getgid@GLIBC_2.2.5' => 0,
                                                             'getgrgid@GLIBC_2.2.5' => 0,
                                                             'getifaddrs@GLIBC_2.3' => 0,
                                                             'getline@GLIBC_2.2.5' => 0,
                                                             'getpid@GLIBC_2.2.5' => 0,
                                                             'getpwuid@GLIBC_2.2.5' => 0,
                                                             'getresgid@GLIBC_2.2.5' => 0,
                                                             'getresuid@GLIBC_2.2.5' => 0,
                                                             'getrusage@GLIBC_2.2.5' => 0,
                                                             'gettimeofday@GLIBC_2.2.5' => 0,
                                                             'getuid@GLIBC_2.2.5' => 0,
                                                             'gnutls_pkcs12_bag_decrypt@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_deinit@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_get_count@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_get_data@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_get_type@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_init@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_deinit@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_get_bag@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_import@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_init@GNUTLS_3_4' => 0,
                                                             'gnutls_strerror@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_deinit@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_export_rsa_raw@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_get_pk_algorithm@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_import@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_import_pkcs8@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_init@GNUTLS_3_4' => 0,
                                                             'inet_ntop@GLIBC_2.2.5' => 0,
                                                             'inet_pton@GLIBC_2.2.5' => 0,
                                                             'localtime@GLIBC_2.2.5' => 0,
                                                             'mblen@GLIBC_2.2.5' => 0,
                                                             'mbtowc@GLIBC_2.2.5' => 0,
                                                             'memcmp@GLIBC_2.2.5' => 0,
                                                             'memcpy@GLIBC_2.14' => 0,
                                                             'memmem@GLIBC_2.2.5' => 0,
                                                             'memmove@GLIBC_2.2.5' => 0,
                                                             'memset@GLIBC_2.2.5' => 0,
                                                             'mkdir@GLIBC_2.2.5' => 0,
                                                             'mktime@GLIBC_2.2.5' => 0,
                                                             'open@GLIBC_2.2.5' => 0,
                                                             'pathconf@GLIBC_2.2.5' => 0,
                                                             'pcre2_code_free_8' => 0,
                                                             'pcre2_compile_8' => 0,
                                                             'pcre2_get_error_message_8' => 0,
                                                             'pcre2_get_ovector_pointer_8' => 0,
                                                             'pcre2_match_8' => 0,
                                                             'pcre2_match_data_create_8' => 0,
                                                             'pcre2_match_data_free_8' => 0,
                                                             'putc@GLIBC_2.2.5' => 0,
