$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '9.3.0',
          'Headers' => {
                         '<built-in>' => 1,
                         'FILE.h' => 1,
                         'buffer.h' => 1,
                         'codecs.h' => 1,
                         'crc16-plain.h' => 1,
                         'crc32.h' => 1,
                         'eax.h' => 1,
                         'emmintrin.h' => 1,
                         'filesystem.h' => 1,
                         'garray.h' => 1,
                         'gcrypt.h' => 1,
                         'gerror.h' => 1,
                         'ghash.h' => 1,
                         'glibconfig.h' => 1,
                         'gnutls.h' => 1,
                         'gpg-error.h' => 1,
                         'gquark.h' => 1,
                         'gslist.h' => 1,
                         'gstring.h' => 1,
                         'gtypes.h' => 1,
                         'gunicode.h' => 1,
                         'inet_addr.h' => 1,
                         'inet_ipv6.h' => 1,
                         'jsmn.h' => 1,
                         'json_dumper.h' => 1,
                         'mpeg-audio.h' => 1,
                         'nstime.h' => 1,
                         'plugins.h' => 1,
                         'privileges.h' => 1,
                         'report_message.h' => 1,

                                                    'ws_log_print_usage' => 1,
                                                    'ws_log_set_debug_filter' => 1,
                                                    'ws_log_set_domain_filter' => 1,
                                                    'ws_log_set_fatal' => 1,
                                                    'ws_log_set_fatal_str' => 1,
                                                    'ws_log_set_level' => 1,
                                                    'ws_log_set_level_str' => 1,
                                                    'ws_log_set_noisy_filter' => 1,
                                                    'ws_log_write_always_full' => 1,
                                                    'ws_logv' => 1,
                                                    'ws_logv_full' => 1,
                                                    'ws_mempbrk_compile' => 1,
                                                    'ws_mempbrk_exec' => 1,
                                                    'ws_optarg' => -8,
                                                    'ws_opterr' => -4,
                                                    'ws_optind' => -4,
                                                    'ws_optopt' => -4,
                                                    'ws_optpos' => -4,
                                                    'ws_optreset' => -4,
                                                    'ws_pipe_close' => 1,
                                                    'ws_pipe_data_available' => 1,
                                                    'ws_pipe_init' => 1,
                                                    'ws_pipe_spawn_async' => 1,
                                                    'ws_pipe_spawn_sync' => 1,
                                                    'ws_read_string_from_pipe' => 1,
                                                    'ws_socket_ptoa' => 1,
                                                    'ws_strtoi' => 1,
                                                    'ws_strtoi16' => 1,
                                                    'ws_strtoi32' => 1,
                                                    'ws_strtoi64' => 1,
                                                    'ws_strtoi8' => 1,
                                                    'ws_strtou' => 1,
                                                    'ws_strtou16' => 1,
                                                    'ws_strtou32' => 1,
                                                    'ws_strtou64' => 1,
                                                    'ws_strtou8' => 1,
                                                    'ws_utf8_char_len' => 1,
                                                    'ws_vadd_crash_info' => 1,
                                                    'ws_xton' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '101134' => {
                                        'Header' => 'ws_log_defs.h',
                                        'Line' => '47',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'LOG_LEVEL_NONE',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'LOG_LEVEL_NOISY',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'LOG_LEVEL_DEBUG',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'LOG_LEVEL_INFO',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'LOG_LEVEL_MESSAGE',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'LOG_LEVEL_WARNING',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'LOG_LEVEL_CRITICAL',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'LOG_LEVEL_ERROR',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => '_LOG_LEVEL_LAST',
                                                             'value' => '8'
                                                           }
                                                  },
                                        'Name' => 'enum ws_log_level',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '101718' => {
                                        'BaseType' => '101730',
                                        'Header' => 'garray.h',
                                        'Line' => '39',
                                        'Name' => 'GPtrArray',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '101730' => {
                                        'Header' => 'garray.h',
                                        'Line' => '53',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pdata',
                                                             'offset' => '0',
                                                             'type' => '575'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '424'
                                                           }
                                                  },
                                        'Name' => 'struct _GPtrArray',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '103' => {
                                     'BaseType' => '96',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '104098' => {
                                        'BaseType' => '101718',
                                        'Name' => 'GPtrArray*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '104104' => {
                                        'Header' => 'buffer.h',
                                        'Line' => '21',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'data',
                                                             'offset' => '0',
                                                             'type' => '569'
                                                           },
                                                    '1' => {
                                                             'name' => 'allocated',
                                                             'offset' => '8',
                                                             'type' => '254'
                                                           },
                                                    '2' => {
                                                             'name' => 'start',
                                                             'offset' => '16',
                                                             'type' => '254'
                                                           },
                                                    '3' => {
                                                             'name' => 'first_free',
                                                             'offset' => '24',
                                                             'type' => '254'
                                                           }
                                                  },
                                        'Name' => 'struct Buffer',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '104170' => {
                                        'BaseType' => '104104',
                                        'Header' => 'buffer.h',
                                        'Line' => '26',
                                        'Name' => 'Buffer',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '105085' => {
                                        'BaseType' => '104170',
                                        'Name' => 'Buffer*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '10654' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '152',
                                       'Name' => '__off_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10666' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '153',
                                       'Name' => '__off64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10696' => {
                                       'Header' => 'struct_FILE.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_flags',
                                                            'offset' => '0',
                                                            'type' => '78'
                                                          },
                                                   '1' => {
                                                            'name' => '_IO_read_ptr',
                                                            'offset' => '8',
                                                            'type' => '150'
                                                          },
                                                   '10' => {
                                                             'name' => '_IO_backup_base',
                                                             'offset' => '80',
                                                             'type' => '150'
                                                           },
                                                   '11' => {
                                                             'name' => '_IO_save_end',
                                                             'offset' => '88',
                                                             'type' => '150'
                                                           },
                                                   '12' => {
                                                             'name' => '_markers',
                                                             'offset' => '96',
                                                             'type' => '11112'
                                                           },
                                                   '13' => {
                                                             'name' => '_chain',
                                                             'offset' => '104',
                                                             'type' => '11118'
                                                           },
                                                   '14' => {
                                                             'name' => '_fileno',
                                                             'offset' => '112',
                                                             'type' => '78'
                                                           },
                                                   '15' => {
                                                             'name' => '_flags2',
                                                             'offset' => '116',
                                                             'type' => '78'
                                                           },
                                                   '16' => {
                                                             'name' => '_old_offset',
                                                             'offset' => '120',
                                                             'type' => '10654'
                                                           },
                                                   '17' => {
                                                             'name' => '_cur_column',
                                                             'offset' => '128',
                                                             'type' => '71'
                                                           },
                                                   '18' => {
                                                             'name' => '_vtable_offset',
                                                             'offset' => '130',
                                                             'type' => '129'
                                                           },
                                                   '19' => {
                                                             'name' => '_shortbuf',
                                                             'offset' => '131',
                                                             'type' => '11124'
                                                           },
                                                   '2' => {
                                                            'name' => '_IO_read_end',
                                                            'offset' => '16',
                                                            'type' => '150'
                                                          },
                                                   '20' => {
                                                             'name' => '_lock',
                                                             'offset' => '136',
                                                             'type' => '11140'
                                                           },
                                                   '21' => {
                                                             'name' => '_offset',
                                                             'offset' => '144',
                                                             'type' => '10666'
                                                           },
                                                   '22' => {
                                                             'name' => '_codecvt',
                                                             'offset' => '152',
                                                             'type' => '11151'
                                                           },
                                                   '23' => {
                                                             'name' => '_wide_data',
                                                             'offset' => '160',
                                                             'type' => '11162'
                                                           },
                                                   '24' => {
                                                             'name' => '_freeres_list',
                                                             'offset' => '168',
                                                             'type' => '11118'
                                                           },
                                                   '25' => {
                                                             'name' => '_freeres_buf',
                                                             'offset' => '176',
                                                             'type' => '143'
                                                           },
                                                   '26' => {
                                                             'name' => '__pad5',
                                                             'offset' => '184',
                                                             'type' => '52'
                                                           },
                                                   '27' => {
                                                             'name' => '_mode',
                                                             'offset' => '192',
                                                             'type' => '78'
                                                           },
                                                   '28' => {
                                                             'name' => '_unused2',
                                                             'offset' => '196',
                                                             'type' => '11168'
                                                           },
                                                   '3' => {
                                                            'name' => '_IO_read_base',
                                                            'offset' => '24',
                                                            'type' => '150'
                                                          },
                                                   '4' => {
                                                            'name' => '_IO_write_base',
                                                            'offset' => '32',
                                                            'type' => '150'
                                                          },
                                                   '5' => {
                                                            'name' => '_IO_write_ptr',
                                                            'offset' => '40',
                                                            'type' => '150'
                                                          },
                                                   '6' => {
                                                            'name' => '_IO_write_end',
                                                            'offset' => '48',
                                                            'type' => '150'
                                                          },
                                                   '7' => {
                                                            'name' => '_IO_buf_base',
                                                            'offset' => '56',
                                                            'type' => '150'
                                                          },
                                                   '8' => {
                                                            'name' => '_IO_buf_end',
                                                            'offset' => '64',
                                                            'type' => '150'
                                                          },
                                                   '9' => {
                                                            'name' => '_IO_save_base',
                                                            'offset' => '72',
                                                            'type' => '150'
                                                          }
                                                 },
                                       'Name' => 'struct _IO_FILE',
                                       'Size' => '216',
                                       'Type' => 'Struct'
                                     },
                          '107803' => {
                                        'BaseType' => '107815',
                                        'Header' => 'ghash.h',
                                        'Line' => '37',
                                        'Name' => 'GHashTable',
                                        'Type' => 'Typedef'
                                      },
                          '107815' => {
                                        'Name' => 'struct _GHashTable',
                                        'Type' => 'Struct'
                                      },
                          '108' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '109607' => {
                                        'Header' => 'codecs.h',
                                        'Line' => '25',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'register_codec_module',
                                                             'offset' => '0',
                                                             'type' => '658'
                                                           }
                                                  },
                                        'Name' => 'struct codecs_plugin',
                                        'Size' => '8',
                                        'Type' => 'Struct'
                                      },
                          '109619' => {
                                        'BaseType' => '109607',
                                        'Name' => 'codecs_plugin const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '109624' => {
                                        'BaseType' => '109636',
                                        'Header' => 'codecs.h',
                                        'Line' => '42',
                                        'Name' => 'codec_handle_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '109636' => {
                                        'BaseType' => '109642',
                                        'Name' => 'struct codec_handle*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '109642' => {
                                        'Line' => '75',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '85'
                                                           },
                                                    '1' => {
                                                             'name' => 'init_fn',
                                                             'offset' => '8',
                                                             'type' => '109734'
                                                           },
                                                    '2' => {
                                                             'name' => 'release_fn',
                                                             'offset' => '16',
                                                             'type' => '109757'
                                                           },
                                                    '3' => {
                                                             'name' => 'channels_fn',
                                                             'offset' => '24',
                                                             'type' => '109769'
                                                           },
                                                    '4' => {
                                                             'name' => 'frequency_fn',
                                                             'offset' => '32',
                                                             'type' => '109802'
                                                           },
                                                    '5' => {
                                                             'name' => 'decode_fn',
                                                             'offset' => '40',
                                                             'type' => '109814'
                                                           }
                                                  },
                                        'Name' => 'struct codec_handle',
                                        'Size' => '48',
                                        'Source' => 'codecs.c',
                                        'Type' => 'Struct'
                                      },
                          '109734' => {
                                        'BaseType' => '109746',
                                        'Header' => 'codecs.h',
                                        'Line' => '58',
                                        'Name' => 'codec_init_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '109746' => {
                                        'Name' => 'void*(*)()',
                                        'Return' => '143',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '109757' => {
                                        'BaseType' => '7842',
                                        'Header' => 'codecs.h',
                                        'Line' => '64',
                                        'Name' => 'codec_release_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '109769' => {
                                        'BaseType' => '109781',
                                        'Header' => 'codecs.h',
                                        'Line' => '72',
                                        'Name' => 'codec_get_channels_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '109781' => {
                                        'Name' => 'unsigned int(*)(void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '143'
                                                            }
                                                   },
                                        'Return' => '45',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '109802' => {
                                        'BaseType' => '109781',
                                        'Header' => 'codecs.h',
                                        'Line' => '80',
                                        'Name' => 'codec_get_frequency_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '109814' => {
                                        'BaseType' => '109826',
                                        'Header' => 'codecs.h',
                                        'Line' => '102',
                                        'Name' => 'codec_decode_fn',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '109826' => {
                                        'Name' => 'size_t(*)(void*, void const*, size_t, void*, size_t*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '143'
                                                            },
                                                     '1' => {
                                                              'type' => '189'
                                                            },
                                                     '2' => {
                                                              'type' => '52'
                                                            },
                                                     '3' => {
                                                              'type' => '143'
                                                            },
                                                     '4' => {
                                                              'type' => '109867'
                                                            }
                                                   },
                                        'Return' => '52',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '109867' => {
                                        'BaseType' => '52',
                                        'Name' => 'size_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '110443' => {
                                        'BaseType' => '1',
                                        'Header' => 'plugins.h',
                                        'Line' => '25',
                                        'Name' => 'plugins_t',
                                        'Type' => 'Typedef'
                                      },
                          '110506' => {
                                        'BaseType' => '110443',
                                        'Name' => 'plugins_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11087' => {
                                       'BaseType' => '10696',
                                       'Header' => 'FILE.h',
                                       'Line' => '7',
                                       'Name' => 'FILE',
                                       'Size' => '216',
                                       'Type' => 'Typedef'
                                     },
                          '11099' => {
                                       'BaseType' => '1',
                                       'Header' => 'struct_FILE.h',
                                       'Line' => '43',
                                       'Name' => '_IO_lock_t',
                                       'Type' => 'Typedef'
                                     },
                          '11107' => {
                                       'Name' => 'struct _IO_marker',
                                       'Type' => 'Struct'
                                     },
                          '11112' => {
                                       'BaseType' => '11107',
                                       'Name' => 'struct _IO_marker*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11118' => {
                                       'BaseType' => '10696',
                                       'Name' => 'struct _IO_FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11124' => {
                                       'BaseType' => '96',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '11140' => {
                                       'BaseType' => '11099',
                                       'Name' => '_IO_lock_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11146' => {
                                       'Name' => 'struct _IO_codecvt',
                                       'Type' => 'Struct'
                                     },
                          '11151' => {
                                       'BaseType' => '11146',
                                       'Name' => 'struct _IO_codecvt*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11157' => {
                                       'Name' => 'struct _IO_wide_data',
                                       'Type' => 'Struct'
                                     },
                          '11162' => {
                                       'BaseType' => '11157',
                                       'Name' => 'struct _IO_wide_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11168' => {
                                       'BaseType' => '96',
                                       'Name' => 'char[20]',
                                       'Size' => '20',
                                       'Type' => 'Array'
                                     },
                          '11196' => {
                                       'BaseType' => '11087',
                                       'Name' => 'FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '111962' => {
                                        'BaseType' => '109619',
                                        'Name' => 'codecs_plugin const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '115' => {
                                     'Name' => 'long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '1171' => {
                                      'BaseType' => '1183',
                                      'Header' => 'gslist.h',
                                      'Line' => '37',
                                      'Name' => 'GSList',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '1183' => {
                                      'Header' => 'gslist.h',
                                      'Line' => '39',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'data',
                                                           'offset' => '0',
                                                           'type' => '455'
                                                         },
                                                  '1' => {
                                                           'name' => 'next',
                                                           'offset' => '8',
                                                           'type' => '1223'
                                                         }
                                                },
                                      'Name' => 'struct _GSList',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '122' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1223' => {
                                      'BaseType' => '1171',
                                      'Name' => 'GSList*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '123219' => {
                                        'BaseType' => '122',
                                        'Name' => 'unsigned char const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '125957' => {
                                        'BaseType' => '213',
                                        'Header' => 'crc16-plain.h',
                                        'Line' => '53',
                                        'Name' => 'crc16_plain_t',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '126296' => {
                                        'BaseType' => '123219',
                                        'Name' => 'unsigned char const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '126754' => {
                                        'BaseType' => '122',
                                        'Header' => 'gtypes.h',
                                        'Line' => '52',
                                        'Name' => 'guchar',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '129' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '136' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '143' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '149416' => {
                                        'BaseType' => '122',
                                        'Name' => 'unsigned char*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '150' => {
                                     'BaseType' => '96',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '151615' => {
                                        'BaseType' => '126754',
                                        'Name' => 'guchar const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '154484' => {
                                        'BaseType' => '151615',
                                        'Name' => 'guchar const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '154490' => {
                                        'BaseType' => '126754',
                                        'Name' => 'guchar*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '154512' => {
                                        'BaseType' => '201',
                                        'Name' => 'guint8[4]',
                                        'Size' => '4',
                                        'Type' => 'Array'
                                      },
                          '158341' => {
                                        'Header' => 'eax.h',
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'Mac',
                                                             'offset' => '0',
                                                             'type' => '154512'
                                                           }
                                                  },
                                        'Name' => 'struct tagMAC_T',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '158384' => {
                                        'BaseType' => '158341',
                                        'Header' => 'eax.h',
                                        'Line' => '21',
                                        'Name' => 'MAC_T',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '158439' => {
                                        'BaseType' => '201',
                                        'Name' => 'guint8[16]',
                                        'Size' => '16',
                                        'Type' => 'Array'
                                      },
                          '161055' => {
                                        'BaseType' => '158384',
                                        'Name' => 'MAC_T*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '161466' => {
                                        'BaseType' => '108',
                                        'Header' => 'types.h',
                                        'Line' => '160',
                                        'Name' => '__time_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '163' => {
                                     'Name' => 'int(*)(void const*, void const*)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '189'
                                                         },
                                                  '1' => {
                                                           'type' => '189'
                                                         }
                                                },
                                     'Return' => '78',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '163319' => {
                                        'BaseType' => '107803',
                                        'Name' => 'GHashTable const',
                                        'Type' => 'Const'
                                      },
                          '165626' => {
                                        'BaseType' => '150',
                                        'Name' => 'char**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '165923' => {
                                        'BaseType' => '78',
                                        'Name' => 'int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '171126' => {
                                        'BaseType' => '163319',
                                        'Name' => 'GHashTable const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1769' => {
                                      'BaseType' => '388',
                                      'Name' => 'gint*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '183787' => {
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '20',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bytes',
                                                             'offset' => '0',
                                                             'type' => '158439'
                                                           }
                                                  },
                                        'Name' => 'struct e_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '183830' => {
                                        'BaseType' => '183787',
                                        'Header' => 'inet_ipv6.h',
                                        'Line' => '22',
                                        'Name' => 'ws_in6_addr',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '184993' => {
                                        'BaseType' => '183830',
                                        'Name' => 'ws_in6_addr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '189' => {
                                     'BaseType' => '200',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '189485' => {
                                        'BaseType' => '71',
                                        'Header' => 'sockaddr.h',
                                        'Line' => '28',
                                        'Name' => 'sa_family_t',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '190993' => {
                                        'Header' => 'jsmn.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'JSMN_UNDEFINED',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'JSMN_OBJECT',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'JSMN_ARRAY',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'JSMN_STRING',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'JSMN_PRIMITIVE',
                                                             'value' => '4'
                                                           }
                                                  },
                                        'Name' => 'enum jsmntype_t',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '1911' => {
                                      'BaseType' => '1917',
                                      'Name' => 'GError**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '191104' => {
                                        'Header' => 'jsmn.h',
                                        'Line' => '70',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'type',
                                                             'offset' => '0',
                                                             'type' => '190993'
                                                           },
                                                    '1' => {
                                                             'name' => 'start',
                                                             'offset' => '4',
                                                             'type' => '78'
                                                           },
                                                    '2' => {
                                                             'name' => 'end',
                                                             'offset' => '8',
                                                             'type' => '78'
                                                           },
                                                    '3' => {
                                                             'name' => 'size',
                                                             'offset' => '12',
                                                             'type' => '78'
                                                           }
                                                  },
                                        'Name' => 'struct jsmntok_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '191683' => {
                                        'BaseType' => '191104',
                                        'Name' => 'jsmntok_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1917' => {
                                      'BaseType' => '593',
                                      'Name' => 'GError*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '195986' => {
                                        'Header' => 'json_dumper.h',
                                        'Line' => '53',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'output_file',
                                                             'offset' => '0',
                                                             'type' => '11196'
                                                           },
                                                    '1' => {
                                                             'name' => 'flags',
                                                             'offset' => '8',
                                                             'type' => '78'
                                                           },
                                                    '2' => {
                                                             'name' => 'current_depth',
                                                             'offset' => '12',
                                                             'type' => '78'
                                                           },
                                                    '3' => {
                                                             'name' => 'base64_state',
                                                             'offset' => '16',
                                                             'type' => '388'
                                                           },
                                                    '4' => {
                                                             'name' => 'base64_save',
                                                             'offset' => '20',
                                                             'type' => '388'
                                                           },
                                                    '5' => {
                                                             'name' => 'state',
                                                             'offset' => '24',
                                                             'type' => '196079'
                                                           }
                                                  },
                                        'Name' => 'struct json_dumper',
                                        'Size' => '1128',
                                        'Type' => 'Struct'
                                      },
                          '196079' => {
                                        'BaseType' => '201',
                                        'Name' => 'guint8[1100]',
                                        'Size' => '1100',
                                        'Type' => 'Array'
                                      },
                          '196096' => {
                                        'BaseType' => '195986',
                                        'Header' => 'json_dumper.h',
                                        'Line' => '63',
                                        'Name' => 'json_dumper',
                                        'Size' => '1128',
                                        'Type' => 'Typedef'
                                      },
                          '196540' => {
                                        'BaseType' => '196096',
                                        'Name' => 'json_dumper*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '200' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '200351' => {
                                        'Header' => 'mpeg-audio.h',
                                        'Line' => '16',
                                        'Memb' => {
                                                    '0' => {
                                                             'bitfield' => '2',
                                                             'name' => 'emphasis',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '1' => {
                                                             'bitfield' => '1',
                                                             'name' => 'original',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '10' => {
                                                              'bitfield' => '2',
                                                              'name' => 'layer',
                                                              'offset' => '0',
                                                              'type' => '45'
                                                            },
                                                    '11' => {
                                                              'bitfield' => '2',
                                                              'name' => 'version',
                                                              'offset' => '0',
                                                              'type' => '45'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '11',
                                                              'name' => 'sync',
                                                              'offset' => '0',
                                                              'type' => '45'
                                                            },
                                                    '2' => {
                                                             'bitfield' => '1',
                                                             'name' => 'copyright',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '3' => {
                                                             'bitfield' => '2',
                                                             'name' => 'modeext',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '4' => {
                                                             'bitfield' => '2',
                                                             'name' => 'mode',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '5' => {
                                                             'bitfield' => '1',
                                                             'name' => 'priv',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '6' => {
                                                             'bitfield' => '1',
                                                             'name' => 'padding',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '7' => {
                                                             'bitfield' => '2',
                                                             'name' => 'frequency',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '8' => {
                                                             'bitfield' => '4',
                                                             'name' => 'bitrate',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '9' => {
                                                             'bitfield' => '1',
                                                             'name' => 'protection',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           }
                                                  },
                                        'Name' => 'struct mpa',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '200573' => {
                                        'BaseType' => '200351',
                                        'Name' => 'struct mpa const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '200625' => {
                                        'BaseType' => '78',
                                        'Name' => 'int const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '200919' => {
                                        'BaseType' => '200573',
                                        'Name' => 'struct mpa const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '201' => {
                                     'BaseType' => '122',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '41',
                                     'Name' => 'guint8',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '201992' => {
                                        'BaseType' => '108',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '61',
                                        'Name' => 'gint64',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '202028' => {
                                        'BaseType' => '161466',
                                        'Header' => 'time_t.h',
                                        'Line' => '7',
                                        'Name' => 'time_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '202040' => {
                                        'Header' => 'struct_tm.h',
                                        'Line' => '7',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tm_sec',
                                                             'offset' => '0',
                                                             'type' => '78'
                                                           },
                                                    '1' => {
                                                             'name' => 'tm_min',
                                                             'offset' => '4',
                                                             'type' => '78'
                                                           },
                                                    '10' => {
                                                              'name' => 'tm_zone',
                                                              'offset' => '48',
                                                              'type' => '85'
                                                            },
                                                    '2' => {
                                                             'name' => 'tm_hour',
                                                             'offset' => '8',
                                                             'type' => '78'
                                                           },
                                                    '3' => {
                                                             'name' => 'tm_mday',
                                                             'offset' => '12',
                                                             'type' => '78'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_mon',
                                                             'offset' => '16',
                                                             'type' => '78'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_year',
                                                             'offset' => '20',
                                                             'type' => '78'
                                                           },
                                                    '6' => {
                                                             'name' => 'tm_wday',
                                                             'offset' => '24',
                                                             'type' => '78'
                                                           },
                                                    '7' => {
                                                             'name' => 'tm_yday',
                                                             'offset' => '28',
                                                             'type' => '78'
                                                           },
                                                    '8' => {
                                                             'name' => 'tm_isdst',
                                                             'offset' => '32',
                                                             'type' => '78'
                                                           },
                                                    '9' => {
                                                             'name' => 'tm_gmtoff',
                                                             'offset' => '40',
                                                             'type' => '108'
                                                           }
                                                  },
                                        'Name' => 'struct tm',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '204956' => {
                                        'Header' => 'nstime.h',
                                        'Line' => '31',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'secs',
                                                             'offset' => '0',
                                                             'type' => '202028'
                                                           },
                                                    '1' => {
                                                             'name' => 'nsecs',
                                                             'offset' => '8',
                                                             'type' => '78'
                                                           }
                                                  },
                                        'Name' => 'struct nstime_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '204968' => {
                                        'BaseType' => '204956',
                                        'Name' => 'nstime_t const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '205398' => {
                                        'BaseType' => '204956',
                                        'Name' => 'nstime_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '206745' => {
                                        'BaseType' => '204968',
                                        'Name' => 'nstime_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '209427' => {
                                        'BaseType' => '209439',
                                        'Header' => 'gstring.h',
                                        'Line' => '39',
                                        'Name' => 'GString',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '209439' => {
                                        'Header' => 'gstring.h',
                                        'Line' => '41',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'str',
                                                             'offset' => '0',
                                                             'type' => '563'
                                                           },
                                                    '1' => {
                                                             'name' => 'len',
                                                             'offset' => '8',
                                                             'type' => '254'
                                                           },
                                                    '2' => {
                                                             'name' => 'allocated_len',
                                                             'offset' => '16',
                                                             'type' => '254'
                                                           }
                                                  },
                                        'Name' => 'struct _GString',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '209492' => {
                                        'BaseType' => '209427',
                                        'Name' => 'GString*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '213' => {
                                     'BaseType' => '71',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '44',
                                     'Name' => 'guint16',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '22039' => {
                                       'BaseType' => '78',
                                       'Header' => 'glibconfig.h',
                                       'Line' => '51',
                                       'Name' => 'gint32',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '223850' => {
                                        'BaseType' => '45',
                                        'Header' => 'gpg-error.h',
                                        'Line' => '737',
                                        'Name' => 'gpg_error_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '223875' => {
                                        'BaseType' => '223850',
                                        'Header' => 'gcrypt.h',
                                        'Line' => '135',
                                        'Name' => 'gcry_error_t',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '223910' => {
                                        'BaseType' => '223923',
                                        'Header' => 'gcrypt.h',
                                        'Line' => '347',
                                        'Name' => 'gcry_sexp_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '223923' => {
                                        'BaseType' => '223929',
                                        'Name' => 'struct gcry_sexp*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '223929' => {
                                        'Name' => 'struct gcry_sexp',
                                        'Type' => 'Struct'
                                      },
                          '224171' => {
                                        'BaseType' => '224177',
                                        'Name' => 'struct gnutls_x509_privkey_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '224177' => {
                                        'Name' => 'struct gnutls_x509_privkey_int',
                                        'Type' => 'Struct'
                                      },
                          '224239' => {
                                        'BaseType' => '224171',
                                        'Header' => 'gnutls.h',
                                        'Line' => '1962',
                                        'Name' => 'gnutls_x509_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '229549' => {
                                        'Header' => 'sober128.h',
                                        'Line' => '28',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'R',
                                                             'offset' => '0',
                                                             'type' => '229658'
                                                           },
                                                    '1' => {
                                                             'name' => 'initR',
                                                             'offset' => '136',
                                                             'type' => '229658'
                                                           },
                                                    '2' => {
                                                             'name' => 'konst',
                                                             'offset' => '272',
                                                             'type' => '64'
                                                           },
                                                    '3' => {
                                                             'name' => 'sbuf',
                                                             'offset' => '280',
                                                             'type' => '64'
                                                           },
                                                    '4' => {
                                                             'name' => 'nbuf',
                                                             'offset' => '288',
                                                             'type' => '78'
                                                           },
                                                    '5' => {
                                                             'name' => 'flag',
                                                             'offset' => '292',
                                                             'type' => '78'
                                                           },
                                                    '6' => {
                                                             'name' => 'set',
                                                             'offset' => '296',
                                                             'type' => '78'
                                                           }
                                                  },
                                        'Name' => 'struct _sober128_prng',
                                        'Size' => '304',
                                        'Type' => 'Struct'
                                      },
                          '229658' => {
                                        'BaseType' => '64',
                                        'Name' => 'unsigned long[17]',
                                        'Size' => '136',
                                        'Type' => 'Array'
                                      },
                          '229688' => {
                                        'BaseType' => '229549',
                                        'Header' => 'sober128.h',
                                        'Line' => '38',
                                        'Name' => 'sober128_prng',
                                        'Size' => '304',
                                        'Type' => 'Typedef'
                                      },
                          '230' => {
                                     'BaseType' => '45',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '52',
                                     'Name' => 'guint32',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '230469' => {
                                        'BaseType' => '229688',
                                        'Name' => 'sober128_prng*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '234525' => {
                                        'Header' => 'socket.h',
                                        'Line' => '191',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ss_family',
                                                             'offset' => '0',
                                                             'type' => '189485'
                                                           },
                                                    '1' => {
                                                             'name' => '__ss_padding',
                                                             'offset' => '2',
                                                             'type' => '234578'
                                                           },
                                                    '2' => {
                                                             'name' => '__ss_align',
                                                             'offset' => '120',
                                                             'type' => '64'
                                                           }
                                                  },
                                        'Name' => 'struct sockaddr_storage',
                                        'Size' => '128',
                                        'Type' => 'Struct'
                                      },
                          '234578' => {
                                        'BaseType' => '96',
                                        'Name' => 'char[118]',
                                        'Size' => '118',
                                        'Type' => 'Array'
                                      },
                          '236187' => {
                                        'BaseType' => '234525',
                                        'Name' => 'struct sockaddr_storage*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '239423' => {
                                        'BaseType' => '96',
                                        'Header' => 'strnatcmp.h',
                                        'Line' => '24',
                                        'Name' => 'nat_char',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '239435' => {
                                        'BaseType' => '239423',
                                        'Name' => 'nat_char const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '239544' => {
                                        'BaseType' => '239435',
                                        'Name' => 'nat_char const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '242' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '62',
                                     'Name' => 'guint64',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '243632' => {
                                        'Header' => 'str_util.h',
                                        'Line' => '98',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'format_size_unit_none',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'format_size_unit_bytes',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'format_size_unit_bits',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'format_size_unit_bits_s',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'format_size_unit_bytes_s',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'format_size_unit_packets',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'format_size_unit_packets_s',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'format_size_prefix_si',
                                                             'value' => '0'
                                                           },
                                                    '8' => {
                                                             'name' => 'format_size_prefix_iec',
                                                             'value' => '256'
                                                           }
                                                  },
                                        'Name' => 'enum format_size_flags_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '245516' => {
                                        'BaseType' => '129',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '40',
                                        'Name' => 'gint8',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '245554' => {
                                        'BaseType' => '136',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '43',
                                        'Name' => 'gint16',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '247367' => {
                                        'BaseType' => '496',
                                        'Name' => 'gchar const**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '249445' => {
                                        'BaseType' => '213',
                                        'Name' => 'guint16*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '250425' => {
                                        'BaseType' => '242',
                                        'Name' => 'guint64*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '251325' => {
                                        'BaseType' => '245516',
                                        'Name' => 'gint8*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '251531' => {
                                        'BaseType' => '245554',
                                        'Name' => 'gint16*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '251737' => {
                                        'BaseType' => '22039',
                                        'Name' => 'gint32*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '252046' => {
                                        'BaseType' => '201992',
                                        'Name' => 'gint64*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '254' => {
                                     'BaseType' => '64',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '78',
                                     'Name' => 'gsize',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '255054' => {
                                        'Header' => 'report_message.h',
                                        'Line' => '32',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'vreport_failure',
                                                             'offset' => '0',
                                                             'type' => '255225'
                                                           },
                                                    '1' => {
                                                             'name' => 'vreport_warning',
                                                             'offset' => '8',
                                                             'type' => '255225'
                                                           },
                                                    '2' => {
                                                             'name' => 'report_open_failure',
                                                             'offset' => '16',
                                                             'type' => '255252'
                                                           },
                                                    '3' => {
                                                             'name' => 'report_read_failure',
                                                             'offset' => '24',
                                                             'type' => '255274'
                                                           },
                                                    '4' => {
                                                             'name' => 'report_write_failure',
                                                             'offset' => '32',
                                                             'type' => '255274'
                                                           },
                                                    '5' => {
                                                             'name' => 'report_cfile_open_failure',
                                                             'offset' => '40',
                                                             'type' => '255301'
                                                           },
                                                    '6' => {
                                                             'name' => 'report_cfile_dump_open_failure',
                                                             'offset' => '48',
                                                             'type' => '255333'
                                                           },
                                                    '7' => {
                                                             'name' => 'report_cfile_read_failure',
                                                             'offset' => '56',
                                                             'type' => '255301'
                                                           },
                                                    '8' => {
                                                             'name' => 'report_cfile_write_failure',
                                                             'offset' => '64',
                                                             'type' => '255375'
                                                           },
                                                    '9' => {
                                                             'name' => 'report_cfile_close_failure',
                                                             'offset' => '72',
                                                             'type' => '255301'
                                                           }
                                                  },
                                        'Name' => 'struct report_message_routines',
                                        'Size' => '80',
                                        'Type' => 'Struct'
                                      },
                          '255198' => {
                                        'BaseType' => '255054',
                                        'Name' => 'struct report_message_routines const',
                                        'Size' => '80',
                                        'Type' => 'Const'
                                      },
                          '255225' => {
                                        'Name' => 'void(*)(char const*, struct __va_list_tag*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '65363'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '255252' => {
                                        'Name' => 'void(*)(char const*, int, gboolean)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '78'
                                                            },
                                                     '2' => {
                                                              'type' => '400'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '255274' => {
                                        'Name' => 'void(*)(char const*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '78'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '255301' => {
                                        'Name' => 'void(*)(char const*, int, gchar*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '78'
                                                            },
                                                     '2' => {
                                                              'type' => '563'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '255333' => {
                                        'Name' => 'void(*)(char const*, int, gchar*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '78'
                                                            },
                                                     '2' => {
                                                              'type' => '563'
                                                            },
                                                     '3' => {
                                                              'type' => '78'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '255375' => {
                                        'Name' => 'void(*)(char const*, char const*, int, gchar*, guint32, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '85'
                                                            },
                                                     '2' => {
                                                              'type' => '78'
                                                            },
                                                     '3' => {
                                                              'type' => '563'
                                                            },
                                                     '4' => {
                                                              'type' => '230'
                                                            },
                                                     '5' => {
                                                              'type' => '78'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '255425' => {
                                        'BaseType' => '255198',
                                        'Name' => 'struct report_message_routines const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '265322' => {
                                        'BaseType' => '448',
                                        'Name' => 'double*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '265398' => {
                                        'BaseType' => '202040',
                                        'Name' => 'struct tm*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '266' => {
                                     'BaseType' => '254',
                                     'Name' => 'gsize const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '269288' => {
                                        'BaseType' => '183830',
                                        'Name' => 'ws_in6_addr const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '270005' => {
                                        'BaseType' => '269288',
                                        'Name' => 'ws_in6_addr const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '276852' => {
                                        'BaseType' => '448',
                                        'Header' => 'gtypes.h',
                                        'Line' => '58',
                                        'Name' => 'gdouble',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '286059' => {
                                        'Name' => '_Bool',
                                        'Size' => '1',
                                        'Type' => 'Intrinsic'
                                      },
                          '286269' => {
                                        'BaseType' => '150',
                                        'Name' => 'char*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '286946' => {
                                        'Header' => 'ws_getopt.h',
                                        'Line' => '41',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '85'
                                                           },
                                                    '1' => {
                                                             'name' => 'has_arg',
                                                             'offset' => '8',
                                                             'type' => '78'
                                                           },
                                                    '2' => {
                                                             'name' => 'flag',
                                                             'offset' => '16',
                                                             'type' => '165923'
                                                           },
                                                    '3' => {
                                                             'name' => 'val',
                                                             'offset' => '24',
                                                             'type' => '78'
                                                           }
                                                  },
                                        'Name' => 'struct ws_option',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '287012' => {
                                        'BaseType' => '286946',
                                        'Name' => 'struct ws_option const',
                                        'Size' => '32',
                                        'Type' => 'Const'
                                      },
                          '287326' => {
                                        'BaseType' => '286269',
                                        'Name' => 'char*const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '287332' => {
                                        'BaseType' => '287012',
                                        'Name' => 'struct ws_option const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '2891' => {
                                      'BaseType' => '2903',
                                      'Header' => 'wmem_core.h',
                                      'Line' => '41',
                                      'Name' => 'wmem_allocator_t',
                                      'Type' => 'Typedef'
                                    },
                          '2903' => {
                                      'Header' => 'wmem_allocator.h',
                                      'Line' => '26',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'walloc',
                                                           'offset' => '0',
                                                           'type' => '8133'
                                                         },
                                                  '1' => {
                                                           'name' => 'wfree',
                                                           'offset' => '8',
                                                           'type' => '8155'
                                                         },
                                                  '2' => {
                                                           'name' => 'wrealloc',
                                                           'offset' => '16',
                                                           'type' => '8186'
                                                         },
                                                  '3' => {
                                                           'name' => 'free_all',
                                                           'offset' => '24',
                                                           'type' => '7842'
                                                         },
                                                  '4' => {
                                                           'name' => 'gc',
                                                           'offset' => '32',
                                                           'type' => '7842'
                                                         },
                                                  '5' => {
                                                           'name' => 'cleanup',
                                                           'offset' => '40',
                                                           'type' => '7842'
                                                         },
                                                  '6' => {
                                                           'name' => 'callbacks',
                                                           'offset' => '48',
                                                           'type' => '8197'
                                                         },
                                                  '7' => {
                                                           'name' => 'private_data',
                                                           'offset' => '56',
                                                           'type' => '143'
                                                         },
                                                  '8' => {
                                                           'name' => 'type',
                                                           'offset' => '64',
                                                           'type' => '8016'
                                                         },
                                                  '9' => {
                                                           'name' => 'in_scope',
                                                           'offset' => '68',
                                                           'type' => '400'
                                                         }
                                                },
                                      'Name' => 'struct _wmem_allocator_t',
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '2908' => {
                                      'BaseType' => '2920',
                                      'Header' => 'wmem_array.h',
                                      'Line' => '35',
                                      'Name' => 'wmem_array_t',
                                      'Size' => '40',
                                      'Type' => 'Typedef'
                                    },
                          '2920' => {
                                      'Line' => '27',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'allocator',
                                                           'offset' => '0',
                                                           'type' => '3012'
                                                         },
                                                  '1' => {
                                                           'name' => 'buf',
                                                           'offset' => '8',
                                                           'type' => '569'
                                                         },
                                                  '2' => {
                                                           'name' => 'elem_size',
                                                           'offset' => '16',
                                                           'type' => '254'
                                                         },
                                                  '3' => {
                                                           'name' => 'elem_count',
                                                           'offset' => '24',
                                                           'type' => '424'
                                                         },
                                                  '4' => {
                                                           'name' => 'alloc_count',
                                                           'offset' => '28',
                                                           'type' => '424'
                                                         },
                                                  '5' => {
                                                           'name' => 'null_terminated',
                                                           'offset' => '32',
                                                           'type' => '400'
                                                         }
                                                },
                                      'Name' => 'struct _wmem_array_t',
                                      'Size' => '40',
                                      'Source' => 'wmem_array.c',
                                      'Type' => 'Struct'
                                    },
                          '292112' => {
                                        'BaseType' => '292124',
                                        'Header' => 'emmintrin.h',
                                        'Line' => '53',
                                        'Name' => '__m128i',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '292124' => {
                                        'BaseType' => '115',
                                        'Name' => 'long long[2]',
                                        'Size' => '16',
                                        'Type' => 'Array'
                                      },
                          '292188' => {
                                        'BaseType' => '359',
                                        'Name' => 'gchar[256]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '292204' => {
                                        'Header' => 'ws_mempbrk.h',
                                        'Line' => '27',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'patt',
                                                             'offset' => '0',
                                                             'type' => '292188'
                                                           },
                                                    '1' => {
                                                             'name' => 'use_sse42',
                                                             'offset' => '256',
                                                             'type' => '400'
                                                           },
                                                    '2' => {
                                                             'name' => 'mask',
                                                             'offset' => '272',
                                                             'type' => '292112'
                                                           }
                                                  },
                                        'Name' => 'struct ws_mempbrk_pattern',
                                        'Size' => '288',
                                        'Type' => 'Struct'
                                      },
                          '292216' => {
                                        'BaseType' => '292204',
                                        'Name' => 'ws_mempbrk_pattern const',
                                        'Size' => '288',
                                        'Type' => 'Const'
                                      },
                          '292368' => {
                                        'BaseType' => '292216',
                                        'Name' => 'ws_mempbrk_pattern const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '292605' => {
                                        'BaseType' => '292204',
                                        'Name' => 'ws_mempbrk_pattern*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '293742' => {
                                        'BaseType' => '78',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '198',
                                        'Name' => 'GPid',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '296699' => {
                                        'Header' => 'ws_pipe.h',
                                        'Line' => '30',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pid',
                                                             'offset' => '0',
                                                             'type' => '293742'
                                                           },
                                                    '1' => {
                                                             'name' => 'stderr_msg',
                                                             'offset' => '8',
                                                             'type' => '563'
                                                           },
                                                    '2' => {
                                                             'name' => 'exitcode',
                                                             'offset' => '16',
                                                             'type' => '388'
                                                           },
                                                    '3' => {
                                                             'name' => 'stdin_fd',
                                                             'offset' => '20',
                                                             'type' => '388'
                                                           },
                                                    '4' => {
                                                             'name' => 'stdout_fd',
                                                             'offset' => '24',
                                                             'type' => '388'
                                                           },
                                                    '5' => {
                                                             'name' => 'stderr_fd',
                                                             'offset' => '28',
                                                             'type' => '388'
                                                           }
                                                  },
                                        'Name' => 'struct _ws_pipe_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '296791' => {
                                        'BaseType' => '296699',
                                        'Header' => 'ws_pipe.h',
                                        'Line' => '40',
                                        'Name' => 'ws_pipe_t',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '297689' => {
                                        'BaseType' => '296791',
                                        'Name' => 'ws_pipe_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '29783' => {
                                       'BaseType' => '143',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3012' => {
                                      'BaseType' => '2891',
                                      'Name' => 'wmem_allocator_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3102' => {
                                      'BaseType' => '2908',
                                      'Name' => 'wmem_array_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '316948' => {
                                        'BaseType' => '276852',
                                        'Name' => 'gdouble*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '323093' => {
                                        'Header' => 'wslog.h',
                                        'Line' => '45',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tv_sec',
                                                             'offset' => '0',
                                                             'type' => '202028'
                                                           },
                                                    '1' => {
                                                             'name' => 'tv_nsec',
                                                             'offset' => '8',
                                                             'type' => '108'
                                                           }
                                                  },
                                        'Name' => 'struct ws_log_time_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '323105' => {
                                        'BaseType' => '323117',
                                        'Header' => 'wslog.h',
                                        'Line' => '49',
                                        'Name' => 'ws_log_writer_cb',
                                        'Type' => 'Typedef'
                                      },
                          '323117' => {
                                        'Name' => 'void(char const*, enum ws_log_level, ws_log_time_t, char const*, int, char const*, char const*, struct __va_list_tag*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '101134'
                                                            },
                                                     '2' => {
                                                              'type' => '323093'
                                                            },
                                                     '3' => {
                                                              'type' => '85'
                                                            },
                                                     '4' => {
                                                              'type' => '78'
                                                            },
                                                     '5' => {
                                                              'type' => '85'
                                                            },
                                                     '6' => {
                                                              'type' => '85'
                                                            },
                                                     '7' => {
                                                              'type' => '65363'
                                                            },
                                                     '8' => {
                                                              'type' => '143'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Type' => 'Func'
                                      },
                          '323174' => {
                                        'BaseType' => '7831',
                                        'Header' => 'wslog.h',
                                        'Line' => '57',
                                        'Name' => 'ws_log_writer_free_data_cb',
                                        'Type' => 'Typedef'
                                      },
                          '323518' => {
                                        'BaseType' => '323105',
                                        'Name' => 'ws_log_writer_cb*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '323568' => {
                                        'BaseType' => '323174',
                                        'Name' => 'ws_log_writer_free_data_cb*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '339166' => {
                                        'BaseType' => '95218',
                                        'Name' => 'guint32 const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '343579' => {
                                        'Header' => 'plugins.h',
                                        'Line' => '31',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'WS_PLUGIN_EPAN',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'WS_PLUGIN_WIRETAP',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'WS_PLUGIN_CODEC',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum plugin_type_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '343591' => {
                                        'BaseType' => '343603',
                                        'Header' => 'plugins.h',
                                        'Line' => '35',
                                        'Name' => 'plugin_description_callback',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '343603' => {
                                        'Name' => 'void(*)(char const*, char const*, char const*, char const*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '85'
                                                            },
                                                     '1' => {
                                                              'type' => '85'
                                                            },
                                                     '2' => {
                                                              'type' => '85'
                                                            },
                                                     '3' => {
                                                              'type' => '85'
                                                            },
                                                     '4' => {
                                                              'type' => '143'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '359' => {
                                     'BaseType' => '96',
                                     'Header' => 'gtypes.h',
                                     'Line' => '46',
                                     'Name' => 'gchar',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '371' => {
                                     'BaseType' => '359',
                                     'Name' => 'gchar const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '37115' => {
                                       'BaseType' => '242',
                                       'Name' => 'guint64 const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '388' => {
                                     'BaseType' => '78',
                                     'Header' => 'gtypes.h',
                                     'Line' => '49',
                                     'Name' => 'gint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '39810' => {
                                       'BaseType' => '39822',
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_tree_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '39822' => {
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '47',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'metadata_allocator',
                                                            'offset' => '0',
                                                            'type' => '3012'
                                                          },
                                                   '1' => {
                                                            'name' => 'data_allocator',
                                                            'offset' => '8',
                                                            'type' => '3012'
                                                          },
                                                   '2' => {
                                                            'name' => 'root',
                                                            'offset' => '16',
                                                            'type' => '40099'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata_scope_cb_id',
                                                            'offset' => '24',
                                                            'type' => '424'
                                                          },
                                                   '4' => {
                                                            'name' => 'data_scope_cb_id',
                                                            'offset' => '28',
                                                            'type' => '424'
                                                          },
                                                   '5' => {
                                                            'name' => 'post_rotation_cb',
                                                            'offset' => '32',
                                                            'type' => '40116'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_tree_t',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '39914' => {
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '21',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'WMEM_NODE_COLOR_RED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'WMEM_NODE_COLOR_BLACK',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum _wmem_node_color_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '39945' => {
                                       'BaseType' => '39914',
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '24',
                                       'Name' => 'wmem_node_color_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '39957' => {
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '27',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent',
                                                            'offset' => '0',
                                                            'type' => '40075'
                                                          },
                                                   '1' => {
                                                            'name' => 'left',
                                                            'offset' => '8',
                                                            'type' => '40075'
                                                          },
                                                   '2' => {
                                                            'name' => 'right',
                                                            'offset' => '16',
                                                            'type' => '40075'
                                                          },
                                                   '3' => {
                                                            'name' => 'key',
                                                            'offset' => '24',
                                                            'type' => '189'
                                                          },
                                                   '4' => {
                                                            'name' => 'data',
                                                            'offset' => '32',
                                                            'type' => '143'
                                                          },
                                                   '5' => {
                                                            'name' => 'color',
                                                            'offset' => '40',
                                                            'type' => '39945'
                                                          },
                                                   '6' => {
                                                            'name' => 'is_subtree',
                                                            'offset' => '44',
                                                            'type' => '400'
                                                          },
                                                   '7' => {
                                                            'name' => 'is_removed',
                                                            'offset' => '48',
                                                            'type' => '400'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_tree_node_t',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '400' => {
                                     'BaseType' => '388',
                                     'Header' => 'gtypes.h',
                                     'Line' => '50',
                                     'Name' => 'gboolean',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '40075' => {
                                       'BaseType' => '39957',
                                       'Name' => 'struct _wmem_tree_node_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40081' => {
                                       'BaseType' => '39957',
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '42',
                                       'Name' => 'wmem_tree_node_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '40099' => {
                                       'BaseType' => '40081',
                                       'Name' => 'wmem_tree_node_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40116' => {
                                       'Name' => 'void(*)(wmem_tree_node_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '40099'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '40204' => {
                                       'BaseType' => '40216',
                                       'Header' => 'wmem_list.h',
                                       'Line' => '36',
                                       'Name' => 'wmem_list_t',
                                       'Type' => 'Typedef'
                                     },
                          '40216' => {
                                       'Line' => '23',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'count',
                                                            'offset' => '0',
                                                            'type' => '424'
                                                          },
                                                   '1' => {
                                                            'name' => 'head',
                                                            'offset' => '8',
                                                            'type' => '44996'
                                                          },
                                                   '2' => {
                                                            'name' => 'tail',
                                                            'offset' => '16',
                                                            'type' => '44996'
                                                          },
                                                   '3' => {
                                                            'name' => 'allocator',
                                                            'offset' => '24',
                                                            'type' => '3012'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_list_t',
                                       'Size' => '32',
                                       'Source' => 'wmem_list.c',
                                       'Type' => 'Struct'
                                     },
                          '40221' => {
                                       'BaseType' => '39822',
                                       'Header' => 'wmem_interval_tree.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_itree_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '40323' => {
                                       'BaseType' => '39810',
                                       'Name' => 'wmem_tree_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40524' => {
                                       'BaseType' => '40204',
                                       'Name' => 'wmem_list_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '40530' => {
                                       'BaseType' => '40221',
                                       'Name' => 'wmem_itree_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '42297' => {
                                       'BaseType' => '189',
                                       'Header' => 'gtypes.h',
                                       'Line' => '104',
                                       'Name' => 'gconstpointer',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42316' => {
                                       'BaseType' => '42328',
                                       'Header' => 'gtypes.h',
                                       'Line' => '106',
                                       'Name' => 'GCompareFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42328' => {
                                       'Name' => 'gint(*)(gconstpointer, gconstpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '42297'
                                                           },
                                                    '1' => {
                                                             'type' => '42297'
                                                           }
                                                  },
                                       'Return' => '388',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '42383' => {
                                       'BaseType' => '42395',
                                       'Header' => 'gtypes.h',
                                       'Line' => '114',
                                       'Name' => 'GFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '42395' => {
                                       'Name' => 'void(*)(gpointer, gpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '455'
                                                           },
                                                    '1' => {
                                                             'type' => '455'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '424' => {
                                     'BaseType' => '45',
                                     'Header' => 'gtypes.h',
                                     'Line' => '55',
                                     'Name' => 'guint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '436' => {
                                     'BaseType' => '424',
                                     'Name' => 'guint const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '448' => {
                                     'Name' => 'double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '44849' => {
                                       'BaseType' => '40204',
                                       'Name' => 'wmem_list_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '44920' => {
                                       'BaseType' => '44937',
                                       'Header' => 'wmem_list.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_list_frame_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '44932' => {
                                       'BaseType' => '44920',
                                       'Name' => 'wmem_list_frame_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '44937' => {
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '44990'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '44990'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '16',
                                                            'type' => '143'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_list_frame_t',
                                       'Size' => '24',
                                       'Source' => 'wmem_list.c',
                                       'Type' => 'Struct'
                                     },
                          '44990' => {
                                       'BaseType' => '44937',
                                       'Name' => 'struct _wmem_list_frame_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '44996' => {
                                       'BaseType' => '44920',
                                       'Name' => 'wmem_list_frame_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '455' => {
                                     'BaseType' => '143',
                                     'Header' => 'gtypes.h',
                                     'Line' => '103',
                                     'Name' => 'gpointer',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '46250' => {
                                       'BaseType' => '44932',
                                       'Name' => 'wmem_list_frame_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46403' => {
                                       'BaseType' => '44849',
                                       'Name' => 'wmem_list_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '46641' => {
                                       'BaseType' => '201',
                                       'Name' => 'guint8 const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '46966' => {
                                       'BaseType' => '46978',
                                       'Header' => 'gtypes.h',
                                       'Line' => '111',
                                       'Name' => 'GEqualFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '46978' => {
                                       'Name' => 'gboolean(*)(gconstpointer, gconstpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '42297'
                                                           },
                                                    '1' => {
                                                             'type' => '42297'
                                                           }
                                                  },
                                       'Return' => '400',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '47033' => {
                                       'BaseType' => '47045',
                                       'Header' => 'gtypes.h',
                                       'Line' => '116',
                                       'Name' => 'GHashFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '47045' => {
                                       'Name' => 'guint(*)(gconstpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '42297'
                                                           }
                                                  },
                                       'Return' => '424',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '47066' => {
                                       'BaseType' => '47078',
                                       'Header' => 'gtypes.h',
                                       'Line' => '117',
                                       'Name' => 'GHFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '47078' => {
                                       'Name' => 'void(*)(gpointer, gpointer, gpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '455'
                                                           },
                                                    '1' => {
                                                             'type' => '455'
                                                           },
                                                    '2' => {
                                                             'type' => '455'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '49542' => {
                                       'BaseType' => '49554',
                                       'Header' => 'wmem_map.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_map_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '49554' => {
                                       'Line' => '44',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'count',
                                                            'offset' => '0',
                                                            'type' => '424'
                                                          },
                                                   '1' => {
                                                            'name' => 'capacity',
                                                            'offset' => '8',
                                                            'type' => '52'
                                                          },
                                                   '2' => {
                                                            'name' => 'table',
                                                            'offset' => '16',
                                                            'type' => '49869'
                                                          },
                                                   '3' => {
                                                            'name' => 'hash_func',
                                                            'offset' => '24',
                                                            'type' => '47033'
                                                          },
                                                   '4' => {
                                                            'name' => 'eql_func',
                                                            'offset' => '32',
                                                            'type' => '46966'
                                                          },
                                                   '5' => {
                                                            'name' => 'metadata_scope_cb_id',
                                                            'offset' => '40',
                                                            'type' => '424'
                                                          },
                                                   '6' => {
                                                            'name' => 'data_scope_cb_id',
                                                            'offset' => '44',
                                                            'type' => '424'
                                                          },
                                                   '7' => {
                                                            'name' => 'metadata_allocator',
                                                            'offset' => '48',
                                                            'type' => '3012'
                                                          },
                                                   '8' => {
                                                            'name' => 'data_allocator',
                                                            'offset' => '56',
                                                            'type' => '3012'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_map_t',
                                       'Size' => '64',
                                       'Source' => 'wmem_map.c',
                                       'Type' => 'Struct'
                                     },
                          '496' => {
                                     'BaseType' => '371',
                                     'Name' => 'gchar const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '49716' => {
                                       'BaseType' => '8076',
                                       'Header' => 'wmem_user_cb.h',
                                       'Line' => '34',
                                       'Name' => 'wmem_cb_event_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '49798' => {
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'key',
                                                            'offset' => '0',
                                                            'type' => '189'
                                                          },
                                                   '1' => {
                                                            'name' => 'value',
                                                            'offset' => '8',
                                                            'type' => '143'
                                                          },
                                                   '2' => {
                                                            'name' => 'next',
                                                            'offset' => '16',
                                                            'type' => '49851'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_map_item_t',
                                       'Size' => '24',
                                       'Source' => 'wmem_map.c',
                                       'Type' => 'Struct'
                                     },
                          '49851' => {
                                       'BaseType' => '49798',
                                       'Name' => 'struct _wmem_map_item_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '49857' => {
                                       'BaseType' => '49798',
                                       'Line' => '42',
                                       'Name' => 'wmem_map_item_t',
                                       'Size' => '24',
                                       'Source' => 'wmem_map.c',
                                       'Type' => 'Typedef'
                                     },
                          '49869' => {
                                       'BaseType' => '49875',
                                       'Name' => 'wmem_map_item_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '49875' => {
                                       'BaseType' => '49857',
                                       'Name' => 'wmem_map_item_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '5002' => {
                                      'BaseType' => '52',
                                      'Name' => 'size_t const',
                                      'Size' => '8',
                                      'Type' => 'Const'
                                    },
                          '50245' => {
                                       'BaseType' => '46641',
                                       'Name' => 'guint8 const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '50307' => {
                                       'BaseType' => '49542',
                                       'Name' => 'wmem_map_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '51202' => {
                                       'BaseType' => '189',
                                       'Name' => 'void const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52' => {
                                    'BaseType' => '64',
                                    'Header' => 'stddef.h',
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '563' => {
                                     'BaseType' => '359',
                                     'Name' => 'gchar*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '569' => {
                                     'BaseType' => '201',
                                     'Name' => 'guint8*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '575' => {
                                     'BaseType' => '455',
                                     'Name' => 'gpointer*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '581' => {
                                     'BaseType' => '230',
                                     'Header' => 'gquark.h',
                                     'Line' => '36',
                                     'Name' => 'GQuark',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '59051' => {
                                       'BaseType' => '40204',
                                       'Header' => 'wmem_stack.h',
                                       'Line' => '35',
                                       'Name' => 'wmem_stack_t',
                                       'Type' => 'Typedef'
                                     },
                          '59063' => {
                                       'BaseType' => '59051',
                                       'Name' => 'wmem_stack_t const',
                                       'Type' => 'Const'
                                     },
                          '59193' => {
                                       'BaseType' => '59051',
                                       'Name' => 'wmem_stack_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '593' => {
                                     'BaseType' => '605',
                                     'Header' => 'gerror.h',
                                     'Line' => '41',
                                     'Name' => 'GError',
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '59424' => {
                                       'BaseType' => '59063',
                                       'Name' => 'wmem_stack_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '59657' => {
                                       'Header' => '<built-in>',
                                       'Line' => '0',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'gp_offset',
                                                            'offset' => '0',
                                                            'type' => '45'
                                                          },
                                                   '1' => {
                                                            'name' => 'fp_offset',
                                                            'offset' => '4',
                                                            'type' => '45'
                                                          },
                                                   '2' => {
                                                            'name' => 'overflow_arg_area',
                                                            'offset' => '8',
                                                            'type' => '143'
                                                          },
                                                   '3' => {
                                                            'name' => 'reg_save_area',
                                                            'offset' => '16',
                                                            'type' => '143'
                                                          }
                                                 },
                                       'Name' => 'struct __va_list_tag',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '605' => {
                                     'Header' => 'gerror.h',
                                     'Line' => '43',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'domain',
                                                          'offset' => '0',
                                                          'type' => '581'
                                                        },
                                                 '1' => {
                                                          'name' => 'code',
                                                          'offset' => '4',
                                                          'type' => '388'
                                                        },
                                                 '2' => {
                                                          'name' => 'message',
                                                          'offset' => '8',
                                                          'type' => '563'
                                                        }
                                               },
                                     'Name' => 'struct _GError',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '62075' => {
                                       'BaseType' => '230',
                                       'Header' => 'gunicode.h',
                                       'Line' => '59',
                                       'Name' => 'gunichar',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '62087' => {
                                       'BaseType' => '62075',
                                       'Name' => 'gunichar const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '63187' => {
                                       'BaseType' => '63199',
                                       'Header' => 'wmem_strbuf.h',
                                       'Line' => '35',
                                       'Name' => 'wmem_strbuf_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '63199' => {
                                       'Line' => '35',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'allocator',
                                                            'offset' => '0',
                                                            'type' => '3012'
                                                          },
                                                   '1' => {
                                                            'name' => 'str',
                                                            'offset' => '8',
                                                            'type' => '563'
                                                          },
                                                   '2' => {
                                                            'name' => 'len',
                                                            'offset' => '16',
                                                            'type' => '254'
                                                          },
                                                   '3' => {
                                                            'name' => 'alloc_len',
                                                            'offset' => '24',
                                                            'type' => '254'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_len',
                                                            'offset' => '32',
                                                            'type' => '254'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_strbuf_t',
                                       'Size' => '40',
                                       'Source' => 'wmem_strbuf.c',
                                       'Type' => 'Struct'
                                     },
                          '63408' => {
                                       'BaseType' => '63187',
                                       'Name' => 'wmem_strbuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '64' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '65363' => {
                                       'BaseType' => '59657',
                                       'Name' => 'struct __va_list_tag*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '658' => {
                                     'Name' => 'void(*)()',
                                     'Return' => '1',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '67174' => {
                                       'BaseType' => '108',
                                       'Header' => 'glibconfig.h',
                                       'Line' => '77',
                                       'Name' => 'gssize',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '68936' => {
                                       'BaseType' => '563',
                                       'Name' => 'gchar**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '71' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '76896' => {
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '144',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '230'
                                                          },
                                                   '1' => {
                                                            'name' => 'key',
                                                            'offset' => '8',
                                                            'type' => '76936'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_tree_key_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '76936' => {
                                       'BaseType' => '230',
                                       'Name' => 'guint32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76942' => {
                                       'BaseType' => '76896',
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '147',
                                       'Name' => 'wmem_tree_key_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '76954' => {
                                       'BaseType' => '76966',
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '213',
                                       'Name' => 'wmem_foreach_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '76966' => {
                                       'Name' => 'gboolean(*)(void const*, void*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '189'
                                                           },
                                                    '1' => {
                                                             'type' => '143'
                                                           },
                                                    '2' => {
                                                             'type' => '143'
                                                           }
                                                  },
                                       'Return' => '400',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '78' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '7831' => {
                                      'Name' => 'void(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Type' => 'Func'
                                    },
                          '7842' => {
                                      'Name' => 'void(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '78918' => {
                                       'BaseType' => '76942',
                                       'Name' => 'wmem_tree_key_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '8016' => {
                                      'Header' => 'wmem_core.h',
                                      'Line' => '44',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WMEM_ALLOCATOR_SIMPLE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WMEM_ALLOCATOR_BLOCK',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'WMEM_ALLOCATOR_STRICT',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'WMEM_ALLOCATOR_BLOCK_FAST',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum _wmem_allocator_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8059' => {
                                      'BaseType' => '8016',
                                      'Header' => 'wmem_core.h',
                                      'Line' => '62',
                                      'Name' => 'wmem_allocator_type_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '8071' => {
                                      'BaseType' => '8059',
                                      'Name' => 'wmem_allocator_type_t const',
                                      'Size' => '4',
                                      'Type' => 'Const'
                                    },
                          '8076' => {
                                      'Header' => 'wmem_user_cb.h',
                                      'Line' => '31',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WMEM_CB_FREE_EVENT',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WMEM_CB_DESTROY_EVENT',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum _wmem_cb_event_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '8133' => {
                                      'Name' => 'void*(*)(void*, size_t const)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          },
                                                   '1' => {
                                                            'type' => '5002'
                                                          }
                                                 },
                                      'Return' => '143',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8155' => {
                                      'Name' => 'void(*)(void*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          },
                                                   '1' => {
                                                            'type' => '143'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8186' => {
                                      'Name' => 'void*(*)(void*, void*, size_t const)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          },
                                                   '1' => {
                                                            'type' => '143'
                                                          },
                                                   '2' => {
                                                            'type' => '5002'
                                                          }
                                                 },
                                      'Return' => '143',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8192' => {
                                      'Line' => '18',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cb',
                                                           'offset' => '0',
                                                           'type' => '88036'
                                                         },
                                                  '1' => {
                                                           'name' => 'user_data',
                                                           'offset' => '8',
                                                           'type' => '143'
                                                         },
                                                  '2' => {
                                                           'name' => 'next',
                                                           'offset' => '16',
                                                           'type' => '8197'
                                                         },
                                                  '3' => {
                                                           'name' => 'id',
                                                           'offset' => '24',
                                                           'type' => '424'
                                                         }
                                                },
                                      'Name' => 'struct _wmem_user_cb_container_t',
                                      'Size' => '32',
                                      'Source' => 'wmem_user_cb.c',
                                      'Type' => 'Struct'
                                    },
                          '8197' => {
                                      'BaseType' => '8192',
                                      'Name' => 'struct _wmem_user_cb_container_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '82559' => {
                                       'BaseType' => '424',
                                       'Name' => 'guint*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '85' => {
                                    'BaseType' => '103',
                                    'Name' => 'char const*',
                                    'Size' => '8',
                                    'Type' => 'Pointer'
                                  },
                          '88036' => {
                                       'BaseType' => '88048',
                                       'Header' => 'wmem_user_cb.h',
                                       'Line' => '44',
                                       'Name' => 'wmem_user_cb_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '88048' => {
                                       'Name' => 'gboolean(*)(wmem_allocator_t*, wmem_cb_event_t, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '3012'
                                                           },
                                                    '1' => {
                                                             'type' => '49716'
                                                           },
                                                    '2' => {
                                                             'type' => '143'
                                                           }
                                                  },
                                       'Return' => '400',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '95218' => {
                                       'BaseType' => '230',
                                       'Name' => 'guint32 const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '96' => {
                                    'Name' => 'char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  }
                        },
          'UndefinedSymbols' => {
                                  'libwsutil.so.13.0.0' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '__assert_fail@GLIBC_2.2.5' => 0,
                                                             '__cxa_atexit@GLIBC_2.2.5' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__errno_location@GLIBC_2.2.5' => 0,
                                                             '__fdelt_chk@GLIBC_2.15' => 0,
                                                             '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__fxstat@GLIBC_2.2.5' => 0,
                                                             '__gmon_start__' => 0,
                                                             '__isoc99_sscanf@GLIBC_2.7' => 0,
                                                             '__memcpy_chk@GLIBC_2.3.4' => 0,
                                                             '__printf_chk@GLIBC_2.3.4' => 0,
                                                             '__stack_chk_fail@GLIBC_2.4' => 0,
                                                             '__uflow@GLIBC_2.2.5' => 0,
                                                             '__vfprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__vsnprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__xstat@GLIBC_2.2.5' => 0,
                                                             '_gcry_mpi_get_const@GCRYPT_1.6' => 0,
                                                             'abort@GLIBC_2.2.5' => 0,
                                                             'access@GLIBC_2.2.5' => 0,
                                                             'clock_gettime@GLIBC_2.17' => 0,
                                                             'close@GLIBC_2.2.5' => 0,
                                                             'endgrent@GLIBC_2.2.5' => 0,
                                                             'endpwent@GLIBC_2.2.5' => 0,
                                                             'exit@GLIBC_2.2.5' => 0,
                                                             'fclose@GLIBC_2.2.5' => 0,
                                                             'fcntl@GLIBC_2.2.5' => 0,
                                                             'feof@GLIBC_2.2.5' => 0,
                                                             'ferror@GLIBC_2.2.5' => 0,
                                                             'fflush@GLIBC_2.2.5' => 0,
                                                             'fileno@GLIBC_2.2.5' => 0,
                                                             'fopen@GLIBC_2.2.5' => 0,
                                                             'fputc@GLIBC_2.2.5' => 0,
                                                             'fputs@GLIBC_2.2.5' => 0,
                                                             'fread@GLIBC_2.2.5' => 0,
                                                             'freeifaddrs@GLIBC_2.3' => 0,
                                                             'fwrite@GLIBC_2.2.5' => 0,
                                                             'g_ascii_dtostr' => 0,
                                                             'g_ascii_strcasecmp' => 0,
                                                             'g_ascii_strtod' => 0,
                                                             'g_ascii_strtoll' => 0,
                                                             'g_ascii_strtoull' => 0,
                                                             'g_ascii_table' => 0,
                                                             'g_ascii_tolower' => 0,
                                                             'g_ascii_toupper' => 0,
                                                             'g_assertion_message' => 0,
                                                             'g_assertion_message_expr' => 0,
                                                             'g_base64_encode_close' => 0,
                                                             'g_base64_encode_step' => 0,
                                                             'g_build_filename' => 0,
                                                             'g_dir_close' => 0,
                                                             'g_dir_open' => 0,
                                                             'g_dir_read_name' => 0,
                                                             'g_file_open_tmp' => 0,
                                                             'g_file_test' => 0,
                                                             'g_filename_to_uri' => 0,
                                                             'g_free' => 0,
                                                             'g_get_home_dir' => 0,
                                                             'g_get_monotonic_time' => 0,
                                                             'g_get_user_config_dir' => 0,
                                                             'g_getenv' => 0,
                                                             'g_hash_table_destroy' => 0,
                                                             'g_hash_table_get_keys' => 0,
                                                             'g_hash_table_insert' => 0,
                                                             'g_hash_table_iter_init' => 0,
                                                             'g_hash_table_iter_next' => 0,
                                                             'g_hash_table_lookup' => 0,
                                                             'g_hash_table_lookup_extended' => 0,
                                                             'g_hash_table_new' => 0,
                                                             'g_hash_table_new_full' => 0,
                                                             'g_hash_table_remove' => 0,
                                                             'g_hash_table_replace' => 0,
                                                             'g_hash_table_size' => 0,
                                                             'g_list_first' => 0,
                                                             'g_list_free' => 0,
                                                             'g_log' => 0,
                                                             'g_log_set_handler' => 0,
                                                             'g_log_writer_supports_color' => 0,
                                                             'g_malloc' => 0,
                                                             'g_malloc0' => 0,
                                                             'g_malloc_n' => 0,
                                                             'g_mkdir_with_parents' => 0,
                                                             'g_module_close' => 0,
                                                             'g_module_error' => 0,
                                                             'g_module_name' => 0,
                                                             'g_module_open' => 0,
                                                             'g_module_supported' => 0,
                                                             'g_module_symbol' => 0,
                                                             'g_path_is_absolute' => 0,
                                                             'g_ptr_array_add' => 0,
                                                             'g_ptr_array_free' => 0,
                                                             'g_ptr_array_new' => 0,
                                                             'g_ptr_array_new_with_free_func' => 0,
                                                             'g_ptr_array_remove_index' => 0,
                                                             'g_ptr_array_set_free_func' => 0,
                                                             'g_ptr_array_sized_new' => 0,
                                                             'g_ptr_array_sort' => 0,
                                                             'g_random_int' => 0,
                                                             'g_realloc' => 0,
                                                             'g_return_if_fail_warning' => 0,
                                                             'g_set_prgname' => 0,
                                                             'g_shell_quote' => 0,
                                                             'g_slist_foreach' => 0,
                                                             'g_slist_free' => 0,
                                                             'g_slist_prepend' => 0,
                                                             'g_slist_remove' => 0,
                                                             'g_snprintf' => 0,
                                                             'g_spawn_async_with_pipes' => 0,
                                                             'g_spawn_close_pid' => 0,
                                                             'g_spawn_sync' => 0,
                                                             'g_stpcpy' => 0,
                                                             'g_str_equal' => 0,
                                                             'g_str_has_prefix' => 0,
                                                             'g_str_has_suffix' => 0,
                                                             'g_str_hash' => 0,
                                                             'g_strchomp' => 0,
                                                             'g_strchug' => 0,
                                                             'g_strcmp0' => 0,
                                                             'g_strdelimit' => 0,
                                                             'g_strdup' => 0,
                                                             'g_strdup_printf' => 0,
                                                             'g_strerror' => 0,
                                                             'g_strfreev' => 0,
                                                             'g_string_append' => 0,
                                                             'g_string_append_printf' => 0,
                                                             'g_string_append_vprintf' => 0,
                                                             'g_string_free' => 0,
                                                             'g_string_insert_c' => 0,
                                                             'g_string_new' => 0,
                                                             'g_string_sized_new' => 0,
                                                             'g_strlcat' => 0,
                                                             'g_strlcpy' => 0,
                                                             'g_unichar_isprint' => 0,
                                                             'g_unichar_to_utf8' => 0,
                                                             'g_unichar_validate' => 0,
                                                             'g_utf8_get_char' => 0,
                                                             'g_utf8_skip' => 0,
                                                             'g_utf8_validate' => 0,
                                                             'g_vsnprintf' => 0,
                                                             'gcry_cipher_close@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_encrypt@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_open@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_setctr@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_setiv@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_setkey@GCRYPT_1.6' => 0,
                                                             'gcry_ctx_release@GCRYPT_1.6' => 0,
                                                             'gcry_mac_close@GCRYPT_1.6' => 0,
                                                             'gcry_mac_open@GCRYPT_1.6' => 0,
                                                             'gcry_mac_read@GCRYPT_1.6' => 0,
                                                             'gcry_mac_setkey@GCRYPT_1.6' => 0,
                                                             'gcry_mac_write@GCRYPT_1.6' => 0,
                                                             'gcry_md_close@GCRYPT_1.6' => 0,
                                                             'gcry_md_get_algo_dlen@GCRYPT_1.6' => 0,
                                                             'gcry_md_open@GCRYPT_1.6' => 0,
                                                             'gcry_md_read@GCRYPT_1.6' => 0,
                                                             'gcry_md_reset@GCRYPT_1.6' => 0,
                                                             'gcry_md_setkey@GCRYPT_1.6' => 0,
                                                             'gcry_md_write@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_cmp@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_ec_get_affine@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_ec_mul@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_ec_new@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_invm@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_point_new@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_point_release@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_point_set@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_print@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_release@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_scan@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_set_ui@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_swap@GCRYPT_1.6' => 0,
                                                             'gcry_pk_decrypt@GCRYPT_1.6' => 0,
                                                             'gcry_sexp_build@GCRYPT_1.6' => 0,
                                                             'gcry_sexp_nth_mpi@GCRYPT_1.6' => 0,
                                                             'gcry_sexp_release@GCRYPT_1.6' => 0,
                                                             'gcry_strerror@GCRYPT_1.6' => 0,
                                                             'getcwd@GLIBC_2.2.5' => 0,
                                                             'getdtablesize@GLIBC_2.2.5' => 0,
                                                             'getegid@GLIBC_2.2.5' => 0,
                                                             'getenv@GLIBC_2.2.5' => 0,
                                                             'geteuid@GLIBC_2.2.5' => 0,
                                                             'getgid@GLIBC_2.2.5' => 0,
                                                             'getgrgid@GLIBC_2.2.5' => 0,
                                                             'getifaddrs@GLIBC_2.3' => 0,
                                                             'getpid@GLIBC_2.2.5' => 0,
                                                             'getpwuid@GLIBC_2.2.5' => 0,
                                                             'getresgid@GLIBC_2.2.5' => 0,
                                                             'getresuid@GLIBC_2.2.5' => 0,
                                                             'getrusage@GLIBC_2.2.5' => 0,
                                                             'gettimeofday@GLIBC_2.2.5' => 0,
                                                             'getuid@GLIBC_2.2.5' => 0,
                                                             'gnutls_pkcs12_bag_decrypt@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_deinit@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_get_count@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_get_data@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_get_type@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_init@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_deinit@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_get_bag@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_import@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_init@GNUTLS_3_4' => 0,
                                                             'gnutls_strerror@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_deinit@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_export_rsa_raw@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_get_pk_algorithm@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_import@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_import_pkcs8@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_init@GNUTLS_3_4' => 0,
                                                             'inet_ntop@GLIBC_2.2.5' => 0,
                                                             'inet_pton@GLIBC_2.2.5' => 0,
                                                             'localtime@GLIBC_2.2.5' => 0,
                                                             'mblen@GLIBC_2.2.5' => 0,
                                                             'mbtowc@GLIBC_2.2.5' => 0,
                                                             'memcmp@GLIBC_2.2.5' => 0,
                                                             'memcpy@GLIBC_2.14' => 0,
                                                             'memmove@GLIBC_2.2.5' => 0,
                                                             'memset@GLIBC_2.2.5' => 0,
                                                             'mkdir@GLIBC_2.2.5' => 0,
                                                             'mktime@GLIBC_2.2.5' => 0,
                                                             'open@GLIBC_2.2.5' => 0,
                                                             'pathconf@GLIBC_2.2.5' => 0,
                                                             'putc@GLIBC_2.2.5' => 0,
                                                             'putchar@GLIBC_2.2.5' => 0,
                                                             'qsort@GLIBC_2.2.5' => 0,
                                                             'read@GLIBC_2.2.5' => 0,
                                                             'readlink@GLIBC_2.2.5' => 0,
                                                             'remove@GLIBC_2.2.5' => 0,
                                                             'rename@GLIBC_2.2.5' => 0,
                                                             'select@GLIBC_2.2.5' => 0,
                                                             'setresgid@GLIBC_2.2.5' => 0,
                                                             'setresuid@GLIBC_2.2.5' => 0,
                                                             'stderr@GLIBC_2.2.5' => 0,
                                                             'stdout@GLIBC_2.2.5' => 0,
                                                             'strchr@GLIBC_2.2.5' => 0,
                                                             'strcmp@GLIBC_2.2.5' => 0,
                                                             'strncmp@GLIBC_2.2.5' => 0,
                                                             'strptime@GLIBC_2.2.5' => 0,
                                                             'strrchr@GLIBC_2.2.5' => 0,
                                                             'strstr@GLIBC_2.2.5' => 0,
                                                             'strtok@GLIBC_2.2.5' => 0,
                                                             'strtol@GLIBC_2.2.5' => 0,
                                                             'syscall@GLIBC_2.2.5' => 0,
                                                             'time@GLIBC_2.2.5' => 0,
                                                             'uname@GLIBC_2.2.5' => 0,
                                                             'write@GLIBC_2.2.5' => 0
                                                           }
                                },
          'WordSize' => '8'
        };
