$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '11.2.0',
          'Headers' => {
                         '<built-in>' => 1,
                         'FILE.h' => 1,
                         'buffer.h' => 1,
                         'codecs.h' => 1,
                         'crc16-plain.h' => 1,
                         'crc32.h' => 1,
                         'eax.h' => 1,
                         'emmintrin.h' => 1,
                         'feature_list.h' => 1,
                         'filesystem.h' => 1,
                         'garray.h' => 1,
                         'gconvert.h' => 1,
                         'gcrypt.h' => 1,
                         'gerror.h' => 1,
                         'ghash.h' => 1,
                         'giochannel.h' => 1,
                         'glibconfig.h' => 1,
                         'glist.h' => 1,
                         'gmain.h' => 1,
                         'gnutls.h' => 1,
                         'gpg-error.h' => 1,
                         'gquark.h' => 1,
                         'gslist.h' => 1,
                         'gstring.h' => 1,
                         'gtypes.h' => 1,
                         'gunicode.h' => 1,
                         'inet_addr.h' => 1,
                         'inet_ipv4.h' => 1,
                         'inet_ipv6.h' => 1,
                         'jsmn.h' => 1,

                                                    'ws_logv_full' => 1,
                                                    'ws_memmem' => 1,
                                                    'ws_mempbrk_compile' => 1,
                                                    'ws_mempbrk_exec' => 1,
                                                    'ws_optarg' => -8,
                                                    'ws_opterr' => -4,
                                                    'ws_optind' => -4,
                                                    'ws_optopt' => -4,
                                                    'ws_optpos' => -4,
                                                    'ws_optreset' => -4,
                                                    'ws_pipe_data_available' => 1,
                                                    'ws_pipe_init' => 1,
                                                    'ws_pipe_spawn_async' => 1,
                                                    'ws_pipe_spawn_sync' => 1,
                                                    'ws_regex_compile' => 1,
                                                    'ws_regex_compile_ex' => 1,
                                                    'ws_regex_free' => 1,
                                                    'ws_regex_matches' => 1,
                                                    'ws_regex_matches_length' => 1,
                                                    'ws_regex_matches_pos' => 1,
                                                    'ws_regex_pattern' => 1,
                                                    'ws_socket_ptoa' => 1,
                                                    'ws_strcasestr' => 1,
                                                    'ws_strdup_underline' => 1,
                                                    'ws_strerrorname_r' => 1,
                                                    'ws_strptime' => 1,
                                                    'ws_strtoi' => 1,
                                                    'ws_strtoi16' => 1,
                                                    'ws_strtoi32' => 1,
                                                    'ws_strtoi64' => 1,
                                                    'ws_strtoi8' => 1,
                                                    'ws_strtou' => 1,
                                                    'ws_strtou16' => 1,
                                                    'ws_strtou32' => 1,
                                                    'ws_strtou64' => 1,
                                                    'ws_strtou8' => 1,
                                                    'ws_utf8_char_len' => 1,
                                                    'ws_vadd_crash_info' => 1,
                                                    'ws_xton' => 1
                                                  }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '100623' => {
                                        'BaseType' => '99740',
                                        'Name' => 'json_dumper*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '103' => {
                                     'BaseType' => '96',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '105026' => {
                                        'BaseType' => '83',
                                        'Name' => 'int const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '105125' => {
                                        'Header' => 'mpeg-audio.h',
                                        'Line' => '17',
                                        'Memb' => {
                                                    '0' => {
                                                             'bitfield' => '2',
                                                             'name' => 'emphasis',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '1' => {
                                                             'bitfield' => '1',
                                                             'name' => 'original',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '10' => {
                                                              'bitfield' => '2',
                                                              'name' => 'layer',
                                                              'offset' => '0',
                                                              'type' => '45'
                                                            },
                                                    '11' => {
                                                              'bitfield' => '2',
                                                              'name' => 'version',
                                                              'offset' => '0',
                                                              'type' => '45'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '11',
                                                              'name' => 'sync',
                                                              'offset' => '0',
                                                              'type' => '45'
                                                            },
                                                    '2' => {
                                                             'bitfield' => '1',
                                                             'name' => 'copyright',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '3' => {
                                                             'bitfield' => '2',
                                                             'name' => 'modeext',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '4' => {
                                                             'bitfield' => '2',
                                                             'name' => 'mode',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '5' => {
                                                             'bitfield' => '1',
                                                             'name' => 'priv',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '6' => {
                                                             'bitfield' => '1',
                                                             'name' => 'padding',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '7' => {
                                                             'bitfield' => '2',
                                                             'name' => 'frequency',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '8' => {
                                                             'bitfield' => '4',
                                                             'name' => 'bitrate',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           },
                                                    '9' => {
                                                             'bitfield' => '1',
                                                             'name' => 'protection',
                                                             'offset' => '0',
                                                             'type' => '45'
                                                           }
                                                  },
                                        'Name' => 'struct mpa',
                                        'Size' => '4',
                                        'Type' => 'Struct'
                                      },
                          '105347' => {
                                        'BaseType' => '105125',
                                        'Name' => 'struct mpa const',
                                        'Size' => '4',
                                        'Type' => 'Const'
                                      },
                          '105737' => {
                                        'BaseType' => '105347',
                                        'Name' => 'struct mpa const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '106213' => {
                                        'BaseType' => '108',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '63',
                                        'Name' => 'gint64',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '106237' => {
                                        'BaseType' => '74015',
                                        'Header' => 'time_t.h',
                                        'Line' => '10',
                                        'Name' => 'time_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '106249' => {
                                        'Header' => 'struct_tm.h',
                                        'Line' => '7',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'tm_sec',
                                                             'offset' => '0',
                                                             'type' => '83'
                                                           },
                                                    '1' => {
                                                             'name' => 'tm_min',
                                                             'offset' => '4',
                                                             'type' => '83'
                                                           },
                                                    '10' => {
                                                              'name' => 'tm_zone',
                                                              'offset' => '72',
                                                              'type' => '90'
                                                            },
                                                    '2' => {
                                                             'name' => 'tm_hour',
                                                             'offset' => '8',
                                                             'type' => '83'
                                                           },
                                                    '3' => {
                                                             'name' => 'tm_mday',
                                                             'offset' => '18',
                                                             'type' => '83'
                                                           },
                                                    '4' => {
                                                             'name' => 'tm_mon',
                                                             'offset' => '22',
                                                             'type' => '83'
                                                           },
                                                    '5' => {
                                                             'name' => 'tm_year',
                                                             'offset' => '32',
                                                             'type' => '83'
                                                           },
                                                    '6' => {
                                                             'name' => 'tm_wday',
                                                             'offset' => '36',
                                                             'type' => '83'
                                                           },
                                                    '7' => {
                                                             'name' => 'tm_yday',
                                                             'offset' => '40',
                                                             'type' => '83'
                                                           },
                                                    '8' => {
                                                             'name' => 'tm_isdst',
                                                             'offset' => '50',
                                                             'type' => '83'
                                                           },
                                                    '9' => {
                                                             'name' => 'tm_gmtoff',
                                                             'offset' => '64',
                                                             'type' => '108'
                                                           }
                                                  },
                                        'Name' => 'struct tm',
                                        'Size' => '56',
                                        'Type' => 'Struct'
                                      },
                          '106617' => {
                                        'Header' => 'nstime.h',
                                        'Line' => '31',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'secs',
                                                             'offset' => '0',
                                                             'type' => '106237'
                                                           },
                                                    '1' => {
                                                             'name' => 'nsecs',
                                                             'offset' => '8',
                                                             'type' => '83'
                                                           }
                                                  },
                                        'Name' => 'struct nstime_t',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '106629' => {
                                        'BaseType' => '106617',
                                        'Name' => 'nstime_t const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '106667' => {
                                        'Header' => 'nstime.h',
                                        'Line' => '130',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ISO8601_DATETIME',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'ISO8601_DATETIME_BASIC',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'ISO8601_DATETIME_AUTO',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum iso8601_fmt_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '106711' => {
                                        'BaseType' => '106249',
                                        'Name' => 'struct tm*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '107241' => {
                                        'BaseType' => '106617',
                                        'Name' => 'nstime_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '108' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '108619' => {
                                        'BaseType' => '106629',
                                        'Name' => 'nstime_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '115' => {
                                     'Name' => 'long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '115535' => {
                                        'BaseType' => '115552',
                                        'Header' => 'regex.h',
                                        'Line' => '20',
                                        'Name' => 'ws_regex_t',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '115547' => {
                                        'BaseType' => '115535',
                                        'Name' => 'ws_regex_t const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '115552' => {
                                        'Line' => '18',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'code',
                                                             'offset' => '0',
                                                             'type' => '115730'
                                                           },
                                                    '1' => {
                                                             'name' => 'pattern',
                                                             'offset' => '8',
                                                             'type' => '2591'
                                                           }
                                                  },
                                        'Name' => 'struct _ws_regex',
                                        'Size' => '16',
                                        'Source' => 'regex.c',
                                        'Type' => 'Struct'
                                      },
                          '115683' => {
                                        'BaseType' => '115701',
                                        'Header' => 'pcre2.h',
                                        'Line' => '935',
                                        'Name' => 'pcre2_code_8',
                                        'Type' => 'Typedef'
                                      },
                          '115701' => {
                                        'Name' => 'struct pcre2_real_code_8',
                                        'Type' => 'Struct'
                                      },
                          '115730' => {
                                        'BaseType' => '115683',
                                        'Name' => 'pcre2_code_8*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '116205' => {
                                        'BaseType' => '115547',
                                        'Name' => 'ws_regex_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '116307' => {
                                        'BaseType' => '115535',
                                        'Name' => 'ws_regex_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '120046' => {
                                        'BaseType' => '120052',
                                        'Name' => 'struct gnutls_x509_privkey_int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '120052' => {
                                        'Name' => 'struct gnutls_x509_privkey_int',
                                        'Type' => 'Struct'
                                      },
                          '120120' => {
                                        'BaseType' => '120046',
                                        'Header' => 'gnutls.h',
                                        'Line' => '2007',
                                        'Name' => 'gnutls_x509_privkey_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '122' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '125486' => {
                                        'Header' => 'sober128.h',
                                        'Line' => '29',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'R',
                                                             'offset' => '0',
                                                             'type' => '125595'
                                                           },
                                                    '1' => {
                                                             'name' => 'initR',
                                                             'offset' => '310',
                                                             'type' => '125595'
                                                           },
                                                    '2' => {
                                                             'name' => 'konst',
                                                             'offset' => '626',
                                                             'type' => '69'
                                                           },
                                                    '3' => {
                                                             'name' => 'sbuf',
                                                             'offset' => '640',
                                                             'type' => '69'
                                                           },
                                                    '4' => {
                                                             'name' => 'nbuf',
                                                             'offset' => '648',
                                                             'type' => '83'
                                                           },
                                                    '5' => {
                                                             'name' => 'flag',
                                                             'offset' => '658',
                                                             'type' => '83'
                                                           },
                                                    '6' => {
                                                             'name' => 'set',
                                                             'offset' => '662',
                                                             'type' => '83'
                                                           }
                                                  },
                                        'Name' => 'struct _sober128_prng',
                                        'Size' => '304',
                                        'Type' => 'Struct'
                                      },
                          '125595' => {
                                        'BaseType' => '69',
                                        'Name' => 'unsigned long[17]',
                                        'Size' => '136',
                                        'Type' => 'Array'
                                      },
                          '125625' => {
                                        'BaseType' => '125486',
                                        'Header' => 'sober128.h',
                                        'Line' => '39',
                                        'Name' => 'sober128_prng',
                                        'Size' => '304',
                                        'Type' => 'Typedef'
                                      },
                          '126406' => {
                                        'BaseType' => '125625',
                                        'Name' => 'sober128_prng*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '127940' => {
                                        'Header' => 'socket.h',
                                        'Line' => '193',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ss_family',
                                                             'offset' => '0',
                                                             'type' => '95600'
                                                           },
                                                    '1' => {
                                                             'name' => '__ss_padding',
                                                             'offset' => '2',
                                                             'type' => '127993'
                                                           },
                                                    '2' => {
                                                             'name' => '__ss_align',
                                                             'offset' => '288',
                                                             'type' => '69'
                                                           }
                                                  },
                                        'Name' => 'struct sockaddr_storage',
                                        'Size' => '128',
                                        'Type' => 'Struct'
                                      },
                          '127993' => {
                                        'BaseType' => '96',
                                        'Name' => 'char[118]',
                                        'Size' => '118',
                                        'Type' => 'Array'
                                      },
                          '129' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '129782' => {
                                        'BaseType' => '127940',
                                        'Name' => 'struct sockaddr_storage*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '130304' => {
                                        'BaseType' => '96',
                                        'Header' => 'strnatcmp.h',
                                        'Line' => '24',
                                        'Name' => 'nat_char',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '130316' => {
                                        'BaseType' => '130304',
                                        'Name' => 'nat_char const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '130447' => {
                                        'BaseType' => '130316',
                                        'Name' => 'nat_char const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '131668' => {
                                        'BaseType' => '108',
                                        'Header' => 'types.h',
                                        'Line' => '44',
                                        'Name' => '__int64_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '131724' => {
                                        'BaseType' => '131668',
                                        'Header' => 'stdint-intn.h',
                                        'Line' => '27',
                                        'Name' => 'int64_t',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '132103' => {
                                        'BaseType' => '2708',
                                        'Name' => 'gchar const**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '132216' => {
                                        'BaseType' => '33538',
                                        'Name' => 'gchar**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '132398' => {
                                        'Header' => 'str_util.h',
                                        'Line' => '186',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_NONE',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_BYTES',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_BITS',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_BITS_S',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_BYTES_S',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_PACKETS',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'FORMAT_SIZE_UNIT_PACKETS_S',
                                                             'value' => '6'
                                                           }
                                                  },
                                        'Name' => 'enum format_size_units_e',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '13567' => {
                                       'BaseType' => '83',
                                       'Header' => 'glibconfig.h',
                                       'Line' => '53',
                                       'Name' => 'gint32',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '136' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '138959' => {
                                        'BaseType' => '129',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '42',
                                        'Name' => 'gint8',
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '138997' => {
                                        'BaseType' => '136',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '45',
                                        'Name' => 'gint16',
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '140455' => {
                                        'BaseType' => '58844',
                                        'Name' => 'guint16*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '141435' => {
                                        'BaseType' => '20369',
                                        'Name' => 'guint64*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '142335' => {
                                        'BaseType' => '138959',
                                        'Name' => 'gint8*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '142541' => {
                                        'BaseType' => '138997',
                                        'Name' => 'gint16*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '142747' => {
                                        'BaseType' => '13567',
                                        'Name' => 'gint32*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '143' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '143056' => {
                                        'BaseType' => '106213',
                                        'Name' => 'gint64*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '143413' => {
                                        'Header' => 'report_message.h',
                                        'Line' => '32',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'vreport_failure',
                                                             'offset' => '0',
                                                             'type' => '143584'
                                                           },
                                                    '1' => {
                                                             'name' => 'vreport_warning',
                                                             'offset' => '8',
                                                             'type' => '143584'
                                                           },
                                                    '2' => {
                                                             'name' => 'report_open_failure',
                                                             'offset' => '22',
                                                             'type' => '143611'
                                                           },
                                                    '3' => {
                                                             'name' => 'report_read_failure',
                                                             'offset' => '36',
                                                             'type' => '143633'
                                                           },
                                                    '4' => {
                                                             'name' => 'report_write_failure',
                                                             'offset' => '50',
                                                             'type' => '143633'
                                                           },
                                                    '5' => {
                                                             'name' => 'report_cfile_open_failure',
                                                             'offset' => '64',
                                                             'type' => '143660'
                                                           },
                                                    '6' => {
                                                             'name' => 'report_cfile_dump_open_failure',
                                                             'offset' => '72',
                                                             'type' => '143692'
                                                           },
                                                    '7' => {
                                                             'name' => 'report_cfile_read_failure',
                                                             'offset' => '86',
                                                             'type' => '143660'
                                                           },
                                                    '8' => {
                                                             'name' => 'report_cfile_write_failure',
                                                             'offset' => '100',
                                                             'type' => '143734'
                                                           },
                                                    '9' => {
                                                             'name' => 'report_cfile_close_failure',
                                                             'offset' => '114',
                                                             'type' => '143660'
                                                           }
                                                  },
                                        'Name' => 'struct report_message_routines',
                                        'Size' => '80',
                                        'Type' => 'Struct'
                                      },
                          '143557' => {
                                        'BaseType' => '143413',
                                        'Name' => 'struct report_message_routines const',
                                        'Size' => '80',
                                        'Type' => 'Const'
                                      },
                          '143584' => {
                                        'Name' => 'void(*)(char const*, struct __va_list_tag*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'type' => '36716'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '143611' => {
                                        'Name' => 'void(*)(char const*, int, gboolean)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'type' => '83'
                                                            },
                                                     '2' => {
                                                              'type' => '268'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '143633' => {
                                        'Name' => 'void(*)(char const*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'type' => '83'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '143660' => {
                                        'Name' => 'void(*)(char const*, int, gchar*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'type' => '83'
                                                            },
                                                     '2' => {
                                                              'type' => '33538'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '143692' => {
                                        'Name' => 'void(*)(char const*, int, gchar*, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'type' => '83'
                                                            },
                                                     '2' => {
                                                              'type' => '33538'
                                                            },
                                                     '3' => {
                                                              'type' => '83'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '143734' => {
                                        'Name' => 'void(*)(char const*, char const*, int, gchar*, guint32, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'type' => '90'
                                                            },
                                                     '2' => {
                                                              'type' => '83'
                                                            },
                                                     '3' => {
                                                              'type' => '33538'
                                                            },
                                                     '4' => {
                                                              'type' => '5976'
                                                            },
                                                     '5' => {
                                                              'type' => '83'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '143784' => {
                                        'BaseType' => '143557',
                                        'Name' => 'struct report_message_routines const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '148678' => {
                                        'BaseType' => '106711',
                                        'Name' => 'struct tm*restrict',
                                        'Size' => '8',
                                        'Type' => 'Restrict'
                                      },
                          '148711' => {
                                        'BaseType' => '74200',
                                        'Name' => 'struct timespec*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '149881' => {
                                        'BaseType' => '304',
                                        'Name' => 'double*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '150624' => {
                                        'BaseType' => '92907',
                                        'Name' => 'ws_in6_addr const',
                                        'Size' => '16',
                                        'Type' => 'Const'
                                      },
                          '151555' => {
                                        'BaseType' => '150624',
                                        'Name' => 'ws_in6_addr const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '158649' => {
                                        'BaseType' => '2591',
                                        'Name' => 'char*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '159279' => {
                                        'Header' => 'ws_getopt.h',
                                        'Line' => '42',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'name',
                                                             'offset' => '0',
                                                             'type' => '90'
                                                           },
                                                    '1' => {
                                                             'name' => 'has_arg',
                                                             'offset' => '8',
                                                             'type' => '83'
                                                           },
                                                    '2' => {
                                                             'name' => 'flag',
                                                             'offset' => '22',
                                                             'type' => '34083'
                                                           },
                                                    '3' => {
                                                             'name' => 'val',
                                                             'offset' => '36',
                                                             'type' => '83'
                                                           }
                                                  },
                                        'Name' => 'struct ws_option',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '159345' => {
                                        'BaseType' => '159279',
                                        'Name' => 'struct ws_option const',
                                        'Size' => '32',
                                        'Type' => 'Const'
                                      },
                          '159848' => {
                                        'BaseType' => '158649',
                                        'Name' => 'char*const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '159854' => {
                                        'BaseType' => '159345',
                                        'Name' => 'struct ws_option const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '16141' => {
                                       'BaseType' => '143',
                                       'Name' => 'void**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '162060' => {
                                        'BaseType' => '162072',
                                        'Header' => 'emmintrin.h',
                                        'Line' => '53',
                                        'Name' => '__m128i',
                                        'Size' => '16',
                                        'Type' => 'Typedef'
                                      },
                          '162072' => {
                                        'BaseType' => '115',
                                        'Name' => 'long long[2]',
                                        'Size' => '16',
                                        'Type' => 'Array'
                                      },
                          '162136' => {
                                        'BaseType' => '244',
                                        'Name' => 'gchar[256]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '162152' => {
                                        'Header' => 'ws_mempbrk.h',
                                        'Line' => '27',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'patt',
                                                             'offset' => '0',
                                                             'type' => '162136'
                                                           },
                                                    '1' => {
                                                             'name' => 'use_sse42',
                                                             'offset' => '598',
                                                             'type' => '268'
                                                           },
                                                    '2' => {
                                                             'name' => 'mask',
                                                             'offset' => '626',
                                                             'type' => '162060'
                                                           }
                                                  },
                                        'Name' => 'struct ws_mempbrk_pattern',
                                        'Size' => '288',
                                        'Type' => 'Struct'
                                      },
                          '162164' => {
                                        'BaseType' => '162152',
                                        'Name' => 'ws_mempbrk_pattern const',
                                        'Size' => '288',
                                        'Type' => 'Const'
                                      },
                          '162206' => {
                                        'BaseType' => '162164',
                                        'Name' => 'ws_mempbrk_pattern const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '162241' => {
                                        'BaseType' => '162152',
                                        'Name' => 'ws_mempbrk_pattern*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '163069' => {
                                        'BaseType' => '83',
                                        'Header' => 'glibconfig.h',
                                        'Line' => '199',
                                        'Name' => 'GPid',
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '163349' => {
                                        'BaseType' => '163361',
                                        'Header' => 'gconvert.h',
                                        'Line' => '83',
                                        'Name' => 'GIConv',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '163361' => {
                                        'BaseType' => '163367',
                                        'Name' => 'struct _GIConv*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '163367' => {
                                        'Name' => 'struct _GIConv',
                                        'Type' => 'Struct'
                                      },
                          '163372' => {
                                        'Name' => 'gboolean(*)(gpointer)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2696'
                                                            }
                                                   },
                                        'Return' => '268',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '163502' => {
                                        'Header' => 'gmain.h',
                                        'Line' => '39',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'G_IO_IN',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'G_IO_OUT',
                                                             'value' => '4'
                                                           },
                                                    '2' => {
                                                             'name' => 'G_IO_PRI',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'G_IO_ERR',
                                                             'value' => '8'
                                                           },
                                                    '4' => {
                                                             'name' => 'G_IO_HUP',
                                                             'value' => '16'
                                                           },
                                                    '5' => {
                                                             'name' => 'G_IO_NVAL',
                                                             'value' => '32'
                                                           }
                                                  },
                                        'Name' => 'enum GIOCondition',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '163514' => {
                                        'BaseType' => '163526',
                                        'Header' => 'gmain.h',
                                        'Line' => '68',
                                        'Name' => 'GMainContext',
                                        'Type' => 'Typedef'
                                      },
                          '163526' => {
                                        'Name' => 'struct _GMainContext',
                                        'Type' => 'Struct'
                                      },
                          '163531' => {
                                        'BaseType' => '163543',
                                        'Header' => 'gmain.h',
                                        'Line' => '84',
                                        'Name' => 'GSource',
                                        'Size' => '96',
                                        'Type' => 'Typedef'
                                      },
                          '163543' => {
                                        'Header' => 'gmain.h',
                                        'Line' => '245',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'callback_data',
                                                             'offset' => '0',
                                                             'type' => '2696'
                                                           },
                                                    '1' => {
                                                             'name' => 'callback_funcs',
                                                             'offset' => '8',
                                                             'type' => '163971'
                                                           },
                                                    '10' => {
                                                              'name' => 'next',
                                                              'offset' => '114',
                                                              'type' => '163965'
                                                            },
                                                    '11' => {
                                                              'name' => 'name',
                                                              'offset' => '128',
                                                              'type' => '2591'
                                                            },
                                                    '12' => {
                                                              'name' => 'priv',
                                                              'offset' => '136',
                                                              'type' => '163989'
                                                            },
                                                    '2' => {
                                                             'name' => 'source_funcs',
                                                             'offset' => '22',
                                                             'type' => '163977'
                                                           },
                                                    '3' => {
                                                             'name' => 'ref_count',
                                                             'offset' => '36',
                                                             'type' => '280'
                                                           },
                                                    '4' => {
                                                             'name' => 'context',
                                                             'offset' => '50',
                                                             'type' => '163983'
                                                           },
                                                    '5' => {
                                                             'name' => 'priority',
                                                             'offset' => '64',
                                                             'type' => '256'
                                                           },
                                                    '6' => {
                                                             'name' => 'flags',
                                                             'offset' => '68',
                                                             'type' => '280'
                                                           },
                                                    '7' => {
                                                             'name' => 'source_id',
                                                             'offset' => '72',
                                                             'type' => '280'
                                                           },
                                                    '8' => {
                                                             'name' => 'poll_fds',
                                                             'offset' => '86',
                                                             'type' => '56030'
                                                           },
                                                    '9' => {
                                                             'name' => 'prev',
                                                             'offset' => '100',
                                                             'type' => '163965'
                                                           }
                                                  },
                                        'Name' => 'struct _GSource',
                                        'Size' => '96',
                                        'Type' => 'Struct'
                                      },
                          '163734' => {
                                        'BaseType' => '163746',
                                        'Header' => 'gmain.h',
                                        'Line' => '85',
                                        'Name' => 'GSourcePrivate',
                                        'Type' => 'Typedef'
                                      },
                          '163746' => {
                                        'Name' => 'struct _GSourcePrivate',
                                        'Type' => 'Struct'
                                      },
                          '163751' => {
                                        'BaseType' => '163763',
                                        'Header' => 'gmain.h',
                                        'Line' => '97',
                                        'Name' => 'GSourceCallbackFuncs',
                                        'Size' => '24',
                                        'Type' => 'Typedef'
                                      },
                          '163763' => {
                                        'Header' => 'gmain.h',
                                        'Line' => '270',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ref',
                                                             'offset' => '0',
                                                             'type' => '53373'
                                                           },
                                                    '1' => {
                                                             'name' => 'unref',
                                                             'offset' => '8',
                                                             'type' => '53373'
                                                           },
                                                    '2' => {
                                                             'name' => 'get',
                                                             'offset' => '22',
                                                             'type' => '164027'
                                                           }
                                                  },
                                        'Name' => 'struct _GSourceCallbackFuncs',
                                        'Size' => '24',
                                        'Type' => 'Struct'
                                      },
                          '163820' => {
                                        'BaseType' => '163837',
                                        'Header' => 'gmain.h',
                                        'Line' => '153',
                                        'Name' => 'GSourceFuncs',
                                        'Size' => '48',
                                        'Type' => 'Typedef'
                                      },
                          '163832' => {
                                        'BaseType' => '163820',
                                        'Name' => 'GSourceFuncs const',
                                        'Size' => '48',
                                        'Type' => 'Const'
                                      },
                          '163837' => {
                                        'Header' => 'gmain.h',
                                        'Line' => '288',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'prepare',
                                                             'offset' => '0',
                                                             'type' => '164072'
                                                           },
                                                    '1' => {
                                                             'name' => 'check',
                                                             'offset' => '8',
                                                             'type' => '164093'
                                                           },
                                                    '2' => {
                                                             'name' => 'dispatch',
                                                             'offset' => '22',
                                                             'type' => '164124'
                                                           },
                                                    '3' => {
                                                             'name' => 'finalize',
                                                             'offset' => '36',
                                                             'type' => '163948'
                                                           },
                                                    '4' => {
                                                             'name' => 'closure_callback',
                                                             'offset' => '50',
                                                             'type' => '163936'
                                                           },
                                                    '5' => {
                                                             'name' => 'closure_marshal',
                                                             'offset' => '64',
                                                             'type' => '164033'
                                                           }
                                                  },
                                        'Name' => 'struct _GSourceFuncs',
                                        'Size' => '48',
                                        'Type' => 'Struct'
                                      },
                          '163936' => {
                                        'BaseType' => '163372',
                                        'Header' => 'gmain.h',
                                        'Line' => '193',
                                        'Name' => 'GSourceFunc',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '163948' => {
                                        'Name' => 'void(*)(GSource*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '163965'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '163965' => {
                                        'BaseType' => '163531',
                                        'Name' => 'GSource*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '163971' => {
                                        'BaseType' => '163751',
                                        'Name' => 'GSourceCallbackFuncs*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '163977' => {
                                        'BaseType' => '163832',
                                        'Name' => 'GSourceFuncs const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '163983' => {
                                        'BaseType' => '163514',
                                        'Name' => 'GMainContext*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '163989' => {
                                        'BaseType' => '163734',
                                        'Name' => 'GSourcePrivate*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '164021' => {
                                        'BaseType' => '163936',
                                        'Name' => 'GSourceFunc*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '164027' => {
                                        'Name' => 'void(*)(gpointer, GSource*, GSourceFunc*, gpointer*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '2696'
                                                            },
                                                     '1' => {
                                                              'type' => '163965'
                                                            },
                                                     '2' => {
                                                              'type' => '164021'
                                                            },
                                                     '3' => {
                                                              'type' => '53448'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '164033' => {
                                        'BaseType' => '55947',
                                        'Header' => 'gmain.h',
                                        'Line' => '286',
                                        'Name' => 'GSourceDummyMarshal',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '164072' => {
                                        'Name' => 'gboolean(*)(GSource*, gint*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '163965'
                                                            },
                                                     '1' => {
                                                              'type' => '99041'
                                                            }
                                                   },
                                        'Return' => '268',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '164093' => {
                                        'Name' => 'gboolean(*)(GSource*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '163965'
                                                            }
                                                   },
                                        'Return' => '268',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '164124' => {
                                        'Name' => 'gboolean(*)(GSource*, GSourceFunc, gpointer)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '163965'
                                                            },
                                                     '1' => {
                                                              'type' => '163936'
                                                            },
                                                     '2' => {
                                                              'type' => '2696'
                                                            }
                                                   },
                                        'Return' => '268',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '164195' => {
                                        'BaseType' => '164207',
                                        'Header' => 'giochannel.h',
                                        'Line' => '41',
                                        'Name' => 'GIOChannel',
                                        'Size' => '112',
                                        'Type' => 'Typedef'
                                      },
                          '164207' => {
                                        'Header' => 'giochannel.h',
                                        'Line' => '97',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'ref_count',
                                                             'offset' => '0',
                                                             'type' => '256'
                                                           },
                                                    '1' => {
                                                             'name' => 'funcs',
                                                             'offset' => '8',
                                                             'type' => '164806'
                                                           },
                                                    '10' => {
                                                              'name' => 'write_buf',
                                                              'offset' => '128',
                                                              'type' => '72801'
                                                            },
                                                    '11' => {
                                                              'name' => 'partial_write_buf',
                                                              'offset' => '136',
                                                              'type' => '33678'
                                                            },
                                                    '12' => {
                                                              'bitfield' => '1',
                                                              'name' => 'use_buffer',
                                                              'offset' => '146',
                                                              'type' => '280'
                                                            },
                                                    '13' => {
                                                              'bitfield' => '1',
                                                              'name' => 'do_encode',
                                                              'offset' => '146',
                                                              'type' => '280'
                                                            },
                                                    '14' => {
                                                              'bitfield' => '1',
                                                              'name' => 'close_on_unref',
                                                              'offset' => '146',
                                                              'type' => '280'
                                                            },
                                                    '15' => {
                                                              'bitfield' => '1',
                                                              'name' => 'is_readable',
                                                              'offset' => '146',
                                                              'type' => '280'
                                                            },
                                                    '16' => {
                                                              'bitfield' => '1',
                                                              'name' => 'is_writeable',
                                                              'offset' => '146',
                                                              'type' => '280'
                                                            },
                                                    '17' => {
                                                              'bitfield' => '1',
                                                              'name' => 'is_seekable',
                                                              'offset' => '146',
                                                              'type' => '280'
                                                            },
                                                    '18' => {
                                                              'name' => 'reserved1',
                                                              'offset' => '150',
                                                              'type' => '2696'
                                                            },
                                                    '19' => {
                                                              'name' => 'reserved2',
                                                              'offset' => '260',
                                                              'type' => '2696'
                                                            },
                                                    '2' => {
                                                             'name' => 'encoding',
                                                             'offset' => '22',
                                                             'type' => '33538'
                                                           },
                                                    '3' => {
                                                             'name' => 'read_cd',
                                                             'offset' => '36',
                                                             'type' => '163349'
                                                           },
                                                    '4' => {
                                                             'name' => 'write_cd',
                                                             'offset' => '50',
                                                             'type' => '163349'
                                                           },
                                                    '5' => {
                                                             'name' => 'line_term',
                                                             'offset' => '64',
                                                             'type' => '33538'
                                                           },
                                                    '6' => {
                                                             'name' => 'line_term_len',
                                                             'offset' => '72',
                                                             'type' => '280'
                                                           },
                                                    '7' => {
                                                             'name' => 'buf_size',
                                                             'offset' => '86',
                                                             'type' => '227'
                                                           },
                                                    '8' => {
                                                             'name' => 'read_buf',
                                                             'offset' => '100',
                                                             'type' => '72801'
                                                           },
                                                    '9' => {
                                                             'name' => 'encoded_read_buf',
                                                             'offset' => '114',
                                                             'type' => '72801'
                                                           }
                                                  },
                                        'Name' => 'struct _GIOChannel',
                                        'Size' => '112',
                                        'Type' => 'Struct'
                                      },
                          '164499' => {
                                        'BaseType' => '164511',
                                        'Header' => 'giochannel.h',
                                        'Line' => '42',
                                        'Name' => 'GIOFuncs',
                                        'Size' => '64',
                                        'Type' => 'Typedef'
                                      },
                          '164511' => {
                                        'Header' => 'giochannel.h',
                                        'Line' => '131',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'io_read',
                                                             'offset' => '0',
                                                             'type' => '164887'
                                                           },
                                                    '1' => {
                                                             'name' => 'io_write',
                                                             'offset' => '8',
                                                             'type' => '164928'
                                                           },
                                                    '2' => {
                                                             'name' => 'io_seek',
                                                             'offset' => '22',
                                                             'type' => '164964'
                                                           },
                                                    '3' => {
                                                             'name' => 'io_close',
                                                             'offset' => '36',
                                                             'type' => '164990'
                                                           },
                                                    '4' => {
                                                             'name' => 'io_create_watch',
                                                             'offset' => '50',
                                                             'type' => '165016'
                                                           },
                                                    '5' => {
                                                             'name' => 'io_free',
                                                             'offset' => '64',
                                                             'type' => '165033'
                                                           },
                                                    '6' => {
                                                             'name' => 'io_set_flags',
                                                             'offset' => '72',
                                                             'type' => '165064'
                                                           },
                                                    '7' => {
                                                             'name' => 'io_get_flags',
                                                             'offset' => '86',
                                                             'type' => '165085'
                                                           }
                                                  },
                                        'Name' => 'struct _GIOFuncs',
                                        'Size' => '64',
                                        'Type' => 'Struct'
                                      },
                          '164668' => {
                                        'Header' => 'giochannel.h',
                                        'Line' => '75',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'G_IO_STATUS_ERROR',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'G_IO_STATUS_NORMAL',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'G_IO_STATUS_EOF',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'G_IO_STATUS_AGAIN',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum GIOStatus',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '164713' => {
                                        'Header' => 'giochannel.h',
                                        'Line' => '82',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'G_SEEK_CUR',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'G_SEEK_SET',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'G_SEEK_END',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum GSeekType',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '164794' => {
                                        'Header' => 'giochannel.h',
                                        'Line' => '95',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'G_IO_FLAG_APPEND',
                                                             'value' => '1'
                                                           },
                                                    '1' => {
                                                             'name' => 'G_IO_FLAG_NONBLOCK',
                                                             'value' => '2'
                                                           },
                                                    '2' => {
                                                             'name' => 'G_IO_FLAG_IS_READABLE',
                                                             'value' => '4'
                                                           },
                                                    '3' => {
                                                             'name' => 'G_IO_FLAG_IS_WRITABLE',
                                                             'value' => '8'
                                                           },
                                                    '4' => {
                                                             'name' => 'G_IO_FLAG_IS_WRITEABLE',
                                                             'value' => '8'
                                                           },
                                                    '5' => {
                                                             'name' => 'G_IO_FLAG_IS_SEEKABLE',
                                                             'value' => '16'
                                                           },
                                                    '6' => {
                                                             'name' => 'G_IO_FLAG_MASK',
                                                             'value' => '31'
                                                           },
                                                    '7' => {
                                                             'name' => 'G_IO_FLAG_GET_MASK',
                                                             'value' => '31'
                                                           },
                                                    '8' => {
                                                             'name' => 'G_IO_FLAG_SET_MASK',
                                                             'value' => '3'
                                                           }
                                                  },
                                        'Name' => 'enum GIOFlags',
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '164806' => {
                                        'BaseType' => '164499',
                                        'Name' => 'GIOFuncs*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '164834' => {
                                        'BaseType' => '164195',
                                        'Name' => 'GIOChannel*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '164875' => {
                                        'BaseType' => '227',
                                        'Name' => 'gsize*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '164887' => {
                                        'Name' => 'GIOStatus(*)(GIOChannel*, gchar*, gsize, gsize*, GError**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '164834'
                                                            },
                                                     '1' => {
                                                              'type' => '33538'
                                                            },
                                                     '2' => {
                                                              'type' => '227'
                                                            },
                                                     '3' => {
                                                              'type' => '164875'
                                                            },
                                                     '4' => {
                                                              'type' => '74713'
                                                            }
                                                   },
                                        'Return' => '164668',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '164928' => {
                                        'Name' => 'GIOStatus(*)(GIOChannel*, gchar const*, gsize, gsize*, GError**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '164834'
                                                            },
                                                     '1' => {
                                                              'type' => '2708'
                                                            },
                                                     '2' => {
                                                              'type' => '227'
                                                            },
                                                     '3' => {
                                                              'type' => '164875'
                                                            },
                                                     '4' => {
                                                              'type' => '74713'
                                                            }
                                                   },
                                        'Return' => '164668',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '164964' => {
                                        'Name' => 'GIOStatus(*)(GIOChannel*, gint64, GSeekType, GError**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '164834'
                                                            },
                                                     '1' => {
                                                              'type' => '106213'
                                                            },
                                                     '2' => {
                                                              'type' => '164713'
                                                            },
                                                     '3' => {
                                                              'type' => '74713'
                                                            }
                                                   },
                                        'Return' => '164668',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '164990' => {
                                        'Name' => 'GIOStatus(*)(GIOChannel*, GError**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '164834'
                                                            },
                                                     '1' => {
                                                              'type' => '74713'
                                                            }
                                                   },
                                        'Return' => '164668',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '165016' => {
                                        'Name' => 'GSource*(*)(GIOChannel*, GIOCondition)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '164834'
                                                            },
                                                     '1' => {
                                                              'type' => '163502'
                                                            }
                                                   },
                                        'Return' => '163965',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '165033' => {
                                        'Name' => 'void(*)(GIOChannel*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '164834'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '165064' => {
                                        'Name' => 'GIOStatus(*)(GIOChannel*, GIOFlags, GError**)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '164834'
                                                            },
                                                     '1' => {
                                                              'type' => '164794'
                                                            },
                                                     '2' => {
                                                              'type' => '74713'
                                                            }
                                                   },
                                        'Return' => '164668',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '165085' => {
                                        'Name' => 'GIOFlags(*)(GIOChannel*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '164834'
                                                            }
                                                   },
                                        'Return' => '164794',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '165310' => {
                                        'Header' => 'ws_pipe.h',
                                        'Line' => '30',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'pid',
                                                             'offset' => '0',
                                                             'type' => '163069'
                                                           },
                                                    '1' => {
                                                             'name' => 'stdin_io',
                                                             'offset' => '8',
                                                             'type' => '164834'
                                                           },
                                                    '2' => {
                                                             'name' => 'stdout_io',
                                                             'offset' => '22',
                                                             'type' => '164834'
                                                           },
                                                    '3' => {
                                                             'name' => 'stderr_io',
                                                             'offset' => '36',
                                                             'type' => '164834'
                                                           }
                                                  },
                                        'Name' => 'struct _ws_pipe_t',
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '165376' => {
                                        'BaseType' => '165310',
                                        'Header' => 'ws_pipe.h',
                                        'Line' => '35',
                                        'Name' => 'ws_pipe_t',
                                        'Size' => '32',
                                        'Type' => 'Typedef'
                                      },
                          '167476' => {
                                        'BaseType' => '165376',
                                        'Name' => 'ws_pipe_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '170' => {
                                     'Name' => 'int(*)(void const*, void const*)',
                                     'Param' => {
                                                  '0' => {
                                                           'type' => '196'
                                                         },
                                                  '1' => {
                                                           'type' => '196'
                                                         }
                                                },
                                     'Return' => '83',
                                     'Size' => '8',
                                     'Type' => 'FuncPtr'
                                   },
                          '180498' => {
                                        'BaseType' => '98888',
                                        'Name' => 'gdouble*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '182852' => {
                                        'BaseType' => '95564',
                                        'Name' => 'uint8_t const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '184146' => {
                                        'BaseType' => '184158',
                                        'Header' => 'wslog.h',
                                        'Line' => '50',
                                        'Name' => 'ws_log_writer_cb',
                                        'Type' => 'Typedef'
                                      },
                          '184158' => {
                                        'Name' => 'void(char const*, enum ws_log_level, struct timespec, char const*, long, char const*, char const*, struct __va_list_tag*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'type' => '53058'
                                                            },
                                                     '2' => {
                                                              'type' => '74200'
                                                            },
                                                     '3' => {
                                                              'type' => '90'
                                                            },
                                                     '4' => {
                                                              'type' => '108'
                                                            },
                                                     '5' => {
                                                              'type' => '90'
                                                            },
                                                     '6' => {
                                                              'type' => '90'
                                                            },
                                                     '7' => {
                                                              'type' => '36716'
                                                            },
                                                     '8' => {
                                                              'type' => '143'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Type' => 'Func'
                                      },
                          '184215' => {
                                        'BaseType' => '2795',
                                        'Header' => 'wslog.h',
                                        'Line' => '58',
                                        'Name' => 'ws_log_writer_free_data_cb',
                                        'Type' => 'Typedef'
                                      },
                          '184534' => {
                                        'BaseType' => '184146',
                                        'Name' => 'ws_log_writer_cb*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '184584' => {
                                        'BaseType' => '184215',
                                        'Name' => 'ws_log_writer_free_data_cb*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '187946' => {
                                        'BaseType' => '182852',
                                        'Name' => 'uint8_t const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '196' => {
                                     'BaseType' => '207',
                                     'Name' => 'void const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '198277' => {
                                        'BaseType' => '29602',
                                        'Name' => 'guint32 const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '199895' => {
                                        'BaseType' => '199907',
                                        'Header' => 'plugins.h',
                                        'Line' => '33',
                                        'Name' => 'plugin_description_callback',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '199907' => {
                                        'Name' => 'void(*)(char const*, char const*, char const*, char const*, void*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '90'
                                                            },
                                                     '1' => {
                                                              'type' => '90'
                                                            },
                                                     '2' => {
                                                              'type' => '90'
                                                            },
                                                     '3' => {
                                                              'type' => '90'
                                                            },
                                                     '4' => {
                                                              'type' => '143'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '20350' => {
                                       'BaseType' => '90',
                                       'Name' => 'char const*restrict',
                                       'Size' => '8',
                                       'Type' => 'Restrict'
                                     },
                          '20369' => {
                                       'BaseType' => '69',
                                       'Header' => 'glibconfig.h',
                                       'Line' => '64',
                                       'Name' => 'guint64',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '20381' => {
                                       'BaseType' => '20369',
                                       'Name' => 'guint64 const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '20505' => {
                                       'BaseType' => '20517',
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_tree_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '20517' => {
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '48',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'metadata_allocator',
                                                            'offset' => '0',
                                                            'type' => '438'
                                                          },
                                                   '1' => {
                                                            'name' => 'data_allocator',
                                                            'offset' => '8',
                                                            'type' => '438'
                                                          },
                                                   '2' => {
                                                            'name' => 'root',
                                                            'offset' => '22',
                                                            'type' => '20823'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata_scope_cb_id',
                                                            'offset' => '36',
                                                            'type' => '280'
                                                          },
                                                   '4' => {
                                                            'name' => 'data_scope_cb_id',
                                                            'offset' => '40',
                                                            'type' => '280'
                                                          },
                                                   '5' => {
                                                            'name' => 'post_rotation_cb',
                                                            'offset' => '50',
                                                            'type' => '20840'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_tree_t',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '20609' => {
                                       'BaseType' => '20621',
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '217',
                                       'Name' => 'wmem_printer_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '20621' => {
                                       'Name' => 'void(*)(void const*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '196'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '20638' => {
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '22',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'WMEM_NODE_COLOR_RED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'WMEM_NODE_COLOR_BLACK',
                                                            'value' => '1'
                                                          }
                                                 },
                                       'Name' => 'enum _wmem_node_color_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '20669' => {
                                       'BaseType' => '20638',
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '25',
                                       'Name' => 'wmem_node_color_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '20681' => {
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '28',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'parent',
                                                            'offset' => '0',
                                                            'type' => '20799'
                                                          },
                                                   '1' => {
                                                            'name' => 'left',
                                                            'offset' => '8',
                                                            'type' => '20799'
                                                          },
                                                   '2' => {
                                                            'name' => 'right',
                                                            'offset' => '22',
                                                            'type' => '20799'
                                                          },
                                                   '3' => {
                                                            'name' => 'key',
                                                            'offset' => '36',
                                                            'type' => '196'
                                                          },
                                                   '4' => {
                                                            'name' => 'data',
                                                            'offset' => '50',
                                                            'type' => '143'
                                                          },
                                                   '5' => {
                                                            'name' => 'color',
                                                            'offset' => '64',
                                                            'type' => '20669'
                                                          },
                                                   '6' => {
                                                            'name' => 'is_subtree',
                                                            'offset' => '68',
                                                            'type' => '268'
                                                          },
                                                   '7' => {
                                                            'name' => 'is_removed',
                                                            'offset' => '72',
                                                            'type' => '268'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_tree_node_t',
                                       'Size' => '56',
                                       'Type' => 'Struct'
                                     },
                          '207' => {
                                     'BaseType' => '1',
                                     'Name' => 'void const',
                                     'Type' => 'Const'
                                   },
                          '20799' => {
                                       'BaseType' => '20681',
                                       'Name' => 'struct _wmem_tree_node_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20805' => {
                                       'BaseType' => '20681',
                                       'Header' => 'wmem_tree-int.h',
                                       'Line' => '43',
                                       'Name' => 'wmem_tree_node_t',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '20823' => {
                                       'BaseType' => '20805',
                                       'Name' => 'wmem_tree_node_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20840' => {
                                       'Name' => 'void(*)(wmem_tree_node_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '20823'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '20928' => {
                                       'BaseType' => '20940',
                                       'Header' => 'wmem_list.h',
                                       'Line' => '36',
                                       'Name' => 'wmem_list_t',
                                       'Type' => 'Typedef'
                                     },
                          '20940' => {
                                       'Line' => '23',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'count',
                                                            'offset' => '0',
                                                            'type' => '280'
                                                          },
                                                   '1' => {
                                                            'name' => 'head',
                                                            'offset' => '8',
                                                            'type' => '23240'
                                                          },
                                                   '2' => {
                                                            'name' => 'tail',
                                                            'offset' => '22',
                                                            'type' => '23240'
                                                          },
                                                   '3' => {
                                                            'name' => 'allocator',
                                                            'offset' => '36',
                                                            'type' => '438'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_list_t',
                                       'Size' => '32',
                                       'Source' => 'wmem_list.c',
                                       'Type' => 'Struct'
                                     },
                          '20945' => {
                                       'BaseType' => '20517',
                                       'Header' => 'wmem_interval_tree.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_itree_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '21013' => {
                                       'BaseType' => '20505',
                                       'Name' => 'wmem_tree_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '21042' => {
                                       'BaseType' => '20928',
                                       'Name' => 'wmem_list_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '215' => {
                                     'BaseType' => '122',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '43',
                                     'Name' => 'guint8',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '21502' => {
                                       'BaseType' => '20945',
                                       'Name' => 'wmem_itree_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '227' => {
                                     'BaseType' => '69',
                                     'Header' => 'glibconfig.h',
                                     'Line' => '80',
                                     'Name' => 'gsize',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '22966' => {
                                       'BaseType' => '196',
                                       'Header' => 'gtypes.h',
                                       'Line' => '104',
                                       'Name' => 'gconstpointer',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22985' => {
                                       'BaseType' => '22997',
                                       'Header' => 'gtypes.h',
                                       'Line' => '106',
                                       'Name' => 'GCompareFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '22997' => {
                                       'Name' => 'gint(*)(gconstpointer, gconstpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '22966'
                                                           },
                                                    '1' => {
                                                             'type' => '22966'
                                                           }
                                                  },
                                       'Return' => '256',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '23023' => {
                                       'BaseType' => '23035',
                                       'Header' => 'gtypes.h',
                                       'Line' => '114',
                                       'Name' => 'GFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '23035' => {
                                       'Name' => 'void(*)(gpointer, gpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2696'
                                                           },
                                                    '1' => {
                                                             'type' => '2696'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '23093' => {
                                       'BaseType' => '20928',
                                       'Name' => 'wmem_list_t const',
                                       'Size' => '32',
                                       'Type' => 'Const'
                                     },
                          '23164' => {
                                       'BaseType' => '23181',
                                       'Header' => 'wmem_list.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_list_frame_t',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '23176' => {
                                       'BaseType' => '23164',
                                       'Name' => 'wmem_list_frame_t const',
                                       'Size' => '24',
                                       'Type' => 'Const'
                                     },
                          '23181' => {
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'next',
                                                            'offset' => '0',
                                                            'type' => '23234'
                                                          },
                                                   '1' => {
                                                            'name' => 'prev',
                                                            'offset' => '8',
                                                            'type' => '23234'
                                                          },
                                                   '2' => {
                                                            'name' => 'data',
                                                            'offset' => '22',
                                                            'type' => '143'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_list_frame_t',
                                       'Size' => '24',
                                       'Source' => 'wmem_list.c',
                                       'Type' => 'Struct'
                                     },
                          '23234' => {
                                       'BaseType' => '23181',
                                       'Name' => 'struct _wmem_list_frame_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '23240' => {
                                       'BaseType' => '23164',
                                       'Name' => 'wmem_list_frame_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '239' => {
                                     'BaseType' => '227',
                                     'Name' => 'gsize const',
                                     'Size' => '8',
                                     'Type' => 'Const'
                                   },
                          '244' => {
                                     'BaseType' => '96',
                                     'Header' => 'gtypes.h',
                                     'Line' => '46',
                                     'Name' => 'gchar',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '24544' => {
                                       'BaseType' => '23176',
                                       'Name' => 'wmem_list_frame_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '24697' => {
                                       'BaseType' => '23093',
                                       'Name' => 'wmem_list_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '24921' => {
                                       'BaseType' => '215',
                                       'Name' => 'guint8 const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '25072' => {
                                       'BaseType' => '25084',
                                       'Header' => 'gtypes.h',
                                       'Line' => '111',
                                       'Name' => 'GEqualFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '25084' => {
                                       'Name' => 'gboolean(*)(gconstpointer, gconstpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '22966'
                                                           },
                                                    '1' => {
                                                             'type' => '22966'
                                                           }
                                                  },
                                       'Return' => '268',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '25110' => {
                                       'BaseType' => '25122',
                                       'Header' => 'gtypes.h',
                                       'Line' => '116',
                                       'Name' => 'GHashFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '25122' => {
                                       'Name' => 'guint(*)(gconstpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '22966'
                                                           }
                                                  },
                                       'Return' => '280',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '25143' => {
                                       'BaseType' => '25155',
                                       'Header' => 'gtypes.h',
                                       'Line' => '117',
                                       'Name' => 'GHFunc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '25155' => {
                                       'Name' => 'void(*)(gpointer, gpointer, gpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2696'
                                                           },
                                                    '1' => {
                                                             'type' => '2696'
                                                           },
                                                    '2' => {
                                                             'type' => '2696'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '25223' => {
                                       'BaseType' => '25235',
                                       'Header' => 'wmem_map.h',
                                       'Line' => '37',
                                       'Name' => 'wmem_map_t',
                                       'Size' => '64',
                                       'Type' => 'Typedef'
                                     },
                          '25235' => {
                                       'Line' => '44',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'count',
                                                            'offset' => '0',
                                                            'type' => '280'
                                                          },
                                                   '1' => {
                                                            'name' => 'capacity',
                                                            'offset' => '8',
                                                            'type' => '52'
                                                          },
                                                   '2' => {
                                                            'name' => 'table',
                                                            'offset' => '22',
                                                            'type' => '25593'
                                                          },
                                                   '3' => {
                                                            'name' => 'hash_func',
                                                            'offset' => '36',
                                                            'type' => '25110'
                                                          },
                                                   '4' => {
                                                            'name' => 'eql_func',
                                                            'offset' => '50',
                                                            'type' => '25072'
                                                          },
                                                   '5' => {
                                                            'name' => 'metadata_scope_cb_id',
                                                            'offset' => '64',
                                                            'type' => '280'
                                                          },
                                                   '6' => {
                                                            'name' => 'data_scope_cb_id',
                                                            'offset' => '68',
                                                            'type' => '280'
                                                          },
                                                   '7' => {
                                                            'name' => 'metadata_allocator',
                                                            'offset' => '72',
                                                            'type' => '438'
                                                          },
                                                   '8' => {
                                                            'name' => 'data_allocator',
                                                            'offset' => '86',
                                                            'type' => '438'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_map_t',
                                       'Size' => '64',
                                       'Source' => 'wmem_map.c',
                                       'Type' => 'Struct'
                                     },
                          '25409' => {
                                       'BaseType' => '25421',
                                       'Header' => 'wmem_user_cb.h',
                                       'Line' => '44',
                                       'Name' => 'wmem_user_cb_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '25421' => {
                                       'Name' => 'gboolean(*)(wmem_allocator_t*, wmem_cb_event_t, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '438'
                                                           },
                                                    '1' => {
                                                             'type' => '3058'
                                                           },
                                                    '2' => {
                                                             'type' => '143'
                                                           }
                                                  },
                                       'Return' => '268',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '25522' => {
                                       'Line' => '38',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'key',
                                                            'offset' => '0',
                                                            'type' => '196'
                                                          },
                                                   '1' => {
                                                            'name' => 'value',
                                                            'offset' => '8',
                                                            'type' => '143'
                                                          },
                                                   '2' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '25575'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_map_item_t',
                                       'Size' => '24',
                                       'Source' => 'wmem_map.c',
                                       'Type' => 'Struct'
                                     },
                          '25575' => {
                                       'BaseType' => '25522',
                                       'Name' => 'struct _wmem_map_item_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '25581' => {
                                       'BaseType' => '25522',
                                       'Line' => '42',
                                       'Name' => 'wmem_map_item_t',
                                       'Size' => '24',
                                       'Source' => 'wmem_map.c',
                                       'Type' => 'Typedef'
                                     },
                          '25593' => {
                                       'BaseType' => '25599',
                                       'Name' => 'wmem_map_item_t**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '25599' => {
                                       'BaseType' => '25581',
                                       'Name' => 'wmem_map_item_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '256' => {
                                     'BaseType' => '83',
                                     'Header' => 'gtypes.h',
                                     'Line' => '49',
                                     'Name' => 'gint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2591' => {
                                      'BaseType' => '96',
                                      'Name' => 'char*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '26210' => {
                                       'BaseType' => '24921',
                                       'Name' => 'guint8 const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '26272' => {
                                       'BaseType' => '25223',
                                       'Name' => 'wmem_map_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2653' => {
                                      'BaseType' => '244',
                                      'Name' => 'gchar const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '268' => {
                                     'BaseType' => '256',
                                     'Header' => 'gtypes.h',
                                     'Line' => '50',
                                     'Name' => 'gboolean',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2696' => {
                                      'BaseType' => '143',
                                      'Header' => 'gtypes.h',
                                      'Line' => '103',
                                      'Name' => 'gpointer',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2708' => {
                                      'BaseType' => '2653',
                                      'Name' => 'gchar const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '27161' => {
                                       'BaseType' => '196',
                                       'Name' => 'void const**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2795' => {
                                      'Name' => 'void(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Type' => 'Func'
                                    },
                          '280' => {
                                     'BaseType' => '45',
                                     'Header' => 'gtypes.h',
                                     'Line' => '55',
                                     'Name' => 'guint',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2806' => {
                                      'Name' => 'void(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '292' => {
                                     'BaseType' => '280',
                                     'Name' => 'guint const',
                                     'Size' => '4',
                                     'Type' => 'Const'
                                   },
                          '29602' => {
                                       'BaseType' => '5976',
                                       'Name' => 'guint32 const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '2967' => {
                                      'Header' => 'wmem_core.h',
                                      'Line' => '44',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WMEM_ALLOCATOR_SIMPLE',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WMEM_ALLOCATOR_BLOCK',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'WMEM_ALLOCATOR_STRICT',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'WMEM_ALLOCATOR_BLOCK_FAST',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum _wmem_allocator_type_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '29865' => {
                                       'BaseType' => '29877',
                                       'Header' => 'wmem_multimap.h',
                                       'Line' => '49',
                                       'Name' => 'wmem_multimap_t',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '29877' => {
                                       'Line' => '23',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'map',
                                                            'offset' => '0',
                                                            'type' => '26272'
                                                          },
                                                   '1' => {
                                                            'name' => 'metadata_scope_cb_id',
                                                            'offset' => '8',
                                                            'type' => '280'
                                                          },
                                                   '2' => {
                                                            'name' => 'data_scope_cb_id',
                                                            'offset' => '18',
                                                            'type' => '280'
                                                          },
                                                   '3' => {
                                                            'name' => 'metadata_allocator',
                                                            'offset' => '22',
                                                            'type' => '438'
                                                          },
                                                   '4' => {
                                                            'name' => 'data_allocator',
                                                            'offset' => '36',
                                                            'type' => '438'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_multimap_t',
                                       'Size' => '32',
                                       'Source' => 'wmem_multimap.c',
                                       'Type' => 'Struct'
                                     },
                          '3010' => {
                                      'BaseType' => '2967',
                                      'Header' => 'wmem_core.h',
                                      'Line' => '62',
                                      'Name' => 'wmem_allocator_type_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '3022' => {
                                      'BaseType' => '3010',
                                      'Name' => 'wmem_allocator_type_t const',
                                      'Size' => '4',
                                      'Type' => 'Const'
                                    },
                          '3027' => {
                                      'Header' => 'wmem_user_cb.h',
                                      'Line' => '31',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'WMEM_CB_FREE_EVENT',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'WMEM_CB_DESTROY_EVENT',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum _wmem_cb_event_t',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '304' => {
                                     'Name' => 'double',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '3058' => {
                                      'BaseType' => '3027',
                                      'Header' => 'wmem_user_cb.h',
                                      'Line' => '34',
                                      'Name' => 'wmem_cb_event_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '30684' => {
                                       'BaseType' => '29865',
                                       'Name' => 'wmem_multimap_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3096' => {
                                      'Name' => 'void*(*)(void*, size_t const)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          },
                                                   '1' => {
                                                            'type' => '64'
                                                          }
                                                 },
                                      'Return' => '143',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '311' => {
                                     'BaseType' => '215',
                                     'Name' => 'guint8*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '3118' => {
                                      'Name' => 'void(*)(void*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          },
                                                   '1' => {
                                                            'type' => '143'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3149' => {
                                      'Name' => 'void*(*)(void*, void*, size_t const)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '143'
                                                          },
                                                   '1' => {
                                                            'type' => '143'
                                                          },
                                                   '2' => {
                                                            'type' => '64'
                                                          }
                                                 },
                                      'Return' => '143',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3155' => {
                                      'Line' => '18',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cb',
                                                           'offset' => '0',
                                                           'type' => '25409'
                                                         },
                                                  '1' => {
                                                           'name' => 'user_data',
                                                           'offset' => '8',
                                                           'type' => '143'
                                                         },
                                                  '2' => {
                                                           'name' => 'next',
                                                           'offset' => '22',
                                                           'type' => '3160'
                                                         },
                                                  '3' => {
                                                           'name' => 'id',
                                                           'offset' => '36',
                                                           'type' => '280'
                                                         }
                                                },
                                      'Name' => 'struct _wmem_user_cb_container_t',
                                      'Size' => '32',
                                      'Source' => 'wmem_user_cb.c',
                                      'Type' => 'Struct'
                                    },
                          '3160' => {
                                      'BaseType' => '3155',
                                      'Name' => 'struct _wmem_user_cb_container_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '31649' => {
                                       'BaseType' => '280',
                                       'Name' => 'guint*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '317' => {
                                     'BaseType' => '329',
                                     'Header' => 'wmem_core.h',
                                     'Line' => '41',
                                     'Name' => 'wmem_allocator_t',
                                     'Type' => 'Typedef'
                                   },
                          '32715' => {
                                       'BaseType' => '20928',
                                       'Header' => 'wmem_stack.h',
                                       'Line' => '35',
                                       'Name' => 'wmem_stack_t',
                                       'Type' => 'Typedef'
                                     },
                          '32727' => {
                                       'BaseType' => '32715',
                                       'Name' => 'wmem_stack_t const',
                                       'Type' => 'Const'
                                     },
                          '329' => {
                                     'Header' => 'wmem_allocator.h',
                                     'Line' => '27',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'walloc',
                                                          'offset' => '0',
                                                          'type' => '3096'
                                                        },
                                                 '1' => {
                                                          'name' => 'wfree',
                                                          'offset' => '8',
                                                          'type' => '3118'
                                                        },
                                                 '2' => {
                                                          'name' => 'wrealloc',
                                                          'offset' => '22',
                                                          'type' => '3149'
                                                        },
                                                 '3' => {
                                                          'name' => 'free_all',
                                                          'offset' => '36',
                                                          'type' => '2806'
                                                        },
                                                 '4' => {
                                                          'name' => 'gc',
                                                          'offset' => '50',
                                                          'type' => '2806'
                                                        },
                                                 '5' => {
                                                          'name' => 'cleanup',
                                                          'offset' => '64',
                                                          'type' => '2806'
                                                        },
                                                 '6' => {
                                                          'name' => 'callbacks',
                                                          'offset' => '72',
                                                          'type' => '3160'
                                                        },
                                                 '7' => {
                                                          'name' => 'private_data',
                                                          'offset' => '86',
                                                          'type' => '143'
                                                        },
                                                 '8' => {
                                                          'name' => 'type',
                                                          'offset' => '100',
                                                          'type' => '2967'
                                                        },
                                                 '9' => {
                                                          'name' => 'in_scope',
                                                          'offset' => '104',
                                                          'type' => '268'
                                                        }
                                               },
                                     'Name' => 'struct _wmem_allocator_t',
                                     'Size' => '72',
                                     'Type' => 'Struct'
                                   },
                          '32987' => {
                                       'BaseType' => '32715',
                                       'Name' => 'wmem_stack_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '33218' => {
                                       'BaseType' => '32727',
                                       'Name' => 'wmem_stack_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '334' => {
                                     'BaseType' => '346',
                                     'Header' => 'wmem_array.h',
                                     'Line' => '35',
                                     'Name' => 'wmem_array_t',
                                     'Size' => '40',
                                     'Type' => 'Typedef'
                                   },
                          '33538' => {
                                       'BaseType' => '244',
                                       'Name' => 'gchar*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '33581' => {
                                       'Header' => '<built-in>',
                                       'Line' => '0',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'gp_offset',
                                                            'offset' => '0',
                                                            'type' => '45'
                                                          },
                                                   '1' => {
                                                            'name' => 'fp_offset',
                                                            'offset' => '4',
                                                            'type' => '45'
                                                          },
                                                   '2' => {
                                                            'name' => 'overflow_arg_area',
                                                            'offset' => '8',
                                                            'type' => '143'
                                                          },
                                                   '3' => {
                                                            'name' => 'reg_save_area',
                                                            'offset' => '22',
                                                            'type' => '143'
                                                          }
                                                 },
                                       'Name' => 'struct __va_list_tag',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '33661' => {
                                       'BaseType' => '5976',
                                       'Header' => 'gunicode.h',
                                       'Line' => '59',
                                       'Name' => 'gunichar',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '33673' => {
                                       'BaseType' => '33661',
                                       'Name' => 'gunichar const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '33678' => {
                                       'BaseType' => '244',
                                       'Name' => 'gchar[6]',
                                       'Size' => '6',
                                       'Type' => 'Array'
                                     },
                          '33792' => {
                                       'Header' => 'wmem_strbuf.h',
                                       'Line' => '43',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'allocator',
                                                            'offset' => '0',
                                                            'type' => '438'
                                                          },
                                                   '1' => {
                                                            'name' => 'str',
                                                            'offset' => '8',
                                                            'type' => '33538'
                                                          },
                                                   '2' => {
                                                            'name' => 'len',
                                                            'offset' => '22',
                                                            'type' => '227'
                                                          },
                                                   '3' => {
                                                            'name' => 'alloc_len',
                                                            'offset' => '36',
                                                            'type' => '227'
                                                          },
                                                   '4' => {
                                                            'name' => 'max_len',
                                                            'offset' => '50',
                                                            'type' => '227'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_strbuf_t',
                                       'Size' => '40',
                                       'Type' => 'Struct'
                                     },
                          '33877' => {
                                       'BaseType' => '33792',
                                       'Header' => 'wmem_strbuf.h',
                                       'Line' => '54',
                                       'Name' => 'wmem_strbuf_t',
                                       'Size' => '40',
                                       'Type' => 'Typedef'
                                     },
                          '33889' => {
                                       'BaseType' => '33877',
                                       'Name' => 'wmem_strbuf_t const',
                                       'Size' => '40',
                                       'Type' => 'Const'
                                     },
                          '34083' => {
                                       'BaseType' => '83',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '34328' => {
                                       'BaseType' => '33877',
                                       'Name' => 'wmem_strbuf_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '34536' => {
                                       'BaseType' => '33889',
                                       'Name' => 'wmem_strbuf_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '346' => {
                                     'Line' => '27',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'allocator',
                                                          'offset' => '0',
                                                          'type' => '438'
                                                        },
                                                 '1' => {
                                                          'name' => 'buf',
                                                          'offset' => '8',
                                                          'type' => '311'
                                                        },
                                                 '2' => {
                                                          'name' => 'elem_size',
                                                          'offset' => '22',
                                                          'type' => '227'
                                                        },
                                                 '3' => {
                                                          'name' => 'elem_count',
                                                          'offset' => '36',
                                                          'type' => '280'
                                                        },
                                                 '4' => {
                                                          'name' => 'alloc_count',
                                                          'offset' => '40',
                                                          'type' => '280'
                                                        },
                                                 '5' => {
                                                          'name' => 'null_terminated',
                                                          'offset' => '50',
                                                          'type' => '268'
                                                        }
                                               },
                                     'Name' => 'struct _wmem_array_t',
                                     'Size' => '40',
                                     'Source' => 'wmem_array.c',
                                     'Type' => 'Struct'
                                   },
                          '36716' => {
                                       'BaseType' => '33581',
                                       'Name' => 'struct __va_list_tag*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '39045' => {
                                       'BaseType' => '2591',
                                       'Name' => 'char**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41675' => {
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '144',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'length',
                                                            'offset' => '0',
                                                            'type' => '5976'
                                                          },
                                                   '1' => {
                                                            'name' => 'key',
                                                            'offset' => '8',
                                                            'type' => '41715'
                                                          }
                                                 },
                                       'Name' => 'struct _wmem_tree_key_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '41715' => {
                                       'BaseType' => '5976',
                                       'Name' => 'guint32*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '41721' => {
                                       'BaseType' => '41675',
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '147',
                                       'Name' => 'wmem_tree_key_t',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '41733' => {
                                       'BaseType' => '41745',
                                       'Header' => 'wmem_tree.h',
                                       'Line' => '213',
                                       'Name' => 'wmem_foreach_func',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '41745' => {
                                       'Name' => 'gboolean(*)(void const*, void*, void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '196'
                                                           },
                                                    '1' => {
                                                             'type' => '143'
                                                           },
                                                    '2' => {
                                                             'type' => '143'
                                                           }
                                                  },
                                       'Return' => '268',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '438' => {
                                     'BaseType' => '317',
                                     'Name' => 'wmem_allocator_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '44020' => {
                                       'BaseType' => '41721',
                                       'Name' => 'wmem_tree_key_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '45' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '52' => {
                                    'BaseType' => '69',
                                    'Header' => 'stddef.h',
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '53058' => {
                                       'Header' => 'ws_log_defs.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'LOG_LEVEL_NONE',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'LOG_LEVEL_NOISY',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'LOG_LEVEL_DEBUG',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'LOG_LEVEL_INFO',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'LOG_LEVEL_MESSAGE',
                                                            'value' => '4'
                                                          },
                                                   '5' => {
                                                            'name' => 'LOG_LEVEL_WARNING',
                                                            'value' => '5'
                                                          },
                                                   '6' => {
                                                            'name' => 'LOG_LEVEL_CRITICAL',
                                                            'value' => '6'
                                                          },
                                                   '7' => {
                                                            'name' => 'LOG_LEVEL_ERROR',
                                                            'value' => '7'
                                                          },
                                                   '8' => {
                                                            'name' => 'LOG_LEVEL_ECHO',
                                                            'value' => '8'
                                                          },
                                                   '9' => {
                                                            'name' => '_LOG_LEVEL_LAST',
                                                            'value' => '9'
                                                          }
                                                 },
                                       'Name' => 'enum ws_log_level',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '53373' => {
                                       'Name' => 'void(*)(gpointer)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '2696'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '53390' => {
                                       'BaseType' => '53402',
                                       'Header' => 'garray.h',
                                       'Line' => '39',
                                       'Name' => 'GPtrArray',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '53402' => {
                                       'Header' => 'garray.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'pdata',
                                                            'offset' => '0',
                                                            'type' => '53448'
                                                          },
                                                   '1' => {
                                                            'name' => 'len',
                                                            'offset' => '8',
                                                            'type' => '280'
                                                          }
                                                 },
                                       'Name' => 'struct _GPtrArray',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '53448' => {
                                       'BaseType' => '2696',
                                       'Name' => 'gpointer*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53454' => {
                                       'BaseType' => '53390',
                                       'Name' => 'GPtrArray*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '53460' => {
                                       'Header' => 'buffer.h',
                                       'Line' => '21',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data',
                                                            'offset' => '0',
                                                            'type' => '311'
                                                          },
                                                   '1' => {
                                                            'name' => 'allocated',
                                                            'offset' => '8',
                                                            'type' => '227'
                                                          },
                                                   '2' => {
                                                            'name' => 'start',
                                                            'offset' => '22',
                                                            'type' => '227'
                                                          },
                                                   '3' => {
                                                            'name' => 'first_free',
                                                            'offset' => '36',
                                                            'type' => '227'
                                                          }
                                                 },
                                       'Name' => 'struct Buffer',
                                       'Size' => '32',
                                       'Type' => 'Struct'
                                     },
                          '53526' => {
                                       'BaseType' => '53460',
                                       'Header' => 'buffer.h',
                                       'Line' => '26',
                                       'Name' => 'Buffer',
                                       'Size' => '32',
                                       'Type' => 'Typedef'
                                     },
                          '54105' => {
                                       'BaseType' => '53526',
                                       'Name' => 'Buffer*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '55947' => {
                                       'Name' => 'void(*)()',
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '55961' => {
                                       'BaseType' => '55973',
                                       'Header' => 'ghash.h',
                                       'Line' => '37',
                                       'Name' => 'GHashTable',
                                       'Type' => 'Typedef'
                                     },
                          '55973' => {
                                       'Name' => 'struct _GHashTable',
                                       'Type' => 'Struct'
                                     },
                          '55978' => {
                                       'BaseType' => '55990',
                                       'Header' => 'gslist.h',
                                       'Line' => '37',
                                       'Name' => 'GSList',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '55990' => {
                                       'Header' => 'gslist.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data',
                                                            'offset' => '0',
                                                            'type' => '2696'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '56030'
                                                          }
                                                 },
                                       'Name' => 'struct _GSList',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '56030' => {
                                       'BaseType' => '55978',
                                       'Name' => 'GSList*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56082' => {
                                       'Header' => 'codecs.h',
                                       'Line' => '25',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'register_codec_module',
                                                            'offset' => '0',
                                                            'type' => '55947'
                                                          }
                                                 },
                                       'Name' => 'struct codecs_plugin',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '56094' => {
                                       'BaseType' => '56082',
                                       'Name' => 'codecs_plugin const',
                                       'Size' => '8',
                                       'Type' => 'Const'
                                     },
                          '56099' => {
                                       'BaseType' => '56111',
                                       'Header' => 'codecs.h',
                                       'Line' => '42',
                                       'Name' => 'codec_handle_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56111' => {
                                       'BaseType' => '56117',
                                       'Name' => 'struct codec_handle*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56117' => {
                                       'Line' => '75',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'name',
                                                            'offset' => '0',
                                                            'type' => '90'
                                                          },
                                                   '1' => {
                                                            'name' => 'init_fn',
                                                            'offset' => '8',
                                                            'type' => '56209'
                                                          },
                                                   '2' => {
                                                            'name' => 'release_fn',
                                                            'offset' => '22',
                                                            'type' => '56232'
                                                          },
                                                   '3' => {
                                                            'name' => 'channels_fn',
                                                            'offset' => '36',
                                                            'type' => '56244'
                                                          },
                                                   '4' => {
                                                            'name' => 'frequency_fn',
                                                            'offset' => '50',
                                                            'type' => '56277'
                                                          },
                                                   '5' => {
                                                            'name' => 'decode_fn',
                                                            'offset' => '64',
                                                            'type' => '56289'
                                                          }
                                                 },
                                       'Name' => 'struct codec_handle',
                                       'Size' => '48',
                                       'Source' => 'codecs.c',
                                       'Type' => 'Struct'
                                     },
                          '56209' => {
                                       'BaseType' => '56221',
                                       'Header' => 'codecs.h',
                                       'Line' => '58',
                                       'Name' => 'codec_init_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56221' => {
                                       'Name' => 'void*(*)()',
                                       'Return' => '143',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '56232' => {
                                       'BaseType' => '2806',
                                       'Header' => 'codecs.h',
                                       'Line' => '64',
                                       'Name' => 'codec_release_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56244' => {
                                       'BaseType' => '56256',
                                       'Header' => 'codecs.h',
                                       'Line' => '72',
                                       'Name' => 'codec_get_channels_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56256' => {
                                       'Name' => 'unsigned int(*)(void*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '143'
                                                           }
                                                  },
                                       'Return' => '45',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '56277' => {
                                       'BaseType' => '56256',
                                       'Header' => 'codecs.h',
                                       'Line' => '80',
                                       'Name' => 'codec_get_frequency_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56289' => {
                                       'BaseType' => '56301',
                                       'Header' => 'codecs.h',
                                       'Line' => '102',
                                       'Name' => 'codec_decode_fn',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '56301' => {
                                       'Name' => 'size_t(*)(void*, void const*, size_t, void*, size_t*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '143'
                                                           },
                                                    '1' => {
                                                             'type' => '196'
                                                           },
                                                    '2' => {
                                                             'type' => '52'
                                                           },
                                                    '3' => {
                                                             'type' => '143'
                                                           },
                                                    '4' => {
                                                             'type' => '56342'
                                                           }
                                                  },
                                       'Return' => '52',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '56342' => {
                                       'BaseType' => '52',
                                       'Name' => 'size_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '56348' => {
                                       'BaseType' => '1',
                                       'Header' => 'plugins.h',
                                       'Line' => '23',
                                       'Name' => 'plugins_t',
                                       'Type' => 'Typedef'
                                     },
                          '56389' => {
                                       'Header' => 'plugins.h',
                                       'Line' => '29',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'WS_PLUGIN_EPAN',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'WS_PLUGIN_WIRETAP',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'WS_PLUGIN_CODEC',
                                                            'value' => '2'
                                                          }
                                                 },
                                       'Name' => 'enum plugin_type_e',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '56423' => {
                                       'BaseType' => '56348',
                                       'Name' => 'plugins_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58258' => {
                                       'BaseType' => '56094',
                                       'Name' => 'codecs_plugin const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '58844' => {
                                       'BaseType' => '76',
                                       'Header' => 'glibconfig.h',
                                       'Line' => '46',
                                       'Name' => 'guint16',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '5976' => {
                                      'BaseType' => '45',
                                      'Header' => 'glibconfig.h',
                                      'Line' => '54',
                                      'Name' => 'guint32',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '61351' => {
                                       'BaseType' => '122',
                                       'Name' => 'unsigned char const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '61446' => {
                                       'BaseType' => '58844',
                                       'Header' => 'crc16-plain.h',
                                       'Line' => '52',
                                       'Name' => 'crc16_plain_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '61785' => {
                                       'BaseType' => '61351',
                                       'Name' => 'unsigned char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '62051' => {
                                       'BaseType' => '122',
                                       'Header' => 'gtypes.h',
                                       'Line' => '52',
                                       'Name' => 'guchar',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '64' => {
                                    'BaseType' => '52',
                                    'Name' => 'size_t const',
                                    'Size' => '8',
                                    'Type' => 'Const'
                                  },
                          '65754' => {
                                       'BaseType' => '45',
                                       'Header' => 'gpg-error.h',
                                       'Line' => '738',
                                       'Name' => 'gpg_error_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '65767' => {
                                       'BaseType' => '122',
                                       'Name' => 'unsigned char*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '65773' => {
                                       'BaseType' => '65754',
                                       'Header' => 'gcrypt.h',
                                       'Line' => '135',
                                       'Name' => 'gcry_error_t',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '65859' => {
                                       'BaseType' => '65872',
                                       'Header' => 'gcrypt.h',
                                       'Line' => '349',
                                       'Name' => 'gcry_sexp_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '65872' => {
                                       'BaseType' => '65878',
                                       'Name' => 'struct gcry_sexp*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '65878' => {
                                       'Name' => 'struct gcry_sexp',
                                       'Type' => 'Struct'
                                     },
                          '68061' => {
                                       'BaseType' => '62051',
                                       'Name' => 'guchar const',
                                       'Size' => '1',
                                       'Type' => 'Const'
                                     },
                          '683' => {
                                     'BaseType' => '334',
                                     'Name' => 'wmem_array_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '68502' => {
                                       'BaseType' => '68061',
                                       'Name' => 'guchar const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68508' => {
                                       'BaseType' => '62051',
                                       'Name' => 'guchar*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '68514' => {
                                       'BaseType' => '215',
                                       'Name' => 'guint8[4]',
                                       'Size' => '4',
                                       'Type' => 'Array'
                                     },
                          '69' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '69186' => {
                                       'Header' => 'eax.h',
                                       'Line' => '18',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'Mac',
                                                            'offset' => '0',
                                                            'type' => '68514'
                                                          }
                                                 },
                                       'Name' => 'struct tagMAC_T',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '69229' => {
                                       'BaseType' => '69186',
                                       'Header' => 'eax.h',
                                       'Line' => '21',
                                       'Name' => 'MAC_T',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '69284' => {
                                       'BaseType' => '215',
                                       'Name' => 'guint8[16]',
                                       'Size' => '16',
                                       'Type' => 'Array'
                                     },
                          '72155' => {
                                       'BaseType' => '69229',
                                       'Name' => 'MAC_T*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72665' => {
                                       'BaseType' => '72677',
                                       'Header' => 'glist.h',
                                       'Line' => '37',
                                       'Name' => 'GList',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '72677' => {
                                       'Header' => 'glist.h',
                                       'Line' => '39',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'data',
                                                            'offset' => '0',
                                                            'type' => '2696'
                                                          },
                                                   '1' => {
                                                            'name' => 'next',
                                                            'offset' => '8',
                                                            'type' => '72730'
                                                          },
                                                   '2' => {
                                                            'name' => 'prev',
                                                            'offset' => '22',
                                                            'type' => '72730'
                                                          }
                                                 },
                                       'Name' => 'struct _GList',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '72730' => {
                                       'BaseType' => '72665',
                                       'Name' => 'GList*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72736' => {
                                       'BaseType' => '72748',
                                       'Header' => 'gstring.h',
                                       'Line' => '39',
                                       'Name' => 'GString',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '72748' => {
                                       'Header' => 'gstring.h',
                                       'Line' => '41',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'str',
                                                            'offset' => '0',
                                                            'type' => '33538'
                                                          },
                                                   '1' => {
                                                            'name' => 'len',
                                                            'offset' => '8',
                                                            'type' => '227'
                                                          },
                                                   '2' => {
                                                            'name' => 'allocated_len',
                                                            'offset' => '22',
                                                            'type' => '227'
                                                          }
                                                 },
                                       'Name' => 'struct _GString',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '72801' => {
                                       'BaseType' => '72736',
                                       'Name' => 'GString*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '72807' => {
                                       'BaseType' => '72819',
                                       'Header' => 'feature_list.h',
                                       'Line' => '28',
                                       'Name' => 'feature_list',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '72819' => {
                                       'BaseType' => '72730',
                                       'Name' => 'GList**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '73991' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '152',
                                       'Name' => '__off_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '74003' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '153',
                                       'Name' => '__off64_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '74015' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '160',
                                       'Name' => '__time_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '74058' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '194',
                                       'Name' => '__ssize_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '74070' => {
                                       'BaseType' => '108',
                                       'Header' => 'types.h',
                                       'Line' => '197',
                                       'Name' => '__syscall_slong_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '74200' => {
                                       'Header' => 'struct_timespec.h',
                                       'Line' => '11',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'tv_sec',
                                                            'offset' => '0',
                                                            'type' => '74015'
                                                          },
                                                   '1' => {
                                                            'name' => 'tv_nsec',
                                                            'offset' => '8',
                                                            'type' => '74070'
                                                          }
                                                 },
                                       'Name' => 'struct timespec',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '74444' => {
                                       'BaseType' => '5976',
                                       'Header' => 'gquark.h',
                                       'Line' => '36',
                                       'Name' => 'GQuark',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '74456' => {
                                       'BaseType' => '74468',
                                       'Header' => 'gerror.h',
                                       'Line' => '41',
                                       'Name' => 'GError',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '74468' => {
                                       'Header' => 'gerror.h',
                                       'Line' => '43',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'domain',
                                                            'offset' => '0',
                                                            'type' => '74444'
                                                          },
                                                   '1' => {
                                                            'name' => 'code',
                                                            'offset' => '4',
                                                            'type' => '256'
                                                          },
                                                   '2' => {
                                                            'name' => 'message',
                                                            'offset' => '8',
                                                            'type' => '33538'
                                                          }
                                                 },
                                       'Name' => 'struct _GError',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '74521' => {
                                       'BaseType' => '74456',
                                       'Name' => 'GError*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74527' => {
                                       'BaseType' => '74058',
                                       'Header' => 'types.h',
                                       'Line' => '108',
                                       'Name' => 'ssize_t',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '74703' => {
                                       'BaseType' => '55961',
                                       'Name' => 'GHashTable const',
                                       'Type' => 'Const'
                                     },
                          '74713' => {
                                       'BaseType' => '74521',
                                       'Name' => 'GError**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '74838' => {
                                       'Header' => 'struct_FILE.h',
                                       'Line' => '49',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => '_flags',
                                                            'offset' => '0',
                                                            'type' => '83'
                                                          },
                                                   '1' => {
                                                            'name' => '_IO_read_ptr',
                                                            'offset' => '8',
                                                            'type' => '2591'
                                                          },
                                                   '10' => {
                                                             'name' => '_IO_backup_base',
                                                             'offset' => '128',
                                                             'type' => '2591'
                                                           },
                                                   '11' => {
                                                             'name' => '_IO_save_end',
                                                             'offset' => '136',
                                                             'type' => '2591'
                                                           },
                                                   '12' => {
                                                             'name' => '_markers',
                                                             'offset' => '150',
                                                             'type' => '75254'
                                                           },
                                                   '13' => {
                                                             'name' => '_chain',
                                                             'offset' => '260',
                                                             'type' => '75260'
                                                           },
                                                   '14' => {
                                                             'name' => '_fileno',
                                                             'offset' => '274',
                                                             'type' => '83'
                                                           },
                                                   '15' => {
                                                             'name' => '_flags2',
                                                             'offset' => '278',
                                                             'type' => '83'
                                                           },
                                                   '16' => {
                                                             'name' => '_old_offset',
                                                             'offset' => '288',
                                                             'type' => '73991'
                                                           },
                                                   '17' => {
                                                             'name' => '_cur_column',
                                                             'offset' => '296',
                                                             'type' => '76'
                                                           },
                                                   '18' => {
                                                             'name' => '_vtable_offset',
                                                             'offset' => '304',
                                                             'type' => '129'
                                                           },
                                                   '19' => {
                                                             'name' => '_shortbuf',
                                                             'offset' => '305',
                                                             'type' => '75266'
                                                           },
                                                   '2' => {
                                                            'name' => '_IO_read_end',
                                                            'offset' => '22',
                                                            'type' => '2591'
                                                          },
                                                   '20' => {
                                                             'name' => '_lock',
                                                             'offset' => '310',
                                                             'type' => '75282'
                                                           },
                                                   '21' => {
                                                             'name' => '_offset',
                                                             'offset' => '324',
                                                             'type' => '74003'
                                                           },
                                                   '22' => {
                                                             'name' => '_codecvt',
                                                             'offset' => '338',
                                                             'type' => '75293'
                                                           },
                                                   '23' => {
                                                             'name' => '_wide_data',
                                                             'offset' => '352',
                                                             'type' => '75304'
                                                           },
                                                   '24' => {
                                                             'name' => '_freeres_list',
                                                             'offset' => '360',
                                                             'type' => '75260'
                                                           },
                                                   '25' => {
                                                             'name' => '_freeres_buf',
                                                             'offset' => '374',
                                                             'type' => '143'
                                                           },
                                                   '26' => {
                                                             'name' => '__pad5',
                                                             'offset' => '388',
                                                             'type' => '52'
                                                           },
                                                   '27' => {
                                                             'name' => '_mode',
                                                             'offset' => '402',
                                                             'type' => '83'
                                                           },
                                                   '28' => {
                                                             'name' => '_unused2',
                                                             'offset' => '406',
                                                             'type' => '75310'
                                                           },
                                                   '3' => {
                                                            'name' => '_IO_read_base',
                                                            'offset' => '36',
                                                            'type' => '2591'
                                                          },
                                                   '4' => {
                                                            'name' => '_IO_write_base',
                                                            'offset' => '50',
                                                            'type' => '2591'
                                                          },
                                                   '5' => {
                                                            'name' => '_IO_write_ptr',
                                                            'offset' => '64',
                                                            'type' => '2591'
                                                          },
                                                   '6' => {
                                                            'name' => '_IO_write_end',
                                                            'offset' => '72',
                                                            'type' => '2591'
                                                          },
                                                   '7' => {
                                                            'name' => '_IO_buf_base',
                                                            'offset' => '86',
                                                            'type' => '2591'
                                                          },
                                                   '8' => {
                                                            'name' => '_IO_buf_end',
                                                            'offset' => '100',
                                                            'type' => '2591'
                                                          },
                                                   '9' => {
                                                            'name' => '_IO_save_base',
                                                            'offset' => '114',
                                                            'type' => '2591'
                                                          }
                                                 },
                                       'Name' => 'struct _IO_FILE',
                                       'Size' => '216',
                                       'Type' => 'Struct'
                                     },
                          '75229' => {
                                       'BaseType' => '74838',
                                       'Header' => 'FILE.h',
                                       'Line' => '7',
                                       'Name' => 'FILE',
                                       'Size' => '216',
                                       'Type' => 'Typedef'
                                     },
                          '75241' => {
                                       'BaseType' => '1',
                                       'Header' => 'struct_FILE.h',
                                       'Line' => '43',
                                       'Name' => '_IO_lock_t',
                                       'Type' => 'Typedef'
                                     },
                          '75249' => {
                                       'Name' => 'struct _IO_marker',
                                       'Type' => 'Struct'
                                     },
                          '75254' => {
                                       'BaseType' => '75249',
                                       'Name' => 'struct _IO_marker*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75260' => {
                                       'BaseType' => '74838',
                                       'Name' => 'struct _IO_FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75266' => {
                                       'BaseType' => '96',
                                       'Name' => 'char[1]',
                                       'Size' => '1',
                                       'Type' => 'Array'
                                     },
                          '75282' => {
                                       'BaseType' => '75241',
                                       'Name' => '_IO_lock_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75288' => {
                                       'Name' => 'struct _IO_codecvt',
                                       'Type' => 'Struct'
                                     },
                          '75293' => {
                                       'BaseType' => '75288',
                                       'Name' => 'struct _IO_codecvt*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75299' => {
                                       'Name' => 'struct _IO_wide_data',
                                       'Type' => 'Struct'
                                     },
                          '75304' => {
                                       'BaseType' => '75299',
                                       'Name' => 'struct _IO_wide_data*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '75310' => {
                                       'BaseType' => '96',
                                       'Name' => 'char[20]',
                                       'Size' => '20',
                                       'Type' => 'Array'
                                     },
                          '75326' => {
                                       'BaseType' => '75229',
                                       'Name' => 'FILE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '76' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '82707' => {
                                       'BaseType' => '74703',
                                       'Name' => 'GHashTable const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '83' => {
                                    'Name' => 'int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '90' => {
                                    'BaseType' => '103',
                                    'Name' => 'char const*',
                                    'Size' => '8',
                                    'Type' => 'Pointer'
                                  },
                          '90205' => {
                                       'Name' => '_Bool',
                                       'Size' => '1',
                                       'Type' => 'Intrinsic'
                                     },
                          '92852' => {
                                       'BaseType' => '5976',
                                       'Header' => 'inet_ipv4.h',
                                       'Line' => '15',
                                       'Name' => 'ws_in4_addr',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '92864' => {
                                       'Header' => 'inet_ipv6.h',
                                       'Line' => '20',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'bytes',
                                                            'offset' => '0',
                                                            'type' => '69284'
                                                          }
                                                 },
                                       'Name' => 'struct e_in6_addr',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '92907' => {
                                       'BaseType' => '92864',
                                       'Header' => 'inet_ipv6.h',
                                       'Line' => '22',
                                       'Name' => 'ws_in6_addr',
                                       'Size' => '16',
                                       'Type' => 'Typedef'
                                     },
                          '93569' => {
                                       'BaseType' => '92907',
                                       'Name' => 'ws_in6_addr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '94474' => {
                                       'BaseType' => '92852',
                                       'Name' => 'ws_in4_addr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '95375' => {
                                       'BaseType' => '122',
                                       'Header' => 'types.h',
                                       'Line' => '38',
                                       'Name' => '__uint8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '95387' => {
                                       'BaseType' => '76',
                                       'Header' => 'types.h',
                                       'Line' => '40',
                                       'Name' => '__uint16_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '95564' => {
                                       'BaseType' => '95375',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '24',
                                       'Name' => 'uint8_t',
                                       'Size' => '1',
                                       'Type' => 'Typedef'
                                     },
                          '95576' => {
                                       'BaseType' => '95387',
                                       'Header' => 'stdint-uintn.h',
                                       'Line' => '25',
                                       'Name' => 'uint16_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '95600' => {
                                       'BaseType' => '76',
                                       'Header' => 'sockaddr.h',
                                       'Line' => '28',
                                       'Name' => 'sa_family_t',
                                       'Size' => '2',
                                       'Type' => 'Typedef'
                                     },
                          '96' => {
                                    'Name' => 'char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '97161' => {
                                       'Header' => 'jsmn.h',
                                       'Line' => '46',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'JSMN_UNDEFINED',
                                                            'value' => '0'
                                                          },
                                                   '1' => {
                                                            'name' => 'JSMN_OBJECT',
                                                            'value' => '1'
                                                          },
                                                   '2' => {
                                                            'name' => 'JSMN_ARRAY',
                                                            'value' => '2'
                                                          },
                                                   '3' => {
                                                            'name' => 'JSMN_STRING',
                                                            'value' => '3'
                                                          },
                                                   '4' => {
                                                            'name' => 'JSMN_PRIMITIVE',
                                                            'value' => '4'
                                                          }
                                                 },
                                       'Name' => 'enum jsmntype_t',
                                       'Size' => '4',
                                       'Type' => 'Enum'
                                     },
                          '97272' => {
                                       'Header' => 'jsmn.h',
                                       'Line' => '71',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '97161'
                                                          },
                                                   '1' => {
                                                            'name' => 'start',
                                                            'offset' => '4',
                                                            'type' => '83'
                                                          },
                                                   '2' => {
                                                            'name' => 'end',
                                                            'offset' => '8',
                                                            'type' => '83'
                                                          },
                                                   '3' => {
                                                            'name' => 'size',
                                                            'offset' => '18',
                                                            'type' => '83'
                                                          }
                                                 },
                                       'Name' => 'struct jsmntok_t',
                                       'Size' => '16',
                                       'Type' => 'Struct'
                                     },
                          '97851' => {
                                       'BaseType' => '97272',
                                       'Name' => 'jsmntok_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '98732' => {
                                       'BaseType' => '108',
                                       'Header' => 'glibconfig.h',
                                       'Line' => '79',
                                       'Name' => 'gssize',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '98888' => {
                                       'BaseType' => '304',
                                       'Header' => 'gtypes.h',
                                       'Line' => '58',
                                       'Name' => 'gdouble',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '99041' => {
                                       'BaseType' => '256',
                                       'Name' => 'gint*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '99617' => {
                                       'Header' => 'json_dumper.h',
                                       'Line' => '53',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'output_file',
                                                            'offset' => '0',
                                                            'type' => '75326'
                                                          },
                                                   '1' => {
                                                            'name' => 'output_string',
                                                            'offset' => '8',
                                                            'type' => '72801'
                                                          },
                                                   '2' => {
                                                            'name' => 'flags',
                                                            'offset' => '22',
                                                            'type' => '83'
                                                          },
                                                   '3' => {
                                                            'name' => 'current_depth',
                                                            'offset' => '32',
                                                            'type' => '83'
                                                          },
                                                   '4' => {
                                                            'name' => 'base64_state',
                                                            'offset' => '36',
                                                            'type' => '256'
                                                          },
                                                   '5' => {
                                                            'name' => 'base64_save',
                                                            'offset' => '40',
                                                            'type' => '256'
                                                          },
                                                   '6' => {
                                                            'name' => 'state',
                                                            'offset' => '50',
                                                            'type' => '99723'
                                                          }
                                                 },
                                       'Name' => 'struct json_dumper',
                                       'Size' => '1136',
                                       'Type' => 'Struct'
                                     },
                          '99723' => {
                                       'BaseType' => '215',
                                       'Name' => 'guint8[1100]',
                                       'Size' => '1100',
                                       'Type' => 'Array'
                                     },
                          '99740' => {
                                       'BaseType' => '99617',
                                       'Header' => 'json_dumper.h',
                                       'Line' => '64',
                                       'Name' => 'json_dumper',
                                       'Size' => '1136',
                                       'Type' => 'Typedef'
                                     }
                        },
          'UndefinedSymbols' => {
                                  'libwsutil.so.14.0.0' => {
                                                             '_ITM_deregisterTMCloneTable' => 0,
                                                             '_ITM_registerTMCloneTable' => 0,
                                                             '__assert_fail@GLIBC_2.2.5' => 0,
                                                             '__cxa_atexit@GLIBC_2.2.5' => 0,
                                                             '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                             '__errno_location@GLIBC_2.2.5' => 0,
                                                             '__fdelt_chk@GLIBC_2.15' => 0,
                                                             '__fprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__fread_chk@GLIBC_2.7' => 0,
                                                             '__getcwd_chk@GLIBC_2.4' => 0,
                                                             '__gmon_start__' => 0,
                                                             '__isoc99_sscanf@GLIBC_2.7' => 0,
                                                             '__memcpy_chk@GLIBC_2.3.4' => 0,
                                                             '__printf_chk@GLIBC_2.3.4' => 0,
                                                             '__read_chk@GLIBC_2.4' => 0,
                                                             '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__stack_chk_fail@GLIBC_2.4' => 0,
                                                             '__uflow@GLIBC_2.2.5' => 0,
                                                             '__vasprintf_chk@GLIBC_2.8' => 0,
                                                             '__vfprintf_chk@GLIBC_2.3.4' => 0,
                                                             '__vsnprintf_chk@GLIBC_2.3.4' => 0,
                                                             '_gcry_mpi_get_const@GCRYPT_1.6' => 0,
                                                             'abort@GLIBC_2.2.5' => 0,
                                                             'access@GLIBC_2.2.5' => 0,
                                                             'clock_gettime@GLIBC_2.17' => 0,
                                                             'close@GLIBC_2.2.5' => 0,
                                                             'endgrent@GLIBC_2.2.5' => 0,
                                                             'endpwent@GLIBC_2.2.5' => 0,
                                                             'exit@GLIBC_2.2.5' => 0,
                                                             'fclose@GLIBC_2.2.5' => 0,
                                                             'fcntl@GLIBC_2.2.5' => 0,
                                                             'feof@GLIBC_2.2.5' => 0,
                                                             'ferror@GLIBC_2.2.5' => 0,
                                                             'fflush@GLIBC_2.2.5' => 0,
                                                             'fileno@GLIBC_2.2.5' => 0,
                                                             'fopen@GLIBC_2.2.5' => 0,
                                                             'fputc@GLIBC_2.2.5' => 0,
                                                             'fputs@GLIBC_2.2.5' => 0,
                                                             'free@GLIBC_2.2.5' => 0,
                                                             'freeifaddrs@GLIBC_2.3' => 0,
                                                             'fstat@GLIBC_2.33' => 0,
                                                             'fwrite@GLIBC_2.2.5' => 0,
                                                             'g_ascii_dtostr' => 0,
                                                             'g_ascii_strcasecmp' => 0,
                                                             'g_ascii_strtod' => 0,
                                                             'g_ascii_strtoll' => 0,
                                                             'g_ascii_strtoull' => 0,
                                                             'g_ascii_table' => 0,
                                                             'g_ascii_tolower' => 0,
                                                             'g_ascii_toupper' => 0,
                                                             'g_assertion_message' => 0,
                                                             'g_assertion_message_expr' => 0,
                                                             'g_base64_encode_close' => 0,
                                                             'g_base64_encode_step' => 0,
                                                             'g_build_filename' => 0,
                                                             'g_dir_close' => 0,
                                                             'g_dir_open' => 0,
                                                             'g_dir_read_name' => 0,
                                                             'g_file_error_from_errno' => 0,
                                                             'g_file_error_quark' => 0,
                                                             'g_file_open_tmp' => 0,
                                                             'g_file_test' => 0,
                                                             'g_filename_to_uri' => 0,
                                                             'g_free' => 0,
                                                             'g_get_home_dir' => 0,
                                                             'g_get_monotonic_time' => 0,
                                                             'g_get_user_config_dir' => 0,
                                                             'g_getenv' => 0,
                                                             'g_hash_table_destroy' => 0,
                                                             'g_hash_table_get_keys' => 0,
                                                             'g_hash_table_insert' => 0,
                                                             'g_hash_table_iter_init' => 0,
                                                             'g_hash_table_iter_next' => 0,
                                                             'g_hash_table_lookup' => 0,
                                                             'g_hash_table_lookup_extended' => 0,
                                                             'g_hash_table_new' => 0,
                                                             'g_hash_table_new_full' => 0,
                                                             'g_hash_table_remove' => 0,
                                                             'g_hash_table_replace' => 0,
                                                             'g_hash_table_size' => 0,
                                                             'g_io_channel_set_buffered' => 0,
                                                             'g_io_channel_set_close_on_unref' => 0,
                                                             'g_io_channel_set_encoding' => 0,
                                                             'g_io_channel_unix_new' => 0,
                                                             'g_list_first' => 0,
                                                             'g_list_free' => 0,
                                                             'g_list_free_full' => 0,
                                                             'g_list_prepend' => 0,
                                                             'g_list_sort' => 0,
                                                             'g_log' => 0,
                                                             'g_log_set_handler' => 0,
                                                             'g_log_writer_supports_color' => 0,
                                                             'g_malloc' => 0,
                                                             'g_malloc0' => 0,
                                                             'g_malloc_n' => 0,
                                                             'g_mkdir_with_parents' => 0,
                                                             'g_module_close' => 0,
                                                             'g_module_error' => 0,
                                                             'g_module_name' => 0,
                                                             'g_module_open' => 0,
                                                             'g_module_supported' => 0,
                                                             'g_module_symbol' => 0,
                                                             'g_path_is_absolute' => 0,
                                                             'g_ptr_array_add' => 0,
                                                             'g_ptr_array_free' => 0,
                                                             'g_ptr_array_new' => 0,
                                                             'g_ptr_array_new_with_free_func' => 0,
                                                             'g_ptr_array_remove_index' => 0,
                                                             'g_ptr_array_set_free_func' => 0,
                                                             'g_ptr_array_sized_new' => 0,
                                                             'g_ptr_array_sort' => 0,
                                                             'g_random_int' => 0,
                                                             'g_random_int_range' => 0,
                                                             'g_realloc' => 0,
                                                             'g_return_if_fail_warning' => 0,
                                                             'g_set_error_literal' => 0,
                                                             'g_set_prgname' => 0,
                                                             'g_shell_quote' => 0,
                                                             'g_slist_foreach' => 0,
                                                             'g_slist_free' => 0,
                                                             'g_slist_prepend' => 0,
                                                             'g_slist_remove' => 0,
                                                             'g_spawn_async_with_pipes' => 0,
                                                             'g_spawn_sync' => 0,
                                                             'g_stpcpy' => 0,
                                                             'g_str_equal' => 0,
                                                             'g_str_has_prefix' => 0,
                                                             'g_str_has_suffix' => 0,
                                                             'g_str_hash' => 0,
                                                             'g_strchomp' => 0,
                                                             'g_strcmp0' => 0,
                                                             'g_strdelimit' => 0,
                                                             'g_strdup' => 0,
                                                             'g_strerror' => 0,
                                                             'g_strfreev' => 0,
                                                             'g_string_append' => 0,
                                                             'g_string_append_len' => 0,
                                                             'g_string_append_printf' => 0,
                                                             'g_string_append_vprintf' => 0,
                                                             'g_string_free' => 0,
                                                             'g_string_insert_c' => 0,
                                                             'g_string_new' => 0,
                                                             'g_string_sized_new' => 0,
                                                             'g_strlcat' => 0,
                                                             'g_strlcpy' => 0,
                                                             'g_tree_destroy' => 0,
                                                             'g_tree_foreach' => 0,
                                                             'g_tree_insert' => 0,
                                                             'g_tree_new_full' => 0,
                                                             'g_tree_nnodes' => 0,
                                                             'g_unichar_isprint' => 0,
                                                             'g_unichar_to_utf8' => 0,
                                                             'g_unichar_validate' => 0,
                                                             'g_utf8_get_char' => 0,
                                                             'g_utf8_skip' => 0,
                                                             'g_utf8_validate' => 0,
                                                             'gcry_cipher_close@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_encrypt@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_open@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_setctr@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_setiv@GCRYPT_1.6' => 0,
                                                             'gcry_cipher_setkey@GCRYPT_1.6' => 0,
                                                             'gcry_ctx_release@GCRYPT_1.6' => 0,
                                                             'gcry_mac_close@GCRYPT_1.6' => 0,
                                                             'gcry_mac_open@GCRYPT_1.6' => 0,
                                                             'gcry_mac_read@GCRYPT_1.6' => 0,
                                                             'gcry_mac_setkey@GCRYPT_1.6' => 0,
                                                             'gcry_mac_write@GCRYPT_1.6' => 0,
                                                             'gcry_md_close@GCRYPT_1.6' => 0,
                                                             'gcry_md_get_algo_dlen@GCRYPT_1.6' => 0,
                                                             'gcry_md_open@GCRYPT_1.6' => 0,
                                                             'gcry_md_read@GCRYPT_1.6' => 0,
                                                             'gcry_md_reset@GCRYPT_1.6' => 0,
                                                             'gcry_md_setkey@GCRYPT_1.6' => 0,
                                                             'gcry_md_write@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_cmp@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_ec_get_affine@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_ec_mul@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_ec_new@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_invm@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_point_new@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_point_release@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_point_set@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_print@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_release@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_scan@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_set_ui@GCRYPT_1.6' => 0,
                                                             'gcry_mpi_swap@GCRYPT_1.6' => 0,
                                                             'gcry_pk_decrypt@GCRYPT_1.6' => 0,
                                                             'gcry_sexp_build@GCRYPT_1.6' => 0,
                                                             'gcry_sexp_nth_mpi@GCRYPT_1.6' => 0,
                                                             'gcry_sexp_release@GCRYPT_1.6' => 0,
                                                             'gcry_strerror@GCRYPT_1.6' => 0,
                                                             'getdtablesize@GLIBC_2.2.5' => 0,
                                                             'getegid@GLIBC_2.2.5' => 0,
                                                             'getenv@GLIBC_2.2.5' => 0,
                                                             'geteuid@GLIBC_2.2.5' => 0,
                                                             'getgid@GLIBC_2.2.5' => 0,
                                                             'getgrgid@GLIBC_2.2.5' => 0,
                                                             'getifaddrs@GLIBC_2.3' => 0,
                                                             'getline@GLIBC_2.2.5' => 0,
                                                             'getpid@GLIBC_2.2.5' => 0,
                                                             'getpwuid@GLIBC_2.2.5' => 0,
                                                             'getresgid@GLIBC_2.2.5' => 0,
                                                             'getresuid@GLIBC_2.2.5' => 0,
                                                             'getrusage@GLIBC_2.2.5' => 0,
                                                             'gettimeofday@GLIBC_2.2.5' => 0,
                                                             'getuid@GLIBC_2.2.5' => 0,
                                                             'gnutls_pkcs12_bag_decrypt@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_deinit@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_get_count@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_get_data@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_get_type@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_bag_init@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_deinit@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_get_bag@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_import@GNUTLS_3_4' => 0,
                                                             'gnutls_pkcs12_init@GNUTLS_3_4' => 0,
                                                             'gnutls_strerror@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_deinit@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_export_rsa_raw@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_get_pk_algorithm@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_import@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_import_pkcs8@GNUTLS_3_4' => 0,
                                                             'gnutls_x509_privkey_init@GNUTLS_3_4' => 0,
                                                             'inet_ntop@GLIBC_2.2.5' => 0,
                                                             'inet_pton@GLIBC_2.2.5' => 0,
                                                             'localtime@GLIBC_2.2.5' => 0,
                                                             'mblen@GLIBC_2.2.5' => 0,
                                                             'mbtowc@GLIBC_2.2.5' => 0,
                                                             'memcmp@GLIBC_2.2.5' => 0,
                                                             'memcpy@GLIBC_2.14' => 0,
                                                             'memmem@GLIBC_2.2.5' => 0,
                                                             'memmove@GLIBC_2.2.5' => 0,
                                                             'memset@GLIBC_2.2.5' => 0,
                                                             'mkdir@GLIBC_2.2.5' => 0,
                                                             'mktime@GLIBC_2.2.5' => 0,
                                                             'open@GLIBC_2.2.5' => 0,
                                                             'pathconf@GLIBC_2.2.5' => 0,
                                                             'pcre2_code_free_8' => 0,
                                                             'pcre2_compile_8' => 0,
                                                             'pcre2_get_error_message_8' => 0,
                                                             'pcre2_get_ovector_pointer_8' => 0,
                                                             'pcre2_match_8' => 0,
                                                             'pcre2_match_data_create_8' => 0,
                                                             'pcre2_match_data_free_8' => 0,
